adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem_bitfields.h
/* Register: AESL2_EVENTS_MAC_READY */
/* Description: MAC calculated */

/* Bit 0 : MAC calculated */
#define AESL2_EVENTS_MAC_READY_EVENTS_MAC_READY_Pos (0UL) /*!< Position of EVENTS_MAC_READY field. */
#define AESL2_EVENTS_MAC_READY_EVENTS_MAC_READY_Msk (0x1UL << AESL2_EVENTS_MAC_READY_EVENTS_MAC_READY_Pos) /*!< Bit mask of EVENTS_MAC_READY field. */
#define AESL2_EVENTS_MAC_READY_EVENTS_MAC_READY_NotGenerated (0UL) /*!< Event not generated */
#define AESL2_EVENTS_MAC_READY_EVENTS_MAC_READY_Generated (1UL) /*!< Event generated */

/* Register: AESL2_EVENTS_RESETTED */
/* Description: Resetted (all transfers and crypto operations stopped) */

/* Bit 0 : Resetted (all transfers and crypto operations stopped) */
#define AESL2_EVENTS_RESETTED_EVENTS_RESETTED_Pos (0UL) /*!< Position of EVENTS_RESETTED field. */
#define AESL2_EVENTS_RESETTED_EVENTS_RESETTED_Msk (0x1UL << AESL2_EVENTS_RESETTED_EVENTS_RESETTED_Pos) /*!< Bit mask of EVENTS_RESETTED field. */
#define AESL2_EVENTS_RESETTED_EVENTS_RESETTED_NotGenerated (0UL) /*!< Event not generated */
#define AESL2_EVENTS_RESETTED_EVENTS_RESETTED_Generated (1UL) /*!< Event generated */

/* Register: AESL2_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 3 : Shortcut between event MESSAGE_READY and task FINALIZE_MAC */
#define AESL2_SHORTS_MESSAGE_READY_FINALIZE_MAC_Pos (3UL) /*!< Position of MESSAGE_READY_FINALIZE_MAC field. */
#define AESL2_SHORTS_MESSAGE_READY_FINALIZE_MAC_Msk (0x1UL << AESL2_SHORTS_MESSAGE_READY_FINALIZE_MAC_Pos) /*!< Bit mask of MESSAGE_READY_FINALIZE_MAC field. */
#define AESL2_SHORTS_MESSAGE_READY_FINALIZE_MAC_Disabled (0UL) /*!< Disable shortcut */
#define AESL2_SHORTS_MESSAGE_READY_FINALIZE_MAC_Enabled (1UL) /*!< Enable shortcut */

/* Bit 2 : Shortcut between event AES_INITIALIZED and task START_OPERATION */
#define AESL2_SHORTS_AES_INITIALIZED_START_OPERATION_Pos (2UL) /*!< Position of AES_INITIALIZED_START_OPERATION field. */
#define AESL2_SHORTS_AES_INITIALIZED_START_OPERATION_Msk (0x1UL << AESL2_SHORTS_AES_INITIALIZED_START_OPERATION_Pos) /*!< Bit mask of AES_INITIALIZED_START_OPERATION field. */
#define AESL2_SHORTS_AES_INITIALIZED_START_OPERATION_Disabled (0UL) /*!< Disable shortcut */
#define AESL2_SHORTS_AES_INITIALIZED_START_OPERATION_Enabled (1UL) /*!< Enable shortcut */

/* Bit 1 : Shortcut between event IV_READY and task INITIALIZE_AES */
#define AESL2_SHORTS_IV_READY_INITIALIZE_AES_Pos (1UL) /*!< Position of IV_READY_INITIALIZE_AES field. */
#define AESL2_SHORTS_IV_READY_INITIALIZE_AES_Msk (0x1UL << AESL2_SHORTS_IV_READY_INITIALIZE_AES_Pos) /*!< Bit mask of IV_READY_INITIALIZE_AES field. */
#define AESL2_SHORTS_IV_READY_INITIALIZE_AES_Disabled (0UL) /*!< Disable shortcut */
#define AESL2_SHORTS_IV_READY_INITIALIZE_AES_Enabled (1UL) /*!< Enable shortcut */

/* Bit 0 : Shortcut between event GATHER_STARTED and task START_SCATTER */
#define AESL2_SHORTS_GATHER_STARTED_START_SCATTER_Pos (0UL) /*!< Position of GATHER_STARTED_START_SCATTER field. */
#define AESL2_SHORTS_GATHER_STARTED_START_SCATTER_Msk (0x1UL << AESL2_SHORTS_GATHER_STARTED_START_SCATTER_Pos) /*!< Bit mask of GATHER_STARTED_START_SCATTER field. */
#define AESL2_SHORTS_GATHER_STARTED_START_SCATTER_Disabled (0UL) /*!< Disable shortcut */
#define AESL2_SHORTS_GATHER_STARTED_START_SCATTER_Enabled (1UL) /*!< Enable shortcut */

/* Register: AESL2_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 8 : Enable or disable interrupt for event RESETTED */
#define AESL2_INTEN_RESETTED_Pos (8UL) /*!< Position of RESETTED field. */
#define AESL2_INTEN_RESETTED_Msk (0x1UL << AESL2_INTEN_RESETTED_Pos) /*!< Bit mask of RESETTED field. */
#define AESL2_INTEN_RESETTED_Disabled (0UL) /*!< Disable */
#define AESL2_INTEN_RESETTED_Enabled (1UL) /*!< Enable */

/* Bit 7 : Enable or disable interrupt for event MAC_READY */
#define AESL2_INTEN_MAC_READY_Pos (7UL) /*!< Position of MAC_READY field. */
#define AESL2_INTEN_MAC_READY_Msk (0x1UL << AESL2_INTEN_MAC_READY_Pos) /*!< Bit mask of MAC_READY field. */
#define AESL2_INTEN_MAC_READY_Disabled (0UL) /*!< Disable */
#define AESL2_INTEN_MAC_READY_Enabled (1UL) /*!< Enable */

/* Bit 6 : Enable or disable interrupt for event MESSAGE_READY */
#define AESL2_INTEN_MESSAGE_READY_Pos (6UL) /*!< Position of MESSAGE_READY field. */
#define AESL2_INTEN_MESSAGE_READY_Msk (0x1UL << AESL2_INTEN_MESSAGE_READY_Pos) /*!< Bit mask of MESSAGE_READY field. */
#define AESL2_INTEN_MESSAGE_READY_Disabled (0UL) /*!< Disable */
#define AESL2_INTEN_MESSAGE_READY_Enabled (1UL) /*!< Enable */

/* Bit 5 : Enable or disable interrupt for event AES_INITIALIZED */
#define AESL2_INTEN_AES_INITIALIZED_Pos (5UL) /*!< Position of AES_INITIALIZED field. */
#define AESL2_INTEN_AES_INITIALIZED_Msk (0x1UL << AESL2_INTEN_AES_INITIALIZED_Pos) /*!< Bit mask of AES_INITIALIZED field. */
#define AESL2_INTEN_AES_INITIALIZED_Disabled (0UL) /*!< Disable */
#define AESL2_INTEN_AES_INITIALIZED_Enabled (1UL) /*!< Enable */

/* Bit 4 : Enable or disable interrupt for event IV_READY */
#define AESL2_INTEN_IV_READY_Pos (4UL) /*!< Position of IV_READY field. */
#define AESL2_INTEN_IV_READY_Msk (0x1UL << AESL2_INTEN_IV_READY_Pos) /*!< Bit mask of IV_READY field. */
#define AESL2_INTEN_IV_READY_Disabled (0UL) /*!< Disable */
#define AESL2_INTEN_IV_READY_Enabled (1UL) /*!< Enable */

/* Bit 3 : Enable or disable interrupt for event SCATTER_DONE */
#define AESL2_INTEN_SCATTER_DONE_Pos (3UL) /*!< Position of SCATTER_DONE field. */
#define AESL2_INTEN_SCATTER_DONE_Msk (0x1UL << AESL2_INTEN_SCATTER_DONE_Pos) /*!< Bit mask of SCATTER_DONE field. */
#define AESL2_INTEN_SCATTER_DONE_Disabled (0UL) /*!< Disable */
#define AESL2_INTEN_SCATTER_DONE_Enabled (1UL) /*!< Enable */

/* Bit 2 : Enable or disable interrupt for event SCATTER_STARTED */
#define AESL2_INTEN_SCATTER_STARTED_Pos (2UL) /*!< Position of SCATTER_STARTED field. */
#define AESL2_INTEN_SCATTER_STARTED_Msk (0x1UL << AESL2_INTEN_SCATTER_STARTED_Pos) /*!< Bit mask of SCATTER_STARTED field. */
#define AESL2_INTEN_SCATTER_STARTED_Disabled (0UL) /*!< Disable */
#define AESL2_INTEN_SCATTER_STARTED_Enabled (1UL) /*!< Enable */

/* Bit 1 : Enable or disable interrupt for event GATHER_DONE */
#define AESL2_INTEN_GATHER_DONE_Pos (1UL) /*!< Position of GATHER_DONE field. */
#define AESL2_INTEN_GATHER_DONE_Msk (0x1UL << AESL2_INTEN_GATHER_DONE_Pos) /*!< Bit mask of GATHER_DONE field. */
#define AESL2_INTEN_GATHER_DONE_Disabled (0UL) /*!< Disable */
#define AESL2_INTEN_GATHER_DONE_Enabled (1UL) /*!< Enable */

/* Bit 0 : Enable or disable interrupt for event GATHER_STARTED */
#define AESL2_INTEN_GATHER_STARTED_Pos (0UL) /*!< Position of GATHER_STARTED field. */
#define AESL2_INTEN_GATHER_STARTED_Msk (0x1UL << AESL2_INTEN_GATHER_STARTED_Pos) /*!< Bit mask of GATHER_STARTED field. */
#define AESL2_INTEN_GATHER_STARTED_Disabled (0UL) /*!< Disable */
#define AESL2_INTEN_GATHER_STARTED_Enabled (1UL) /*!< Enable */

/* Register: AESL2_INTENSET */
/* Description: Enable interrupt */

/* Bit 8 : Write '1' to enable interrupt for event RESETTED */
#define AESL2_INTENSET_RESETTED_Pos (8UL) /*!< Position of RESETTED field. */
#define AESL2_INTENSET_RESETTED_Msk (0x1UL << AESL2_INTENSET_RESETTED_Pos) /*!< Bit mask of RESETTED field. */
#define AESL2_INTENSET_RESETTED_Disabled (0UL) /*!< Read: Disabled */
#define AESL2_INTENSET_RESETTED_Enabled (1UL) /*!< Read: Enabled */
#define AESL2_INTENSET_RESETTED_Set (1UL) /*!< Enable */

/* Bit 7 : Write '1' to enable interrupt for event MAC_READY */
#define AESL2_INTENSET_MAC_READY_Pos (7UL) /*!< Position of MAC_READY field. */
#define AESL2_INTENSET_MAC_READY_Msk (0x1UL << AESL2_INTENSET_MAC_READY_Pos) /*!< Bit mask of MAC_READY field. */
#define AESL2_INTENSET_MAC_READY_Disabled (0UL) /*!< Read: Disabled */
#define AESL2_INTENSET_MAC_READY_Enabled (1UL) /*!< Read: Enabled */
#define AESL2_INTENSET_MAC_READY_Set (1UL) /*!< Enable */

/* Bit 6 : Write '1' to enable interrupt for event MESSAGE_READY */
#define AESL2_INTENSET_MESSAGE_READY_Pos (6UL) /*!< Position of MESSAGE_READY field. */
#define AESL2_INTENSET_MESSAGE_READY_Msk (0x1UL << AESL2_INTENSET_MESSAGE_READY_Pos) /*!< Bit mask of MESSAGE_READY field. */
#define AESL2_INTENSET_MESSAGE_READY_Disabled (0UL) /*!< Read: Disabled */
#define AESL2_INTENSET_MESSAGE_READY_Enabled (1UL) /*!< Read: Enabled */
#define AESL2_INTENSET_MESSAGE_READY_Set (1UL) /*!< Enable */

