adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem_bitfields.h
/* Bit 5 : Read pending status of interrupt for event AES_INITIALIZED */
#define AESL2_INTPEND_AES_INITIALIZED_Pos (5UL) /*!< Position of AES_INITIALIZED field. */
#define AESL2_INTPEND_AES_INITIALIZED_Msk (0x1UL << AESL2_INTPEND_AES_INITIALIZED_Pos) /*!< Bit mask of AES_INITIALIZED field. */
#define AESL2_INTPEND_AES_INITIALIZED_NotPending (0UL) /*!< Read: Not pending */
#define AESL2_INTPEND_AES_INITIALIZED_Pending (1UL) /*!< Read: Pending */

/* Bit 4 : Read pending status of interrupt for event IV_READY */
#define AESL2_INTPEND_IV_READY_Pos (4UL) /*!< Position of IV_READY field. */
#define AESL2_INTPEND_IV_READY_Msk (0x1UL << AESL2_INTPEND_IV_READY_Pos) /*!< Bit mask of IV_READY field. */
#define AESL2_INTPEND_IV_READY_NotPending (0UL) /*!< Read: Not pending */
#define AESL2_INTPEND_IV_READY_Pending (1UL) /*!< Read: Pending */

/* Bit 3 : Read pending status of interrupt for event SCATTER_DONE */
#define AESL2_INTPEND_SCATTER_DONE_Pos (3UL) /*!< Position of SCATTER_DONE field. */
#define AESL2_INTPEND_SCATTER_DONE_Msk (0x1UL << AESL2_INTPEND_SCATTER_DONE_Pos) /*!< Bit mask of SCATTER_DONE field. */
#define AESL2_INTPEND_SCATTER_DONE_NotPending (0UL) /*!< Read: Not pending */
#define AESL2_INTPEND_SCATTER_DONE_Pending (1UL) /*!< Read: Pending */

/* Bit 2 : Read pending status of interrupt for event SCATTER_STARTED */
#define AESL2_INTPEND_SCATTER_STARTED_Pos (2UL) /*!< Position of SCATTER_STARTED field. */
#define AESL2_INTPEND_SCATTER_STARTED_Msk (0x1UL << AESL2_INTPEND_SCATTER_STARTED_Pos) /*!< Bit mask of SCATTER_STARTED field. */
#define AESL2_INTPEND_SCATTER_STARTED_NotPending (0UL) /*!< Read: Not pending */
#define AESL2_INTPEND_SCATTER_STARTED_Pending (1UL) /*!< Read: Pending */

/* Bit 1 : Read pending status of interrupt for event GATHER_DONE */
#define AESL2_INTPEND_GATHER_DONE_Pos (1UL) /*!< Position of GATHER_DONE field. */
#define AESL2_INTPEND_GATHER_DONE_Msk (0x1UL << AESL2_INTPEND_GATHER_DONE_Pos) /*!< Bit mask of GATHER_DONE field. */
#define AESL2_INTPEND_GATHER_DONE_NotPending (0UL) /*!< Read: Not pending */
#define AESL2_INTPEND_GATHER_DONE_Pending (1UL) /*!< Read: Pending */

/* Bit 0 : Read pending status of interrupt for event GATHER_STARTED */
#define AESL2_INTPEND_GATHER_STARTED_Pos (0UL) /*!< Position of GATHER_STARTED field. */
#define AESL2_INTPEND_GATHER_STARTED_Msk (0x1UL << AESL2_INTPEND_GATHER_STARTED_Pos) /*!< Bit mask of GATHER_STARTED field. */
#define AESL2_INTPEND_GATHER_STARTED_NotPending (0UL) /*!< Read: Not pending */
#define AESL2_INTPEND_GATHER_STARTED_Pending (1UL) /*!< Read: Pending */

/* Register: AESL2_LENGTH */
/* Description: Keystream length in bits (Cipher), message length in bits (MAC) */

/* Bits 31..0 : LENGTH */
#define AESL2_LENGTH_LENGTH_Pos (0UL) /*!< Position of LENGTH field. */
#define AESL2_LENGTH_LENGTH_Msk (0xFFFFFFFFUL << AESL2_LENGTH_LENGTH_Pos) /*!< Bit mask of LENGTH field. */

/* Register: AESL2_MODE */
/* Description: Mode: 0 == Cipher, 1 == MAC */

/* Bit 0 : MODE */
#define AESL2_MODE_MODE_Pos (0UL) /*!< Position of MODE field. */
#define AESL2_MODE_MODE_Msk (0x1UL << AESL2_MODE_MODE_Pos) /*!< Bit mask of MODE field. */
#define AESL2_MODE_MODE_Cipher (0UL) /*!< Ciphering mode */
#define AESL2_MODE_MODE_MAC (1UL) /*!< CMAC mode */

/* Register: AESL2_MAC */
/* Description: EIA2 MAC */

/* Bits 31..0 : MAC */
#define AESL2_MAC_MAC_Pos (0UL) /*!< Position of MAC field. */
#define AESL2_MAC_MAC_Msk (0xFFFFFFFFUL << AESL2_MAC_MAC_Pos) /*!< Bit mask of MAC field. */

/* Register: AESL2_INJOBPTR */
/* Description: Input job pointer */

/* Bits 31..0 : INJOBPTR */
#define AESL2_INJOBPTR_INJOBPTR_Pos (0UL) /*!< Position of INJOBPTR field. */
#define AESL2_INJOBPTR_INJOBPTR_Msk (0xFFFFFFFFUL << AESL2_INJOBPTR_INJOBPTR_Pos) /*!< Bit mask of INJOBPTR field. */

/* Register: AESL2_OUTJOBPTR */
/* Description: Output job pointer */

/* Bits 31..0 : OUTJOBPTR */
#define AESL2_OUTJOBPTR_OUTJOBPTR_Pos (0UL) /*!< Position of OUTJOBPTR field. */
#define AESL2_OUTJOBPTR_OUTJOBPTR_Msk (0xFFFFFFFFUL << AESL2_OUTJOBPTR_OUTJOBPTR_Pos) /*!< Bit mask of OUTJOBPTR field. */


/* Peripheral: AMLI */
/* Description: AHB Multi-Layer Interface */

/* Register: AMLI_RAMPRI_CPU */
/* Description: AHB bus master priority register for CPU */

/* Bit 0 : Priority register for RAM AHB slaves */
#define AMLI_RAMPRI_CPU_RAM_0_Pos (0UL) /*!< Position of RAM_0 field. */
#define AMLI_RAMPRI_CPU_RAM_0_Msk (0x1UL << AMLI_RAMPRI_CPU_RAM_0_Pos) /*!< Bit mask of RAM_0 field. */
#define AMLI_RAMPRI_CPU_RAM_0_Pri0 (0UL) /*!< Priority 0 */
#define AMLI_RAMPRI_CPU_RAM_0_Pri1 (1UL) /*!< Priority 1 */

/* Register: AMLI_RAMPRI_EXTRAM */
/* Description: Description collection: AHB bus master priority register for external RAM slave port (EXTRAMs) */

/* Bit 0 : Priority register for RAM AHB slaves */
#define AMLI_RAMPRI_EXTRAM_RAM_0_Pos (0UL) /*!< Position of RAM_0 field. */
#define AMLI_RAMPRI_EXTRAM_RAM_0_Msk (0x1UL << AMLI_RAMPRI_EXTRAM_RAM_0_Pos) /*!< Bit mask of RAM_0 field. */
#define AMLI_RAMPRI_EXTRAM_RAM_0_Pri0 (0UL) /*!< Priority 0 */
#define AMLI_RAMPRI_EXTRAM_RAM_0_Pri1 (1UL) /*!< Priority 1 */


/* Peripheral: BBPLL */
/* Description: Base Band  PLL */

/* Register: BBPLL_FREQ */
/* Description: Frequency selection */

/* Bits 2..0 : Frequency selection */
#define BBPLL_FREQ_FREQ_Pos (0UL) /*!< Position of FREQ field. */
#define BBPLL_FREQ_FREQ_Msk (0x7UL << BBPLL_FREQ_FREQ_Pos) /*!< Bit mask of FREQ field. */
#define BBPLL_FREQ_FREQ_128 (0UL) /*!< 128 MHz */
#define BBPLL_FREQ_FREQ_144 (1UL) /*!< 144 MHz */
#define BBPLL_FREQ_FREQ_160 (2UL) /*!< 160 MHz (default) */
#define BBPLL_FREQ_FREQ_176 (3UL) /*!< 176 MHz */
#define BBPLL_FREQ_FREQ_192 (4UL) /*!< 192 MHz */


/* Peripheral: CLOCK */
/* Description: Clock Management */

/* Register: CLOCK_TASKS_HFCLKSTART */
/* Description: Start HFCLK crystal oscillator */

/* Bit 0 : Start HFCLK crystal oscillator */
#define CLOCK_TASKS_HFCLKSTART_TASKS_HFCLKSTART_Pos (0UL) /*!< Position of TASKS_HFCLKSTART field. */
#define CLOCK_TASKS_HFCLKSTART_TASKS_HFCLKSTART_Msk (0x1UL << CLOCK_TASKS_HFCLKSTART_TASKS_HFCLKSTART_Pos) /*!< Bit mask of TASKS_HFCLKSTART field. */
#define CLOCK_TASKS_HFCLKSTART_TASKS_HFCLKSTART_Trigger (1UL) /*!< Trigger task */

/* Register: CLOCK_TASKS_HFCLKSTOP */
/* Description: Stop HFCLK crystal oscillator */

/* Bit 0 : Stop HFCLK crystal oscillator */
#define CLOCK_TASKS_HFCLKSTOP_TASKS_HFCLKSTOP_Pos (0UL) /*!< Position of TASKS_HFCLKSTOP field. */
#define CLOCK_TASKS_HFCLKSTOP_TASKS_HFCLKSTOP_Msk (0x1UL << CLOCK_TASKS_HFCLKSTOP_TASKS_HFCLKSTOP_Pos) /*!< Bit mask of TASKS_HFCLKSTOP field. */
#define CLOCK_TASKS_HFCLKSTOP_TASKS_HFCLKSTOP_Trigger (1UL) /*!< Trigger task */

/* Register: CLOCK_TASKS_LFCLKSTART */
/* Description: Start LFCLK source */

/* Bit 0 : Start LFCLK source */
#define CLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Pos (0UL) /*!< Position of TASKS_LFCLKSTART field. */
#define CLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Msk (0x1UL << CLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Pos) /*!< Bit mask of TASKS_LFCLKSTART field. */
#define CLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Trigger (1UL) /*!< Trigger task */

