adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem_bitfields.h
/* Bit 1 : Control access to slave  1 of master EXTRAM[n]. */
#define DCNF_EXTRAM_PROTECT_SLAVE1_Pos (1UL) /*!< Position of SLAVE1 field. */
#define DCNF_EXTRAM_PROTECT_SLAVE1_Msk (0x1UL << DCNF_EXTRAM_PROTECT_SLAVE1_Pos) /*!< Bit mask of SLAVE1 field. */
#define DCNF_EXTRAM_PROTECT_SLAVE1_Allowed (0UL) /*!< Access to slave is possible */
#define DCNF_EXTRAM_PROTECT_SLAVE1_Blocked (1UL) /*!< Access to slave is blocked */

/* Bit 0 : Control access to slave  0 of master EXTRAM[n]. */
#define DCNF_EXTRAM_PROTECT_SLAVE0_Pos (0UL) /*!< Position of SLAVE0 field. */
#define DCNF_EXTRAM_PROTECT_SLAVE0_Msk (0x1UL << DCNF_EXTRAM_PROTECT_SLAVE0_Pos) /*!< Bit mask of SLAVE0 field. */
#define DCNF_EXTRAM_PROTECT_SLAVE0_Allowed (0UL) /*!< Access to slave is possible */
#define DCNF_EXTRAM_PROTECT_SLAVE0_Blocked (1UL) /*!< Access to slave is blocked */

/* Register: DCNF_EXTCODE_PROTECT */
/* Description: Description cluster: Control access from  Master connected to AMLI master port EXTCODE[n] */

/* Bit 2 : Control access to slave  2 of master EXTCODE[n]. */
#define DCNF_EXTCODE_PROTECT_SLAVE2_Pos (2UL) /*!< Position of SLAVE2 field. */
#define DCNF_EXTCODE_PROTECT_SLAVE2_Msk (0x1UL << DCNF_EXTCODE_PROTECT_SLAVE2_Pos) /*!< Bit mask of SLAVE2 field. */
#define DCNF_EXTCODE_PROTECT_SLAVE2_Allowed (0UL) /*!< Access to slave is possible */
#define DCNF_EXTCODE_PROTECT_SLAVE2_Blocked (1UL) /*!< Access to slave is blocked */

/* Bit 1 : Control access to slave  1 of master EXTCODE[n]. */
#define DCNF_EXTCODE_PROTECT_SLAVE1_Pos (1UL) /*!< Position of SLAVE1 field. */
#define DCNF_EXTCODE_PROTECT_SLAVE1_Msk (0x1UL << DCNF_EXTCODE_PROTECT_SLAVE1_Pos) /*!< Bit mask of SLAVE1 field. */
#define DCNF_EXTCODE_PROTECT_SLAVE1_Allowed (0UL) /*!< Access to slave is possible */
#define DCNF_EXTCODE_PROTECT_SLAVE1_Blocked (1UL) /*!< Access to slave is blocked */

/* Bit 0 : Control access to slave  0 of master EXTCODE[n]. */
#define DCNF_EXTCODE_PROTECT_SLAVE0_Pos (0UL) /*!< Position of SLAVE0 field. */
#define DCNF_EXTCODE_PROTECT_SLAVE0_Msk (0x1UL << DCNF_EXTCODE_PROTECT_SLAVE0_Pos) /*!< Bit mask of SLAVE0 field. */
#define DCNF_EXTCODE_PROTECT_SLAVE0_Allowed (0UL) /*!< Access to slave is possible */
#define DCNF_EXTCODE_PROTECT_SLAVE0_Blocked (1UL) /*!< Access to slave is blocked */

/* Register: DCNF_CSTNUMPRETICKS */
/* Description: ClockStatusTracker pretick count setting */

/* Bits 5..0 : Pretick count setting. */
#define DCNF_CSTNUMPRETICKS_NUMPRETICKS_Pos (0UL) /*!< Position of NUMPRETICKS field. */
#define DCNF_CSTNUMPRETICKS_NUMPRETICKS_Msk (0x3FUL << DCNF_CSTNUMPRETICKS_NUMPRETICKS_Pos) /*!< Bit mask of NUMPRETICKS field. */

/* Register: DCNF_CSTNUMPOSTTICKS */
/* Description: ClockStatusTracker posttick count setting */

/* Bits 5..0 : Posttick count setting. */
#define DCNF_CSTNUMPOSTTICKS_NUMPOSTTICKS_Pos (0UL) /*!< Position of NUMPOSTTICKS field. */
#define DCNF_CSTNUMPOSTTICKS_NUMPOSTTICKS_Msk (0x3FUL << DCNF_CSTNUMPOSTTICKS_NUMPOSTTICKS_Pos) /*!< Bit mask of NUMPOSTTICKS field. */


/* Peripheral: DES */
/* Description: DES HW Accelerator */

/* Register: DES_TASKS_START_GATHER */
/* Description: Start input DMA */

/* Bit 0 : Start input DMA */
#define DES_TASKS_START_GATHER_TASKS_START_GATHER_Pos (0UL) /*!< Position of TASKS_START_GATHER field. */
#define DES_TASKS_START_GATHER_TASKS_START_GATHER_Msk (0x1UL << DES_TASKS_START_GATHER_TASKS_START_GATHER_Pos) /*!< Bit mask of TASKS_START_GATHER field. */
#define DES_TASKS_START_GATHER_TASKS_START_GATHER_Trigger (1UL) /*!< Trigger task */

/* Register: DES_TASKS_STOP_GATHER */
/* Description: Stop  input DMA */

/* Bit 0 : Stop  input DMA */
#define DES_TASKS_STOP_GATHER_TASKS_STOP_GATHER_Pos (0UL) /*!< Position of TASKS_STOP_GATHER field. */
#define DES_TASKS_STOP_GATHER_TASKS_STOP_GATHER_Msk (0x1UL << DES_TASKS_STOP_GATHER_TASKS_STOP_GATHER_Pos) /*!< Bit mask of TASKS_STOP_GATHER field. */
#define DES_TASKS_STOP_GATHER_TASKS_STOP_GATHER_Trigger (1UL) /*!< Trigger task */

/* Register: DES_TASKS_START_SCATTER */
/* Description: Start output DMA */

/* Bit 0 : Start output DMA */
#define DES_TASKS_START_SCATTER_TASKS_START_SCATTER_Pos (0UL) /*!< Position of TASKS_START_SCATTER field. */
#define DES_TASKS_START_SCATTER_TASKS_START_SCATTER_Msk (0x1UL << DES_TASKS_START_SCATTER_TASKS_START_SCATTER_Pos) /*!< Bit mask of TASKS_START_SCATTER field. */
#define DES_TASKS_START_SCATTER_TASKS_START_SCATTER_Trigger (1UL) /*!< Trigger task */

/* Register: DES_TASKS_STOP_SCATTER */
/* Description: Stop  output DMA */

/* Bit 0 : Stop  output DMA */
#define DES_TASKS_STOP_SCATTER_TASKS_STOP_SCATTER_Pos (0UL) /*!< Position of TASKS_STOP_SCATTER field. */
#define DES_TASKS_STOP_SCATTER_TASKS_STOP_SCATTER_Msk (0x1UL << DES_TASKS_STOP_SCATTER_TASKS_STOP_SCATTER_Pos) /*!< Bit mask of TASKS_STOP_SCATTER field. */
#define DES_TASKS_STOP_SCATTER_TASKS_STOP_SCATTER_Trigger (1UL) /*!< Trigger task */

/* Register: DES_TASKS_INITIALIZE_DES */
/* Description: New keys (and IV) ready to be used, reset keybytes, ivbytes */

/* Bit 0 : New keys (and IV) ready to be used, reset keybytes, ivbytes */
#define DES_TASKS_INITIALIZE_DES_TASKS_INITIALIZE_DES_Pos (0UL) /*!< Position of TASKS_INITIALIZE_DES field. */
#define DES_TASKS_INITIALIZE_DES_TASKS_INITIALIZE_DES_Msk (0x1UL << DES_TASKS_INITIALIZE_DES_TASKS_INITIALIZE_DES_Pos) /*!< Bit mask of TASKS_INITIALIZE_DES field. */
#define DES_TASKS_INITIALIZE_DES_TASKS_INITIALIZE_DES_Trigger (1UL) /*!< Trigger task */

/* Register: DES_TASKS_FILL_DES_INPUT */
/* Description: Transfer 8 bytes of input from DMA to DES core */

/* Bit 0 : Transfer 8 bytes of input from DMA to DES core */
#define DES_TASKS_FILL_DES_INPUT_TASKS_FILL_DES_INPUT_Pos (0UL) /*!< Position of TASKS_FILL_DES_INPUT field. */
#define DES_TASKS_FILL_DES_INPUT_TASKS_FILL_DES_INPUT_Msk (0x1UL << DES_TASKS_FILL_DES_INPUT_TASKS_FILL_DES_INPUT_Pos) /*!< Bit mask of TASKS_FILL_DES_INPUT field. */
#define DES_TASKS_FILL_DES_INPUT_TASKS_FILL_DES_INPUT_Trigger (1UL) /*!< Trigger task */

/* Register: DES_TASKS_DES_ENCRYPT_1 */
/* Description: Starts DES encryption with keyset 1 ( input -&gt; output) */

