adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem_bitfields.h
/* Bit 0 : Starts DES encryption with keyset 1 ( input -&gt; output) */
#define DES_TASKS_DES_ENCRYPT_1_TASKS_DES_ENCRYPT_1_Pos (0UL) /*!< Position of TASKS_DES_ENCRYPT_1 field. */
#define DES_TASKS_DES_ENCRYPT_1_TASKS_DES_ENCRYPT_1_Msk (0x1UL << DES_TASKS_DES_ENCRYPT_1_TASKS_DES_ENCRYPT_1_Pos) /*!< Bit mask of TASKS_DES_ENCRYPT_1 field. */
#define DES_TASKS_DES_ENCRYPT_1_TASKS_DES_ENCRYPT_1_Trigger (1UL) /*!< Trigger task */

/* Register: DES_TASKS_DES_DECRYPT_1 */
/* Description: Starts DES decryption with keyset 1 ( input -&gt; output) */

/* Bit 0 : Starts DES decryption with keyset 1 ( input -&gt; output) */
#define DES_TASKS_DES_DECRYPT_1_TASKS_DES_DECRYPT_1_Pos (0UL) /*!< Position of TASKS_DES_DECRYPT_1 field. */
#define DES_TASKS_DES_DECRYPT_1_TASKS_DES_DECRYPT_1_Msk (0x1UL << DES_TASKS_DES_DECRYPT_1_TASKS_DES_DECRYPT_1_Pos) /*!< Bit mask of TASKS_DES_DECRYPT_1 field. */
#define DES_TASKS_DES_DECRYPT_1_TASKS_DES_DECRYPT_1_Trigger (1UL) /*!< Trigger task */

/* Register: DES_TASKS_DES_ENCRYPT_2 */
/* Description: Starts DES encryption with keyset 2 (output -&gt; output) */

/* Bit 0 : Starts DES encryption with keyset 2 (output -&gt; output) */
#define DES_TASKS_DES_ENCRYPT_2_TASKS_DES_ENCRYPT_2_Pos (0UL) /*!< Position of TASKS_DES_ENCRYPT_2 field. */
#define DES_TASKS_DES_ENCRYPT_2_TASKS_DES_ENCRYPT_2_Msk (0x1UL << DES_TASKS_DES_ENCRYPT_2_TASKS_DES_ENCRYPT_2_Pos) /*!< Bit mask of TASKS_DES_ENCRYPT_2 field. */
#define DES_TASKS_DES_ENCRYPT_2_TASKS_DES_ENCRYPT_2_Trigger (1UL) /*!< Trigger task */

/* Register: DES_TASKS_DES_DECRYPT_2 */
/* Description: Starts DES decryption with keyset 2 (output -&gt; output) */

/* Bit 0 : Starts DES decryption with keyset 2 (output -&gt; output) */
#define DES_TASKS_DES_DECRYPT_2_TASKS_DES_DECRYPT_2_Pos (0UL) /*!< Position of TASKS_DES_DECRYPT_2 field. */
#define DES_TASKS_DES_DECRYPT_2_TASKS_DES_DECRYPT_2_Msk (0x1UL << DES_TASKS_DES_DECRYPT_2_TASKS_DES_DECRYPT_2_Pos) /*!< Bit mask of TASKS_DES_DECRYPT_2 field. */
#define DES_TASKS_DES_DECRYPT_2_TASKS_DES_DECRYPT_2_Trigger (1UL) /*!< Trigger task */

/* Register: DES_TASKS_DES_ENCRYPT_3 */
/* Description: Starts DES encryption with keyset 3 (output -&gt; output) */

/* Bit 0 : Starts DES encryption with keyset 3 (output -&gt; output) */
#define DES_TASKS_DES_ENCRYPT_3_TASKS_DES_ENCRYPT_3_Pos (0UL) /*!< Position of TASKS_DES_ENCRYPT_3 field. */
#define DES_TASKS_DES_ENCRYPT_3_TASKS_DES_ENCRYPT_3_Msk (0x1UL << DES_TASKS_DES_ENCRYPT_3_TASKS_DES_ENCRYPT_3_Pos) /*!< Bit mask of TASKS_DES_ENCRYPT_3 field. */
#define DES_TASKS_DES_ENCRYPT_3_TASKS_DES_ENCRYPT_3_Trigger (1UL) /*!< Trigger task */

/* Register: DES_TASKS_DES_DECRYPT_3 */
/* Description: Starts DES decryption with keyset 3 (output -&gt; output) */

/* Bit 0 : Starts DES decryption with keyset 3 (output -&gt; output) */
#define DES_TASKS_DES_DECRYPT_3_TASKS_DES_DECRYPT_3_Pos (0UL) /*!< Position of TASKS_DES_DECRYPT_3 field. */
#define DES_TASKS_DES_DECRYPT_3_TASKS_DES_DECRYPT_3_Msk (0x1UL << DES_TASKS_DES_DECRYPT_3_TASKS_DES_DECRYPT_3_Pos) /*!< Bit mask of TASKS_DES_DECRYPT_3 field. */
#define DES_TASKS_DES_DECRYPT_3_TASKS_DES_DECRYPT_3_Trigger (1UL) /*!< Trigger task */

/* Register: DES_TASKS_DRAIN_DES_OUTPUT */
/* Description: Transfer 8 bytes of output from DES core to DMA */

/* Bit 0 : Transfer 8 bytes of output from DES core to DMA */
#define DES_TASKS_DRAIN_DES_OUTPUT_TASKS_DRAIN_DES_OUTPUT_Pos (0UL) /*!< Position of TASKS_DRAIN_DES_OUTPUT field. */
#define DES_TASKS_DRAIN_DES_OUTPUT_TASKS_DRAIN_DES_OUTPUT_Msk (0x1UL << DES_TASKS_DRAIN_DES_OUTPUT_TASKS_DRAIN_DES_OUTPUT_Pos) /*!< Bit mask of TASKS_DRAIN_DES_OUTPUT field. */
#define DES_TASKS_DRAIN_DES_OUTPUT_TASKS_DRAIN_DES_OUTPUT_Trigger (1UL) /*!< Trigger task */

/* Register: DES_TASKS_RESET */
/* Description: Stop all transfers and crypto operations (software reset) */

/* Bit 0 : Stop all transfers and crypto operations (software reset) */
#define DES_TASKS_RESET_TASKS_RESET_Pos (0UL) /*!< Position of TASKS_RESET field. */
#define DES_TASKS_RESET_TASKS_RESET_Msk (0x1UL << DES_TASKS_RESET_TASKS_RESET_Pos) /*!< Bit mask of TASKS_RESET field. */
#define DES_TASKS_RESET_TASKS_RESET_Trigger (1UL) /*!< Trigger task */

/* Register: DES_EVENTS_GATHER_STARTED */
/* Description: Input DMA started */

/* Bit 0 : Input DMA started */
#define DES_EVENTS_GATHER_STARTED_EVENTS_GATHER_STARTED_Pos (0UL) /*!< Position of EVENTS_GATHER_STARTED field. */
#define DES_EVENTS_GATHER_STARTED_EVENTS_GATHER_STARTED_Msk (0x1UL << DES_EVENTS_GATHER_STARTED_EVENTS_GATHER_STARTED_Pos) /*!< Bit mask of EVENTS_GATHER_STARTED field. */
#define DES_EVENTS_GATHER_STARTED_EVENTS_GATHER_STARTED_NotGenerated (0UL) /*!< Event not generated */
#define DES_EVENTS_GATHER_STARTED_EVENTS_GATHER_STARTED_Generated (1UL) /*!< Event generated */

/* Register: DES_EVENTS_GATHER_DONE */
/* Description: Input DMA done */

/* Bit 0 : Input DMA done */
#define DES_EVENTS_GATHER_DONE_EVENTS_GATHER_DONE_Pos (0UL) /*!< Position of EVENTS_GATHER_DONE field. */
#define DES_EVENTS_GATHER_DONE_EVENTS_GATHER_DONE_Msk (0x1UL << DES_EVENTS_GATHER_DONE_EVENTS_GATHER_DONE_Pos) /*!< Bit mask of EVENTS_GATHER_DONE field. */
#define DES_EVENTS_GATHER_DONE_EVENTS_GATHER_DONE_NotGenerated (0UL) /*!< Event not generated */
#define DES_EVENTS_GATHER_DONE_EVENTS_GATHER_DONE_Generated (1UL) /*!< Event generated */

/* Register: DES_EVENTS_SCATTER_STARTED */
/* Description: Output DMA started */

/* Bit 0 : Output DMA started */
#define DES_EVENTS_SCATTER_STARTED_EVENTS_SCATTER_STARTED_Pos (0UL) /*!< Position of EVENTS_SCATTER_STARTED field. */
#define DES_EVENTS_SCATTER_STARTED_EVENTS_SCATTER_STARTED_Msk (0x1UL << DES_EVENTS_SCATTER_STARTED_EVENTS_SCATTER_STARTED_Pos) /*!< Bit mask of EVENTS_SCATTER_STARTED field. */
#define DES_EVENTS_SCATTER_STARTED_EVENTS_SCATTER_STARTED_NotGenerated (0UL) /*!< Event not generated */
#define DES_EVENTS_SCATTER_STARTED_EVENTS_SCATTER_STARTED_Generated (1UL) /*!< Event generated */

/* Register: DES_EVENTS_SCATTER_DONE */
/* Description: Output DMA done */

