adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem_bitfields.h
/* Bit 0 : Output DMA done */
#define DES_EVENTS_SCATTER_DONE_EVENTS_SCATTER_DONE_Pos (0UL) /*!< Position of EVENTS_SCATTER_DONE field. */
#define DES_EVENTS_SCATTER_DONE_EVENTS_SCATTER_DONE_Msk (0x1UL << DES_EVENTS_SCATTER_DONE_EVENTS_SCATTER_DONE_Pos) /*!< Bit mask of EVENTS_SCATTER_DONE field. */
#define DES_EVENTS_SCATTER_DONE_EVENTS_SCATTER_DONE_NotGenerated (0UL) /*!< Event not generated */
#define DES_EVENTS_SCATTER_DONE_EVENTS_SCATTER_DONE_Generated (1UL) /*!< Event generated */

/* Register: DES_EVENTS_KEY_1_READY */
/* Description: Key #1 received (keybytes == 8) */

/* Bit 0 : Key #1 received (keybytes == 8) */
#define DES_EVENTS_KEY_1_READY_EVENTS_KEY_1_READY_Pos (0UL) /*!< Position of EVENTS_KEY_1_READY field. */
#define DES_EVENTS_KEY_1_READY_EVENTS_KEY_1_READY_Msk (0x1UL << DES_EVENTS_KEY_1_READY_EVENTS_KEY_1_READY_Pos) /*!< Bit mask of EVENTS_KEY_1_READY field. */
#define DES_EVENTS_KEY_1_READY_EVENTS_KEY_1_READY_NotGenerated (0UL) /*!< Event not generated */
#define DES_EVENTS_KEY_1_READY_EVENTS_KEY_1_READY_Generated (1UL) /*!< Event generated */

/* Register: DES_EVENTS_KEY_3_READY */
/* Description: Keys #1, #2 and #3 received (keybytes == 24) */

/* Bit 0 : Keys #1, #2 and #3 received (keybytes == 24) */
#define DES_EVENTS_KEY_3_READY_EVENTS_KEY_3_READY_Pos (0UL) /*!< Position of EVENTS_KEY_3_READY field. */
#define DES_EVENTS_KEY_3_READY_EVENTS_KEY_3_READY_Msk (0x1UL << DES_EVENTS_KEY_3_READY_EVENTS_KEY_3_READY_Pos) /*!< Bit mask of EVENTS_KEY_3_READY field. */
#define DES_EVENTS_KEY_3_READY_EVENTS_KEY_3_READY_NotGenerated (0UL) /*!< Event not generated */
#define DES_EVENTS_KEY_3_READY_EVENTS_KEY_3_READY_Generated (1UL) /*!< Event generated */

/* Register: DES_EVENTS_IV_READY */
/* Description: IV received (ivbytes == 8) */

/* Bit 0 : IV received (ivbytes == 8) */
#define DES_EVENTS_IV_READY_EVENTS_IV_READY_Pos (0UL) /*!< Position of EVENTS_IV_READY field. */
#define DES_EVENTS_IV_READY_EVENTS_IV_READY_Msk (0x1UL << DES_EVENTS_IV_READY_EVENTS_IV_READY_Pos) /*!< Bit mask of EVENTS_IV_READY field. */
#define DES_EVENTS_IV_READY_EVENTS_IV_READY_NotGenerated (0UL) /*!< Event not generated */
#define DES_EVENTS_IV_READY_EVENTS_IV_READY_Generated (1UL) /*!< Event generated */

/* Register: DES_EVENTS_DES_INITIALIZED */
/* Description: New keys (and IV) taken into use */

/* Bit 0 : New keys (and IV) taken into use */
#define DES_EVENTS_DES_INITIALIZED_EVENTS_DES_INITIALIZED_Pos (0UL) /*!< Position of EVENTS_DES_INITIALIZED field. */
#define DES_EVENTS_DES_INITIALIZED_EVENTS_DES_INITIALIZED_Msk (0x1UL << DES_EVENTS_DES_INITIALIZED_EVENTS_DES_INITIALIZED_Pos) /*!< Bit mask of EVENTS_DES_INITIALIZED field. */
#define DES_EVENTS_DES_INITIALIZED_EVENTS_DES_INITIALIZED_NotGenerated (0UL) /*!< Event not generated */
#define DES_EVENTS_DES_INITIALIZED_EVENTS_DES_INITIALIZED_Generated (1UL) /*!< Event generated */

/* Register: DES_EVENTS_DES_INPUT_FULL */
/* Description: 8 bytes of input stored to DES core */

/* Bit 0 : 8 bytes of input stored to DES core */
#define DES_EVENTS_DES_INPUT_FULL_EVENTS_DES_INPUT_FULL_Pos (0UL) /*!< Position of EVENTS_DES_INPUT_FULL field. */
#define DES_EVENTS_DES_INPUT_FULL_EVENTS_DES_INPUT_FULL_Msk (0x1UL << DES_EVENTS_DES_INPUT_FULL_EVENTS_DES_INPUT_FULL_Pos) /*!< Bit mask of EVENTS_DES_INPUT_FULL field. */
#define DES_EVENTS_DES_INPUT_FULL_EVENTS_DES_INPUT_FULL_NotGenerated (0UL) /*!< Event not generated */
#define DES_EVENTS_DES_INPUT_FULL_EVENTS_DES_INPUT_FULL_Generated (1UL) /*!< Event generated */

/* Register: DES_EVENTS_DES_DONE_1 */
/* Description: Action with key 1 ready */

/* Bit 0 : Action with key 1 ready */
#define DES_EVENTS_DES_DONE_1_EVENTS_DES_DONE_1_Pos (0UL) /*!< Position of EVENTS_DES_DONE_1 field. */
#define DES_EVENTS_DES_DONE_1_EVENTS_DES_DONE_1_Msk (0x1UL << DES_EVENTS_DES_DONE_1_EVENTS_DES_DONE_1_Pos) /*!< Bit mask of EVENTS_DES_DONE_1 field. */
#define DES_EVENTS_DES_DONE_1_EVENTS_DES_DONE_1_NotGenerated (0UL) /*!< Event not generated */
#define DES_EVENTS_DES_DONE_1_EVENTS_DES_DONE_1_Generated (1UL) /*!< Event generated */

/* Register: DES_EVENTS_DES_DONE_2 */
/* Description: Action with key 2 ready */

/* Bit 0 : Action with key 2 ready */
#define DES_EVENTS_DES_DONE_2_EVENTS_DES_DONE_2_Pos (0UL) /*!< Position of EVENTS_DES_DONE_2 field. */
#define DES_EVENTS_DES_DONE_2_EVENTS_DES_DONE_2_Msk (0x1UL << DES_EVENTS_DES_DONE_2_EVENTS_DES_DONE_2_Pos) /*!< Bit mask of EVENTS_DES_DONE_2 field. */
#define DES_EVENTS_DES_DONE_2_EVENTS_DES_DONE_2_NotGenerated (0UL) /*!< Event not generated */
#define DES_EVENTS_DES_DONE_2_EVENTS_DES_DONE_2_Generated (1UL) /*!< Event generated */

/* Register: DES_EVENTS_DES_DONE_3 */
/* Description: Action with key 3 ready */

/* Bit 0 : Action with key 3 ready */
#define DES_EVENTS_DES_DONE_3_EVENTS_DES_DONE_3_Pos (0UL) /*!< Position of EVENTS_DES_DONE_3 field. */
#define DES_EVENTS_DES_DONE_3_EVENTS_DES_DONE_3_Msk (0x1UL << DES_EVENTS_DES_DONE_3_EVENTS_DES_DONE_3_Pos) /*!< Bit mask of EVENTS_DES_DONE_3 field. */
#define DES_EVENTS_DES_DONE_3_EVENTS_DES_DONE_3_NotGenerated (0UL) /*!< Event not generated */
#define DES_EVENTS_DES_DONE_3_EVENTS_DES_DONE_3_Generated (1UL) /*!< Event generated */

/* Register: DES_EVENTS_DES_OUTPUT_EMPTY */
/* Description: 8 bytes of output read from DES core */

/* Bit 0 : 8 bytes of output read from DES core */
#define DES_EVENTS_DES_OUTPUT_EMPTY_EVENTS_DES_OUTPUT_EMPTY_Pos (0UL) /*!< Position of EVENTS_DES_OUTPUT_EMPTY field. */
#define DES_EVENTS_DES_OUTPUT_EMPTY_EVENTS_DES_OUTPUT_EMPTY_Msk (0x1UL << DES_EVENTS_DES_OUTPUT_EMPTY_EVENTS_DES_OUTPUT_EMPTY_Pos) /*!< Bit mask of EVENTS_DES_OUTPUT_EMPTY field. */
#define DES_EVENTS_DES_OUTPUT_EMPTY_EVENTS_DES_OUTPUT_EMPTY_NotGenerated (0UL) /*!< Event not generated */
#define DES_EVENTS_DES_OUTPUT_EMPTY_EVENTS_DES_OUTPUT_EMPTY_Generated (1UL) /*!< Event generated */

/* Register: DES_EVENTS_RESETTED */
/* Description: Resetted (all transfers and crypto operations stopped) */

/* Bit 0 : Resetted (all transfers and crypto operations stopped) */
#define DES_EVENTS_RESETTED_EVENTS_RESETTED_Pos (0UL) /*!< Position of EVENTS_RESETTED field. */
#define DES_EVENTS_RESETTED_EVENTS_RESETTED_Msk (0x1UL << DES_EVENTS_RESETTED_EVENTS_RESETTED_Pos) /*!< Bit mask of EVENTS_RESETTED field. */
#define DES_EVENTS_RESETTED_EVENTS_RESETTED_NotGenerated (0UL) /*!< Event not generated */
#define DES_EVENTS_RESETTED_EVENTS_RESETTED_Generated (1UL) /*!< Event generated */

/* Register: DES_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 13 : Shortcut between event DES_INITIALIZED and task FILL_DES_INPUT */
#define DES_SHORTS_DES_INITIALIZED_FILL_DES_INPUT_Pos (13UL) /*!< Position of DES_INITIALIZED_FILL_DES_INPUT field. */
#define DES_SHORTS_DES_INITIALIZED_FILL_DES_INPUT_Msk (0x1UL << DES_SHORTS_DES_INITIALIZED_FILL_DES_INPUT_Pos) /*!< Bit mask of DES_INITIALIZED_FILL_DES_INPUT field. */
#define DES_SHORTS_DES_INITIALIZED_FILL_DES_INPUT_Disabled (0UL) /*!< Disable shortcut */
#define DES_SHORTS_DES_INITIALIZED_FILL_DES_INPUT_Enabled (1UL) /*!< Enable shortcut */

