adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem_bitfields.h
/* Bit 11 : Enable or disable interrupt for event DES_DONE_3 */
#define DES_INTEN_DES_DONE_3_Pos (11UL) /*!< Position of DES_DONE_3 field. */
#define DES_INTEN_DES_DONE_3_Msk (0x1UL << DES_INTEN_DES_DONE_3_Pos) /*!< Bit mask of DES_DONE_3 field. */
#define DES_INTEN_DES_DONE_3_Disabled (0UL) /*!< Disable */
#define DES_INTEN_DES_DONE_3_Enabled (1UL) /*!< Enable */

/* Bit 10 : Enable or disable interrupt for event DES_DONE_2 */
#define DES_INTEN_DES_DONE_2_Pos (10UL) /*!< Position of DES_DONE_2 field. */
#define DES_INTEN_DES_DONE_2_Msk (0x1UL << DES_INTEN_DES_DONE_2_Pos) /*!< Bit mask of DES_DONE_2 field. */
#define DES_INTEN_DES_DONE_2_Disabled (0UL) /*!< Disable */
#define DES_INTEN_DES_DONE_2_Enabled (1UL) /*!< Enable */

/* Bit 9 : Enable or disable interrupt for event DES_DONE_1 */
#define DES_INTEN_DES_DONE_1_Pos (9UL) /*!< Position of DES_DONE_1 field. */
#define DES_INTEN_DES_DONE_1_Msk (0x1UL << DES_INTEN_DES_DONE_1_Pos) /*!< Bit mask of DES_DONE_1 field. */
#define DES_INTEN_DES_DONE_1_Disabled (0UL) /*!< Disable */
#define DES_INTEN_DES_DONE_1_Enabled (1UL) /*!< Enable */

/* Bit 8 : Enable or disable interrupt for event DES_INPUT_FULL */
#define DES_INTEN_DES_INPUT_FULL_Pos (8UL) /*!< Position of DES_INPUT_FULL field. */
#define DES_INTEN_DES_INPUT_FULL_Msk (0x1UL << DES_INTEN_DES_INPUT_FULL_Pos) /*!< Bit mask of DES_INPUT_FULL field. */
#define DES_INTEN_DES_INPUT_FULL_Disabled (0UL) /*!< Disable */
#define DES_INTEN_DES_INPUT_FULL_Enabled (1UL) /*!< Enable */

/* Bit 7 : Enable or disable interrupt for event DES_INITIALIZED */
#define DES_INTEN_DES_INITIALIZED_Pos (7UL) /*!< Position of DES_INITIALIZED field. */
#define DES_INTEN_DES_INITIALIZED_Msk (0x1UL << DES_INTEN_DES_INITIALIZED_Pos) /*!< Bit mask of DES_INITIALIZED field. */
#define DES_INTEN_DES_INITIALIZED_Disabled (0UL) /*!< Disable */
#define DES_INTEN_DES_INITIALIZED_Enabled (1UL) /*!< Enable */

/* Bit 6 : Enable or disable interrupt for event IV_READY */
#define DES_INTEN_IV_READY_Pos (6UL) /*!< Position of IV_READY field. */
#define DES_INTEN_IV_READY_Msk (0x1UL << DES_INTEN_IV_READY_Pos) /*!< Bit mask of IV_READY field. */
#define DES_INTEN_IV_READY_Disabled (0UL) /*!< Disable */
#define DES_INTEN_IV_READY_Enabled (1UL) /*!< Enable */

/* Bit 5 : Enable or disable interrupt for event KEY_3_READY */
#define DES_INTEN_KEY_3_READY_Pos (5UL) /*!< Position of KEY_3_READY field. */
#define DES_INTEN_KEY_3_READY_Msk (0x1UL << DES_INTEN_KEY_3_READY_Pos) /*!< Bit mask of KEY_3_READY field. */
#define DES_INTEN_KEY_3_READY_Disabled (0UL) /*!< Disable */
#define DES_INTEN_KEY_3_READY_Enabled (1UL) /*!< Enable */

/* Bit 4 : Enable or disable interrupt for event KEY_1_READY */
#define DES_INTEN_KEY_1_READY_Pos (4UL) /*!< Position of KEY_1_READY field. */
#define DES_INTEN_KEY_1_READY_Msk (0x1UL << DES_INTEN_KEY_1_READY_Pos) /*!< Bit mask of KEY_1_READY field. */
#define DES_INTEN_KEY_1_READY_Disabled (0UL) /*!< Disable */
#define DES_INTEN_KEY_1_READY_Enabled (1UL) /*!< Enable */

/* Bit 3 : Enable or disable interrupt for event SCATTER_DONE */
#define DES_INTEN_SCATTER_DONE_Pos (3UL) /*!< Position of SCATTER_DONE field. */
#define DES_INTEN_SCATTER_DONE_Msk (0x1UL << DES_INTEN_SCATTER_DONE_Pos) /*!< Bit mask of SCATTER_DONE field. */
#define DES_INTEN_SCATTER_DONE_Disabled (0UL) /*!< Disable */
#define DES_INTEN_SCATTER_DONE_Enabled (1UL) /*!< Enable */

/* Bit 2 : Enable or disable interrupt for event SCATTER_STARTED */
#define DES_INTEN_SCATTER_STARTED_Pos (2UL) /*!< Position of SCATTER_STARTED field. */
#define DES_INTEN_SCATTER_STARTED_Msk (0x1UL << DES_INTEN_SCATTER_STARTED_Pos) /*!< Bit mask of SCATTER_STARTED field. */
#define DES_INTEN_SCATTER_STARTED_Disabled (0UL) /*!< Disable */
#define DES_INTEN_SCATTER_STARTED_Enabled (1UL) /*!< Enable */

/* Bit 1 : Enable or disable interrupt for event GATHER_DONE */
#define DES_INTEN_GATHER_DONE_Pos (1UL) /*!< Position of GATHER_DONE field. */
#define DES_INTEN_GATHER_DONE_Msk (0x1UL << DES_INTEN_GATHER_DONE_Pos) /*!< Bit mask of GATHER_DONE field. */
#define DES_INTEN_GATHER_DONE_Disabled (0UL) /*!< Disable */
#define DES_INTEN_GATHER_DONE_Enabled (1UL) /*!< Enable */

/* Bit 0 : Enable or disable interrupt for event GATHER_STARTED */
#define DES_INTEN_GATHER_STARTED_Pos (0UL) /*!< Position of GATHER_STARTED field. */
#define DES_INTEN_GATHER_STARTED_Msk (0x1UL << DES_INTEN_GATHER_STARTED_Pos) /*!< Bit mask of GATHER_STARTED field. */
#define DES_INTEN_GATHER_STARTED_Disabled (0UL) /*!< Disable */
#define DES_INTEN_GATHER_STARTED_Enabled (1UL) /*!< Enable */

/* Register: DES_INTENSET */
/* Description: Enable interrupt */

/* Bit 13 : Write '1' to enable interrupt for event RESETTED */
#define DES_INTENSET_RESETTED_Pos (13UL) /*!< Position of RESETTED field. */
#define DES_INTENSET_RESETTED_Msk (0x1UL << DES_INTENSET_RESETTED_Pos) /*!< Bit mask of RESETTED field. */
#define DES_INTENSET_RESETTED_Disabled (0UL) /*!< Read: Disabled */
#define DES_INTENSET_RESETTED_Enabled (1UL) /*!< Read: Enabled */
#define DES_INTENSET_RESETTED_Set (1UL) /*!< Enable */

/* Bit 12 : Write '1' to enable interrupt for event DES_OUTPUT_EMPTY */
#define DES_INTENSET_DES_OUTPUT_EMPTY_Pos (12UL) /*!< Position of DES_OUTPUT_EMPTY field. */
#define DES_INTENSET_DES_OUTPUT_EMPTY_Msk (0x1UL << DES_INTENSET_DES_OUTPUT_EMPTY_Pos) /*!< Bit mask of DES_OUTPUT_EMPTY field. */
#define DES_INTENSET_DES_OUTPUT_EMPTY_Disabled (0UL) /*!< Read: Disabled */
#define DES_INTENSET_DES_OUTPUT_EMPTY_Enabled (1UL) /*!< Read: Enabled */
#define DES_INTENSET_DES_OUTPUT_EMPTY_Set (1UL) /*!< Enable */

/* Bit 11 : Write '1' to enable interrupt for event DES_DONE_3 */
#define DES_INTENSET_DES_DONE_3_Pos (11UL) /*!< Position of DES_DONE_3 field. */
#define DES_INTENSET_DES_DONE_3_Msk (0x1UL << DES_INTENSET_DES_DONE_3_Pos) /*!< Bit mask of DES_DONE_3 field. */
#define DES_INTENSET_DES_DONE_3_Disabled (0UL) /*!< Read: Disabled */
#define DES_INTENSET_DES_DONE_3_Enabled (1UL) /*!< Read: Enabled */
#define DES_INTENSET_DES_DONE_3_Set (1UL) /*!< Enable */

/* Bit 10 : Write '1' to enable interrupt for event DES_DONE_2 */
#define DES_INTENSET_DES_DONE_2_Pos (10UL) /*!< Position of DES_DONE_2 field. */
#define DES_INTENSET_DES_DONE_2_Msk (0x1UL << DES_INTENSET_DES_DONE_2_Pos) /*!< Bit mask of DES_DONE_2 field. */
#define DES_INTENSET_DES_DONE_2_Disabled (0UL) /*!< Read: Disabled */
#define DES_INTENSET_DES_DONE_2_Enabled (1UL) /*!< Read: Enabled */
#define DES_INTENSET_DES_DONE_2_Set (1UL) /*!< Enable */

