adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem_bitfields.h
/* Bit 8 : Write '1' to disable interrupt for event DES_INPUT_FULL */
#define DES_INTENCLR_DES_INPUT_FULL_Pos (8UL) /*!< Position of DES_INPUT_FULL field. */
#define DES_INTENCLR_DES_INPUT_FULL_Msk (0x1UL << DES_INTENCLR_DES_INPUT_FULL_Pos) /*!< Bit mask of DES_INPUT_FULL field. */
#define DES_INTENCLR_DES_INPUT_FULL_Disabled (0UL) /*!< Read: Disabled */
#define DES_INTENCLR_DES_INPUT_FULL_Enabled (1UL) /*!< Read: Enabled */
#define DES_INTENCLR_DES_INPUT_FULL_Clear (1UL) /*!< Disable */

/* Bit 7 : Write '1' to disable interrupt for event DES_INITIALIZED */
#define DES_INTENCLR_DES_INITIALIZED_Pos (7UL) /*!< Position of DES_INITIALIZED field. */
#define DES_INTENCLR_DES_INITIALIZED_Msk (0x1UL << DES_INTENCLR_DES_INITIALIZED_Pos) /*!< Bit mask of DES_INITIALIZED field. */
#define DES_INTENCLR_DES_INITIALIZED_Disabled (0UL) /*!< Read: Disabled */
#define DES_INTENCLR_DES_INITIALIZED_Enabled (1UL) /*!< Read: Enabled */
#define DES_INTENCLR_DES_INITIALIZED_Clear (1UL) /*!< Disable */

/* Bit 6 : Write '1' to disable interrupt for event IV_READY */
#define DES_INTENCLR_IV_READY_Pos (6UL) /*!< Position of IV_READY field. */
#define DES_INTENCLR_IV_READY_Msk (0x1UL << DES_INTENCLR_IV_READY_Pos) /*!< Bit mask of IV_READY field. */
#define DES_INTENCLR_IV_READY_Disabled (0UL) /*!< Read: Disabled */
#define DES_INTENCLR_IV_READY_Enabled (1UL) /*!< Read: Enabled */
#define DES_INTENCLR_IV_READY_Clear (1UL) /*!< Disable */

/* Bit 5 : Write '1' to disable interrupt for event KEY_3_READY */
#define DES_INTENCLR_KEY_3_READY_Pos (5UL) /*!< Position of KEY_3_READY field. */
#define DES_INTENCLR_KEY_3_READY_Msk (0x1UL << DES_INTENCLR_KEY_3_READY_Pos) /*!< Bit mask of KEY_3_READY field. */
#define DES_INTENCLR_KEY_3_READY_Disabled (0UL) /*!< Read: Disabled */
#define DES_INTENCLR_KEY_3_READY_Enabled (1UL) /*!< Read: Enabled */
#define DES_INTENCLR_KEY_3_READY_Clear (1UL) /*!< Disable */

/* Bit 4 : Write '1' to disable interrupt for event KEY_1_READY */
#define DES_INTENCLR_KEY_1_READY_Pos (4UL) /*!< Position of KEY_1_READY field. */
#define DES_INTENCLR_KEY_1_READY_Msk (0x1UL << DES_INTENCLR_KEY_1_READY_Pos) /*!< Bit mask of KEY_1_READY field. */
#define DES_INTENCLR_KEY_1_READY_Disabled (0UL) /*!< Read: Disabled */
#define DES_INTENCLR_KEY_1_READY_Enabled (1UL) /*!< Read: Enabled */
#define DES_INTENCLR_KEY_1_READY_Clear (1UL) /*!< Disable */

/* Bit 3 : Write '1' to disable interrupt for event SCATTER_DONE */
#define DES_INTENCLR_SCATTER_DONE_Pos (3UL) /*!< Position of SCATTER_DONE field. */
#define DES_INTENCLR_SCATTER_DONE_Msk (0x1UL << DES_INTENCLR_SCATTER_DONE_Pos) /*!< Bit mask of SCATTER_DONE field. */
#define DES_INTENCLR_SCATTER_DONE_Disabled (0UL) /*!< Read: Disabled */
#define DES_INTENCLR_SCATTER_DONE_Enabled (1UL) /*!< Read: Enabled */
#define DES_INTENCLR_SCATTER_DONE_Clear (1UL) /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event SCATTER_STARTED */
#define DES_INTENCLR_SCATTER_STARTED_Pos (2UL) /*!< Position of SCATTER_STARTED field. */
#define DES_INTENCLR_SCATTER_STARTED_Msk (0x1UL << DES_INTENCLR_SCATTER_STARTED_Pos) /*!< Bit mask of SCATTER_STARTED field. */
#define DES_INTENCLR_SCATTER_STARTED_Disabled (0UL) /*!< Read: Disabled */
#define DES_INTENCLR_SCATTER_STARTED_Enabled (1UL) /*!< Read: Enabled */
#define DES_INTENCLR_SCATTER_STARTED_Clear (1UL) /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event GATHER_DONE */
#define DES_INTENCLR_GATHER_DONE_Pos (1UL) /*!< Position of GATHER_DONE field. */
#define DES_INTENCLR_GATHER_DONE_Msk (0x1UL << DES_INTENCLR_GATHER_DONE_Pos) /*!< Bit mask of GATHER_DONE field. */
#define DES_INTENCLR_GATHER_DONE_Disabled (0UL) /*!< Read: Disabled */
#define DES_INTENCLR_GATHER_DONE_Enabled (1UL) /*!< Read: Enabled */
#define DES_INTENCLR_GATHER_DONE_Clear (1UL) /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event GATHER_STARTED */
#define DES_INTENCLR_GATHER_STARTED_Pos (0UL) /*!< Position of GATHER_STARTED field. */
#define DES_INTENCLR_GATHER_STARTED_Msk (0x1UL << DES_INTENCLR_GATHER_STARTED_Pos) /*!< Bit mask of GATHER_STARTED field. */
#define DES_INTENCLR_GATHER_STARTED_Disabled (0UL) /*!< Read: Disabled */
#define DES_INTENCLR_GATHER_STARTED_Enabled (1UL) /*!< Read: Enabled */
#define DES_INTENCLR_GATHER_STARTED_Clear (1UL) /*!< Disable */

/* Register: DES_INTPEND */
/* Description: Pending interrupts */

/* Bit 13 : Read pending status of interrupt for event RESETTED */
#define DES_INTPEND_RESETTED_Pos (13UL) /*!< Position of RESETTED field. */
#define DES_INTPEND_RESETTED_Msk (0x1UL << DES_INTPEND_RESETTED_Pos) /*!< Bit mask of RESETTED field. */
#define DES_INTPEND_RESETTED_NotPending (0UL) /*!< Read: Not pending */
#define DES_INTPEND_RESETTED_Pending (1UL) /*!< Read: Pending */

/* Bit 12 : Read pending status of interrupt for event DES_OUTPUT_EMPTY */
#define DES_INTPEND_DES_OUTPUT_EMPTY_Pos (12UL) /*!< Position of DES_OUTPUT_EMPTY field. */
#define DES_INTPEND_DES_OUTPUT_EMPTY_Msk (0x1UL << DES_INTPEND_DES_OUTPUT_EMPTY_Pos) /*!< Bit mask of DES_OUTPUT_EMPTY field. */
#define DES_INTPEND_DES_OUTPUT_EMPTY_NotPending (0UL) /*!< Read: Not pending */
#define DES_INTPEND_DES_OUTPUT_EMPTY_Pending (1UL) /*!< Read: Pending */

/* Bit 11 : Read pending status of interrupt for event DES_DONE_3 */
#define DES_INTPEND_DES_DONE_3_Pos (11UL) /*!< Position of DES_DONE_3 field. */
#define DES_INTPEND_DES_DONE_3_Msk (0x1UL << DES_INTPEND_DES_DONE_3_Pos) /*!< Bit mask of DES_DONE_3 field. */
#define DES_INTPEND_DES_DONE_3_NotPending (0UL) /*!< Read: Not pending */
#define DES_INTPEND_DES_DONE_3_Pending (1UL) /*!< Read: Pending */

/* Bit 10 : Read pending status of interrupt for event DES_DONE_2 */
#define DES_INTPEND_DES_DONE_2_Pos (10UL) /*!< Position of DES_DONE_2 field. */
#define DES_INTPEND_DES_DONE_2_Msk (0x1UL << DES_INTPEND_DES_DONE_2_Pos) /*!< Bit mask of DES_DONE_2 field. */
#define DES_INTPEND_DES_DONE_2_NotPending (0UL) /*!< Read: Not pending */
#define DES_INTPEND_DES_DONE_2_Pending (1UL) /*!< Read: Pending */

/* Bit 9 : Read pending status of interrupt for event DES_DONE_1 */
#define DES_INTPEND_DES_DONE_1_Pos (9UL) /*!< Position of DES_DONE_1 field. */
#define DES_INTPEND_DES_DONE_1_Msk (0x1UL << DES_INTPEND_DES_DONE_1_Pos) /*!< Bit mask of DES_DONE_1 field. */
#define DES_INTPEND_DES_DONE_1_NotPending (0UL) /*!< Read: Not pending */
#define DES_INTPEND_DES_DONE_1_Pending (1UL) /*!< Read: Pending */

/* Bit 8 : Read pending status of interrupt for event DES_INPUT_FULL */
#define DES_INTPEND_DES_INPUT_FULL_Pos (8UL) /*!< Position of DES_INPUT_FULL field. */
#define DES_INTPEND_DES_INPUT_FULL_Msk (0x1UL << DES_INTPEND_DES_INPUT_FULL_Pos) /*!< Bit mask of DES_INPUT_FULL field. */
#define DES_INTPEND_DES_INPUT_FULL_NotPending (0UL) /*!< Read: Not pending */
#define DES_INTPEND_DES_INPUT_FULL_Pending (1UL) /*!< Read: Pending */

/* Bit 7 : Read pending status of interrupt for event DES_INITIALIZED */
#define DES_INTPEND_DES_INITIALIZED_Pos (7UL) /*!< Position of DES_INITIALIZED field. */
#define DES_INTPEND_DES_INITIALIZED_Msk (0x1UL << DES_INTPEND_DES_INITIALIZED_Pos) /*!< Bit mask of DES_INITIALIZED field. */
#define DES_INTPEND_DES_INITIALIZED_NotPending (0UL) /*!< Read: Not pending */
#define DES_INTPEND_DES_INITIALIZED_Pending (1UL) /*!< Read: Pending */

