adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem_bitfields.h
/* Bit 6 : Read pending status of interrupt for event IV_READY */
#define DES_INTPEND_IV_READY_Pos (6UL) /*!< Position of IV_READY field. */
#define DES_INTPEND_IV_READY_Msk (0x1UL << DES_INTPEND_IV_READY_Pos) /*!< Bit mask of IV_READY field. */
#define DES_INTPEND_IV_READY_NotPending (0UL) /*!< Read: Not pending */
#define DES_INTPEND_IV_READY_Pending (1UL) /*!< Read: Pending */

/* Bit 5 : Read pending status of interrupt for event KEY_3_READY */
#define DES_INTPEND_KEY_3_READY_Pos (5UL) /*!< Position of KEY_3_READY field. */
#define DES_INTPEND_KEY_3_READY_Msk (0x1UL << DES_INTPEND_KEY_3_READY_Pos) /*!< Bit mask of KEY_3_READY field. */
#define DES_INTPEND_KEY_3_READY_NotPending (0UL) /*!< Read: Not pending */
#define DES_INTPEND_KEY_3_READY_Pending (1UL) /*!< Read: Pending */

/* Bit 4 : Read pending status of interrupt for event KEY_1_READY */
#define DES_INTPEND_KEY_1_READY_Pos (4UL) /*!< Position of KEY_1_READY field. */
#define DES_INTPEND_KEY_1_READY_Msk (0x1UL << DES_INTPEND_KEY_1_READY_Pos) /*!< Bit mask of KEY_1_READY field. */
#define DES_INTPEND_KEY_1_READY_NotPending (0UL) /*!< Read: Not pending */
#define DES_INTPEND_KEY_1_READY_Pending (1UL) /*!< Read: Pending */

/* Bit 3 : Read pending status of interrupt for event SCATTER_DONE */
#define DES_INTPEND_SCATTER_DONE_Pos (3UL) /*!< Position of SCATTER_DONE field. */
#define DES_INTPEND_SCATTER_DONE_Msk (0x1UL << DES_INTPEND_SCATTER_DONE_Pos) /*!< Bit mask of SCATTER_DONE field. */
#define DES_INTPEND_SCATTER_DONE_NotPending (0UL) /*!< Read: Not pending */
#define DES_INTPEND_SCATTER_DONE_Pending (1UL) /*!< Read: Pending */

/* Bit 2 : Read pending status of interrupt for event SCATTER_STARTED */
#define DES_INTPEND_SCATTER_STARTED_Pos (2UL) /*!< Position of SCATTER_STARTED field. */
#define DES_INTPEND_SCATTER_STARTED_Msk (0x1UL << DES_INTPEND_SCATTER_STARTED_Pos) /*!< Bit mask of SCATTER_STARTED field. */
#define DES_INTPEND_SCATTER_STARTED_NotPending (0UL) /*!< Read: Not pending */
#define DES_INTPEND_SCATTER_STARTED_Pending (1UL) /*!< Read: Pending */

/* Bit 1 : Read pending status of interrupt for event GATHER_DONE */
#define DES_INTPEND_GATHER_DONE_Pos (1UL) /*!< Position of GATHER_DONE field. */
#define DES_INTPEND_GATHER_DONE_Msk (0x1UL << DES_INTPEND_GATHER_DONE_Pos) /*!< Bit mask of GATHER_DONE field. */
#define DES_INTPEND_GATHER_DONE_NotPending (0UL) /*!< Read: Not pending */
#define DES_INTPEND_GATHER_DONE_Pending (1UL) /*!< Read: Pending */

/* Bit 0 : Read pending status of interrupt for event GATHER_STARTED */
#define DES_INTPEND_GATHER_STARTED_Pos (0UL) /*!< Position of GATHER_STARTED field. */
#define DES_INTPEND_GATHER_STARTED_Msk (0x1UL << DES_INTPEND_GATHER_STARTED_Pos) /*!< Bit mask of GATHER_STARTED field. */
#define DES_INTPEND_GATHER_STARTED_NotPending (0UL) /*!< Read: Not pending */
#define DES_INTPEND_GATHER_STARTED_Pending (1UL) /*!< Read: Pending */

/* Register: DES_MODE */
/* Description: Mode: 0 == ECB, 1 == CBC */

/* Bit 0 : Selects ECB or CBC block cipher mode */
#define DES_MODE_MODE_Pos (0UL) /*!< Position of MODE field. */
#define DES_MODE_MODE_Msk (0x1UL << DES_MODE_MODE_Pos) /*!< Bit mask of MODE field. */
#define DES_MODE_MODE_ECB (0UL) /*!< Electronic Codebook mode */
#define DES_MODE_MODE_CBC (1UL) /*!< Cipher Block Chaining mode */

/* Register: DES_INJOBPTR */
/* Description: Input DMA job pointer register */

/* Bits 31..0 : Input DMA job pointer */
#define DES_INJOBPTR_INJOBPTR_Pos (0UL) /*!< Position of INJOBPTR field. */
#define DES_INJOBPTR_INJOBPTR_Msk (0xFFFFFFFFUL << DES_INJOBPTR_INJOBPTR_Pos) /*!< Bit mask of INJOBPTR field. */

/* Register: DES_OUTJOBPTR */
/* Description: Output DMA job pointer register */

/* Bits 31..0 : Output DMA job pointer */
#define DES_OUTJOBPTR_OUTJOBPTR_Pos (0UL) /*!< Position of OUTJOBPTR field. */
#define DES_OUTJOBPTR_OUTJOBPTR_Msk (0xFFFFFFFFUL << DES_OUTJOBPTR_OUTJOBPTR_Pos) /*!< Bit mask of OUTJOBPTR field. */


/* Peripheral: FICR */
/* Description: Factory Information Configuration Registers */

/* Register: FICR_TESTSTATUS */
/* Description: Code memory test status. Will be set during production test. */

/* Bits 31..0 : Code memory test status. Will be set during production test. */
#define FICR_TESTSTATUS_TESTSTATUS_Pos (0UL) /*!< Position of TESTSTATUS field. */
#define FICR_TESTSTATUS_TESTSTATUS_Msk (0xFFFFFFFFUL << FICR_TESTSTATUS_TESTSTATUS_Pos) /*!< Bit mask of TESTSTATUS field. */

/* Register: FICR_CPTEST0 */
/* Description: Result from Circuit Probe test */

/* Bits 31..0 : Result from Circuit Probe test */
#define FICR_CPTEST0_CP1_Pos (0UL) /*!< Position of CP1 field. */
#define FICR_CPTEST0_CP1_Msk (0xFFFFFFFFUL << FICR_CPTEST0_CP1_Pos) /*!< Bit mask of CP1 field. */

/* Register: FICR_CPTEST00 */
/* Description: Result from Circuit Probe test */

/* Bits 31..0 : Result from Circuit Probe test */
#define FICR_CPTEST00_CP2_Pos (0UL) /*!< Position of CP2 field. */
#define FICR_CPTEST00_CP2_Msk (0xFFFFFFFFUL << FICR_CPTEST00_CP2_Pos) /*!< Bit mask of CP2 field. */

/* Register: FICR_CPTEST1 */
/* Description: Result from Circuit Probe test */

/* Bits 31..24 : 4th ascii byte of Lot ID character */
#define FICR_CPTEST1_LOTID4_Pos (24UL) /*!< Position of LOTID4 field. */
#define FICR_CPTEST1_LOTID4_Msk (0xFFUL << FICR_CPTEST1_LOTID4_Pos) /*!< Bit mask of LOTID4 field. */

/* Bits 23..16 : 3rd ascii byte of Lot ID character */
#define FICR_CPTEST1_LOTID3_Pos (16UL) /*!< Position of LOTID3 field. */
#define FICR_CPTEST1_LOTID3_Msk (0xFFUL << FICR_CPTEST1_LOTID3_Pos) /*!< Bit mask of LOTID3 field. */

/* Bits 15..8 : 2nd ascii byte of Lot ID character */
#define FICR_CPTEST1_LOTID2_Pos (8UL) /*!< Position of LOTID2 field. */
#define FICR_CPTEST1_LOTID2_Msk (0xFFUL << FICR_CPTEST1_LOTID2_Pos) /*!< Bit mask of LOTID2 field. */

/* Bits 7..0 : 1st ascii byte of Lot ID character */
#define FICR_CPTEST1_LOTID1_Pos (0UL) /*!< Position of LOTID1 field. */
#define FICR_CPTEST1_LOTID1_Msk (0xFFUL << FICR_CPTEST1_LOTID1_Pos) /*!< Bit mask of LOTID1 field. */

/* Register: FICR_CPTEST2 */
/* Description: Result from Circuit Probe test */

/* Bits 31..24 : Device X-coordinate, always &gt;=0, offset so that the leftmost value on wafer is 0 */
#define FICR_CPTEST2_XCOORD_Pos (24UL) /*!< Position of XCOORD field. */
#define FICR_CPTEST2_XCOORD_Msk (0xFFUL << FICR_CPTEST2_XCOORD_Pos) /*!< Bit mask of XCOORD field. */

/* Bits 23..16 : Wafer number, 1 byte integer */
#define FICR_CPTEST2_WAFER_Pos (16UL) /*!< Position of WAFER field. */
#define FICR_CPTEST2_WAFER_Msk (0xFFUL << FICR_CPTEST2_WAFER_Pos) /*!< Bit mask of WAFER field. */

/* Bits 15..8 : 6th ascii byte of Lot ID character */
#define FICR_CPTEST2_LOTID6_Pos (8UL) /*!< Position of LOTID6 field. */
#define FICR_CPTEST2_LOTID6_Msk (0xFFUL << FICR_CPTEST2_LOTID6_Pos) /*!< Bit mask of LOTID6 field. */

/* Bits 7..0 : 5th ascii byte of Lot ID character */
#define FICR_CPTEST2_LOTID5_Pos (0UL) /*!< Position of LOTID5 field. */
#define FICR_CPTEST2_LOTID5_Msk (0xFFUL << FICR_CPTEST2_LOTID5_Pos) /*!< Bit mask of LOTID5 field. */

/* Register: FICR_CPTEST3 */
/* Description: Result from Circuit Probe test */

