adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem_bitfields.h
/* Bits 6..4 : Power switch resistance override value */
#define MCPLL_OVERRIDE_MCPLL_RESISTANCE_Pos (4UL) /*!< Position of RESISTANCE field. */
#define MCPLL_OVERRIDE_MCPLL_RESISTANCE_Msk (0x7UL << MCPLL_OVERRIDE_MCPLL_RESISTANCE_Pos) /*!< Bit mask of RESISTANCE field. */

/* Bits 1..0 : Power switch override value */
#define MCPLL_OVERRIDE_MCPLL_SWITCH_Pos (0UL) /*!< Position of SWITCH field. */
#define MCPLL_OVERRIDE_MCPLL_SWITCH_Msk (0x3UL << MCPLL_OVERRIDE_MCPLL_SWITCH_Pos) /*!< Bit mask of SWITCH field. */
#define MCPLL_OVERRIDE_MCPLL_SWITCH_OFF (0UL) /*!< Force power switch OFF */
#define MCPLL_OVERRIDE_MCPLL_SWITCH_ON (1UL) /*!< Force power switch ON */

/* Register: MCPLL_OVERRIDE_MCPLLBUF */
/* Description: Override for MCPLLBUF power switch */

/* Bit 31 : Enable override */
#define MCPLL_OVERRIDE_MCPLLBUF_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define MCPLL_OVERRIDE_MCPLLBUF_ENABLE_Msk (0x1UL << MCPLL_OVERRIDE_MCPLLBUF_ENABLE_Pos) /*!< Bit mask of ENABLE field. */
#define MCPLL_OVERRIDE_MCPLLBUF_ENABLE_NoOverride (0UL) /*!< No override enabled */
#define MCPLL_OVERRIDE_MCPLLBUF_ENABLE_Override (1UL) /*!< Override enabled */

/* Bits 6..4 : Power switch resistance override value */
#define MCPLL_OVERRIDE_MCPLLBUF_RESISTANCE_Pos (4UL) /*!< Position of RESISTANCE field. */
#define MCPLL_OVERRIDE_MCPLLBUF_RESISTANCE_Msk (0x7UL << MCPLL_OVERRIDE_MCPLLBUF_RESISTANCE_Pos) /*!< Bit mask of RESISTANCE field. */

/* Bits 1..0 : Power switch override value */
#define MCPLL_OVERRIDE_MCPLLBUF_SWITCH_Pos (0UL) /*!< Position of SWITCH field. */
#define MCPLL_OVERRIDE_MCPLLBUF_SWITCH_Msk (0x3UL << MCPLL_OVERRIDE_MCPLLBUF_SWITCH_Pos) /*!< Bit mask of SWITCH field. */
#define MCPLL_OVERRIDE_MCPLLBUF_SWITCH_OFF (0UL) /*!< Force power switch OFF */
#define MCPLL_OVERRIDE_MCPLLBUF_SWITCH_ON (1UL) /*!< Force power switch ON */

/* Register: MCPLL_OVERRIDE_PWRUP */
/* Description: Override for power up */

/* Bit 31 : Enable override */
#define MCPLL_OVERRIDE_PWRUP_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define MCPLL_OVERRIDE_PWRUP_ENABLE_Msk (0x1UL << MCPLL_OVERRIDE_PWRUP_ENABLE_Pos) /*!< Bit mask of ENABLE field. */
#define MCPLL_OVERRIDE_PWRUP_ENABLE_NoOverride (0UL) /*!< No override enabled */
#define MCPLL_OVERRIDE_PWRUP_ENABLE_Override (1UL) /*!< Override enabled */

/* Bit 0 : Override for PWRDUP_MCPLL */
#define MCPLL_OVERRIDE_PWRUP_MCPLLANA_Pos (0UL) /*!< Position of MCPLLANA field. */
#define MCPLL_OVERRIDE_PWRUP_MCPLLANA_Msk (0x1UL << MCPLL_OVERRIDE_PWRUP_MCPLLANA_Pos) /*!< Bit mask of MCPLLANA field. */
#define MCPLL_OVERRIDE_PWRUP_MCPLLANA_OFF (0UL) /*!< Force power off */
#define MCPLL_OVERRIDE_PWRUP_MCPLLANA_ON (1UL) /*!< Force power on */

/* Register: MCPLL_OUTA_DRV */
/* Description: Drive strength for OUTA */

/* Bits 1..0 : Drive strength for OUTA */
#define MCPLL_OUTA_DRV_OUTA_DRV_Pos (0UL) /*!< Position of OUTA_DRV field. */
#define MCPLL_OUTA_DRV_OUTA_DRV_Msk (0x3UL << MCPLL_OUTA_DRV_OUTA_DRV_Pos) /*!< Bit mask of OUTA_DRV field. */

/* Register: MCPLL_OUTB_DRV */
/* Description: Drive strength for OUTB */

/* Bits 1..0 : Drive strength for OUTB */
#define MCPLL_OUTB_DRV_OUTB_DRV_Pos (0UL) /*!< Position of OUTB_DRV field. */
#define MCPLL_OUTB_DRV_OUTB_DRV_Msk (0x3UL << MCPLL_OUTB_DRV_OUTB_DRV_Pos) /*!< Bit mask of OUTB_DRV field. */

/* Register: MCPLL_OUTC_DRV */
/* Description: Drive strength for OUTC */

/* Bits 1..0 : Drive strength for OUTC */
#define MCPLL_OUTC_DRV_OUTC_DRV_Pos (0UL) /*!< Position of OUTC_DRV field. */
#define MCPLL_OUTC_DRV_OUTC_DRV_Msk (0x3UL << MCPLL_OUTC_DRV_OUTC_DRV_Pos) /*!< Bit mask of OUTC_DRV field. */

/* Register: MCPLL_OUTD_DRV */
/* Description: Drive strength for OUTD */

/* Bits 1..0 : Drive strength for OUTD */
#define MCPLL_OUTD_DRV_OUTD_DRV_Pos (0UL) /*!< Position of OUTD_DRV field. */
#define MCPLL_OUTD_DRV_OUTD_DRV_Msk (0x3UL << MCPLL_OUTD_DRV_OUTD_DRV_Pos) /*!< Bit mask of OUTD_DRV field. */

/* Register: MCPLL_INTMODE */
/* Description: Integer mode */

/* Bit 0 : Integer mode */
#define MCPLL_INTMODE_INTMODE_Pos (0UL) /*!< Position of INTMODE field. */
#define MCPLL_INTMODE_INTMODE_Msk (0x1UL << MCPLL_INTMODE_INTMODE_Pos) /*!< Bit mask of INTMODE field. */
#define MCPLL_INTMODE_INTMODE_Fractional (0UL) /*!< Fractional mode */
#define MCPLL_INTMODE_INTMODE_Integer (1UL) /*!< Integer mode */

/* Register: MCPLL_TEST */
/* Description: ATE test bus control */

/* Bits 3..0 : ATE test bus control */
#define MCPLL_TEST_ATE_Pos (0UL) /*!< Position of ATE field. */
#define MCPLL_TEST_ATE_Msk (0xFUL << MCPLL_TEST_ATE_Pos) /*!< Bit mask of ATE field. */

/* Register: MCPLL_ATB_ENABLE */
/* Description: Analog switch control for connecting ATB to GPIOs.
        Note that when the analog switch is enabled, digital driver of the GPIO must be in hiZ.	  
   	    Note also that the analog switch can be enabled also from elsewhere for testing other analog IPs. */

/* Bits 3..2 :   */
#define MCPLL_ATB_ENABLE_AE1_Pos (2UL) /*!< Position of AE1 field. */
#define MCPLL_ATB_ENABLE_AE1_Msk (0x3UL << MCPLL_ATB_ENABLE_AE1_Pos) /*!< Bit mask of AE1 field. */
#define MCPLL_ATB_ENABLE_AE1_Disconnected (0UL) /*!< No analog test signal connected (Alta: GPIO29). */
#define MCPLL_ATB_ENABLE_AE1_ATB1 (1UL) /*!< ATB1 connected. This controls only the GPIO analog switch. In order to get the test signal to GPIO. */
#define MCPLL_ATB_ENABLE_AE1_BYPASSCLK (2UL) /*!< MCPLL input connected. Can be used as reference or bypass clock. */
#define MCPLL_ATB_ENABLE_AE1_NOTALLOWED (3UL) /*!< Not allowed (both slices enabled). */

/* Bits 1..0 :   */
#define MCPLL_ATB_ENABLE_AE0_Pos (0UL) /*!< Position of AE0 field. */
#define MCPLL_ATB_ENABLE_AE0_Msk (0x3UL << MCPLL_ATB_ENABLE_AE0_Pos) /*!< Bit mask of AE0 field. */
#define MCPLL_ATB_ENABLE_AE0_Disconnected (0UL) /*!< No analog test signal connected (Alta: GPIO28). */
#define MCPLL_ATB_ENABLE_AE0_ATB0 (1UL) /*!< ATB0 connected. This controls only the GPIO analog switch. In order to get the test signal to GPIO. */
#define MCPLL_ATB_ENABLE_AE0_OUTD (2UL) /*!< MCPLL OUTD output connected. */
#define MCPLL_ATB_ENABLE_AE0_NOTALLOWED (3UL) /*!< Not allowed (both slices enabled). */


/* Peripheral: MWU */
/* Description: Memory Watch Unit */

