adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem_bitfields.h
/* Bit 0 : Start requesting RF Front-End 1V8 LDO (RFFELDO) */
#define POWER_TASKS_RFFELDOREQSTART_TASKS_RFFELDOREQSTART_Pos (0UL) /*!< Position of TASKS_RFFELDOREQSTART field. */
#define POWER_TASKS_RFFELDOREQSTART_TASKS_RFFELDOREQSTART_Msk (0x1UL << POWER_TASKS_RFFELDOREQSTART_TASKS_RFFELDOREQSTART_Pos) /*!< Bit mask of TASKS_RFFELDOREQSTART field. */
#define POWER_TASKS_RFFELDOREQSTART_TASKS_RFFELDOREQSTART_Trigger (1UL) /*!< Trigger task */

/* Register: POWER_TASKS_RFFELDOREQSTOP */
/* Description: Stop requesting RF Front-End 1V8 LDO (RFFELDO) */

/* Bit 0 : Stop requesting RF Front-End 1V8 LDO (RFFELDO) */
#define POWER_TASKS_RFFELDOREQSTOP_TASKS_RFFELDOREQSTOP_Pos (0UL) /*!< Position of TASKS_RFFELDOREQSTOP field. */
#define POWER_TASKS_RFFELDOREQSTOP_TASKS_RFFELDOREQSTOP_Msk (0x1UL << POWER_TASKS_RFFELDOREQSTOP_TASKS_RFFELDOREQSTOP_Pos) /*!< Bit mask of TASKS_RFFELDOREQSTOP field. */
#define POWER_TASKS_RFFELDOREQSTOP_TASKS_RFFELDOREQSTOP_Trigger (1UL) /*!< Trigger task */

/* Register: POWER_TASKS_IOIFLDOREQSTART */
/* Description: Start requesting IO interface 1V8 LDO (RFFELDO) */

/* Bit 0 : Start requesting IO interface 1V8 LDO (RFFELDO) */
#define POWER_TASKS_IOIFLDOREQSTART_TASKS_IOIFLDOREQSTART_Pos (0UL) /*!< Position of TASKS_IOIFLDOREQSTART field. */
#define POWER_TASKS_IOIFLDOREQSTART_TASKS_IOIFLDOREQSTART_Msk (0x1UL << POWER_TASKS_IOIFLDOREQSTART_TASKS_IOIFLDOREQSTART_Pos) /*!< Bit mask of TASKS_IOIFLDOREQSTART field. */
#define POWER_TASKS_IOIFLDOREQSTART_TASKS_IOIFLDOREQSTART_Trigger (1UL) /*!< Trigger task */

/* Register: POWER_TASKS_IOIFLDOREQSTOP */
/* Description: Stop requesting IO interface 1V8 LDO (RFFELDO) */

/* Bit 0 : Stop requesting IO interface 1V8 LDO (RFFELDO) */
#define POWER_TASKS_IOIFLDOREQSTOP_TASKS_IOIFLDOREQSTOP_Pos (0UL) /*!< Position of TASKS_IOIFLDOREQSTOP field. */
#define POWER_TASKS_IOIFLDOREQSTOP_TASKS_IOIFLDOREQSTOP_Msk (0x1UL << POWER_TASKS_IOIFLDOREQSTOP_TASKS_IOIFLDOREQSTOP_Pos) /*!< Bit mask of TASKS_IOIFLDOREQSTOP field. */
#define POWER_TASKS_IOIFLDOREQSTOP_TASKS_IOIFLDOREQSTOP_Trigger (1UL) /*!< Trigger task */

/* Register: POWER_TASKS_PWMREQSTART */
/* Description: Request forcing PWM mode in external DCDC voltage regulator */

/* Bit 0 : Request forcing PWM mode in external DCDC voltage regulator */
#define POWER_TASKS_PWMREQSTART_TASKS_PWMREQSTART_Pos (0UL) /*!< Position of TASKS_PWMREQSTART field. */
#define POWER_TASKS_PWMREQSTART_TASKS_PWMREQSTART_Msk (0x1UL << POWER_TASKS_PWMREQSTART_TASKS_PWMREQSTART_Pos) /*!< Bit mask of TASKS_PWMREQSTART field. */
#define POWER_TASKS_PWMREQSTART_TASKS_PWMREQSTART_Trigger (1UL) /*!< Trigger task */

/* Register: POWER_TASKS_PWMREQSTOP */
/* Description: Stop requesting forcing PWM mode in external DCDC voltage regulator */

/* Bit 0 : Stop requesting forcing PWM mode in external DCDC voltage regulator */
#define POWER_TASKS_PWMREQSTOP_TASKS_PWMREQSTOP_Pos (0UL) /*!< Position of TASKS_PWMREQSTOP field. */
#define POWER_TASKS_PWMREQSTOP_TASKS_PWMREQSTOP_Msk (0x1UL << POWER_TASKS_PWMREQSTOP_TASKS_PWMREQSTOP_Pos) /*!< Bit mask of TASKS_PWMREQSTOP field. */
#define POWER_TASKS_PWMREQSTOP_TASKS_PWMREQSTOP_Trigger (1UL) /*!< Trigger task */

/* Register: POWER_TASKS_CONSTLAT */
/* Description: Enable constant latency mode. When going to sleep: CPU is clock gated, but regulators, oscillators and clock tree is kept on. */

/* Bit 0 : Enable constant latency mode. When going to sleep: CPU is clock gated, but regulators, oscillators and clock tree is kept on. */
#define POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Pos (0UL) /*!< Position of TASKS_CONSTLAT field. */
#define POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Msk (0x1UL << POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Pos) /*!< Bit mask of TASKS_CONSTLAT field. */
#define POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Trigger (1UL) /*!< Trigger task */

/* Register: POWER_TASKS_LOWPWR */
/* Description: Enable low power mode (variable latency) When going to sleep: Oscillators are switched off (if nothing else is requesting clocks). Regulators are switched off (if nothing else is requesting power). */

/* Bit 0 : Enable low power mode (variable latency) When going to sleep: Oscillators are switched off (if nothing else is requesting clocks). Regulators are switched off (if nothing else is requesting power). */
#define POWER_TASKS_LOWPWR_TASKS_LOWPWR_Pos (0UL) /*!< Position of TASKS_LOWPWR field. */
#define POWER_TASKS_LOWPWR_TASKS_LOWPWR_Msk (0x1UL << POWER_TASKS_LOWPWR_TASKS_LOWPWR_Pos) /*!< Bit mask of TASKS_LOWPWR field. */
#define POWER_TASKS_LOWPWR_TASKS_LOWPWR_Trigger (1UL) /*!< Trigger task */

/* Register: POWER_EVENTS_POFWARN */
/* Description: Power failure warning */

/* Bit 0 : Power failure warning */
#define POWER_EVENTS_POFWARN_EVENTS_POFWARN_Pos (0UL) /*!< Position of EVENTS_POFWARN field. */
#define POWER_EVENTS_POFWARN_EVENTS_POFWARN_Msk (0x1UL << POWER_EVENTS_POFWARN_EVENTS_POFWARN_Pos) /*!< Bit mask of EVENTS_POFWARN field. */
#define POWER_EVENTS_POFWARN_EVENTS_POFWARN_NotGenerated (0UL) /*!< Event not generated */
#define POWER_EVENTS_POFWARN_EVENTS_POFWARN_Generated (1UL) /*!< Event generated */

/* Register: POWER_EVENTS_RFFELDOSTARTED */
/* Description: RF Front-End 1V8 LDO (RFFELDO) has become ready */

/* Bit 0 : RF Front-End 1V8 LDO (RFFELDO) has become ready */
#define POWER_EVENTS_RFFELDOSTARTED_EVENTS_RFFELDOSTARTED_Pos (0UL) /*!< Position of EVENTS_RFFELDOSTARTED field. */
#define POWER_EVENTS_RFFELDOSTARTED_EVENTS_RFFELDOSTARTED_Msk (0x1UL << POWER_EVENTS_RFFELDOSTARTED_EVENTS_RFFELDOSTARTED_Pos) /*!< Bit mask of EVENTS_RFFELDOSTARTED field. */
#define POWER_EVENTS_RFFELDOSTARTED_EVENTS_RFFELDOSTARTED_NotGenerated (0UL) /*!< Event not generated */
#define POWER_EVENTS_RFFELDOSTARTED_EVENTS_RFFELDOSTARTED_Generated (1UL) /*!< Event generated */

/* Register: POWER_EVENTS_IOIFLDOSTARED */
/* Description: IO interface 1V8 LDO (IOIFLDO) has become ready */

/* Bit 0 : IO interface 1V8 LDO (IOIFLDO) has become ready */
#define POWER_EVENTS_IOIFLDOSTARED_EVENTS_IOIFLDOSTARED_Pos (0UL) /*!< Position of EVENTS_IOIFLDOSTARED field. */
#define POWER_EVENTS_IOIFLDOSTARED_EVENTS_IOIFLDOSTARED_Msk (0x1UL << POWER_EVENTS_IOIFLDOSTARED_EVENTS_IOIFLDOSTARED_Pos) /*!< Bit mask of EVENTS_IOIFLDOSTARED field. */
#define POWER_EVENTS_IOIFLDOSTARED_EVENTS_IOIFLDOSTARED_NotGenerated (0UL) /*!< Event not generated */
#define POWER_EVENTS_IOIFLDOSTARED_EVENTS_IOIFLDOSTARED_Generated (1UL) /*!< Event generated */

/* Register: POWER_EVENTS_SLEEPENTER */
/* Description: CPU entered WFI/WFE sleep */

/* Bit 0 : CPU entered WFI/WFE sleep */
#define POWER_EVENTS_SLEEPENTER_EVENTS_SLEEPENTER_Pos (0UL) /*!< Position of EVENTS_SLEEPENTER field. */
#define POWER_EVENTS_SLEEPENTER_EVENTS_SLEEPENTER_Msk (0x1UL << POWER_EVENTS_SLEEPENTER_EVENTS_SLEEPENTER_Pos) /*!< Bit mask of EVENTS_SLEEPENTER field. */
#define POWER_EVENTS_SLEEPENTER_EVENTS_SLEEPENTER_NotGenerated (0UL) /*!< Event not generated */
#define POWER_EVENTS_SLEEPENTER_EVENTS_SLEEPENTER_Generated (1UL) /*!< Event generated */

