adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem_bitfields.h
/* Register: POWER_EVENTS_SLEEPEXIT */
/* Description: CPU exited WFI/WFE sleep */

/* Bit 0 : CPU exited WFI/WFE sleep */
#define POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Pos (0UL) /*!< Position of EVENTS_SLEEPEXIT field. */
#define POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Msk (0x1UL << POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Pos) /*!< Bit mask of EVENTS_SLEEPEXIT field. */
#define POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_NotGenerated (0UL) /*!< Event not generated */
#define POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Generated (1UL) /*!< Event generated */

/* Register: POWER_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 6 : Enable or disable interrupt for event SLEEPEXIT */
#define POWER_INTEN_SLEEPEXIT_Pos (6UL) /*!< Position of SLEEPEXIT field. */
#define POWER_INTEN_SLEEPEXIT_Msk (0x1UL << POWER_INTEN_SLEEPEXIT_Pos) /*!< Bit mask of SLEEPEXIT field. */
#define POWER_INTEN_SLEEPEXIT_Disabled (0UL) /*!< Disable */
#define POWER_INTEN_SLEEPEXIT_Enabled (1UL) /*!< Enable */

/* Bit 5 : Enable or disable interrupt for event SLEEPENTER */
#define POWER_INTEN_SLEEPENTER_Pos (5UL) /*!< Position of SLEEPENTER field. */
#define POWER_INTEN_SLEEPENTER_Msk (0x1UL << POWER_INTEN_SLEEPENTER_Pos) /*!< Bit mask of SLEEPENTER field. */
#define POWER_INTEN_SLEEPENTER_Disabled (0UL) /*!< Disable */
#define POWER_INTEN_SLEEPENTER_Enabled (1UL) /*!< Enable */

/* Bit 4 : Enable or disable interrupt for event IOIFLDOSTARED */
#define POWER_INTEN_IOIFLDOSTARED_Pos (4UL) /*!< Position of IOIFLDOSTARED field. */
#define POWER_INTEN_IOIFLDOSTARED_Msk (0x1UL << POWER_INTEN_IOIFLDOSTARED_Pos) /*!< Bit mask of IOIFLDOSTARED field. */
#define POWER_INTEN_IOIFLDOSTARED_Disabled (0UL) /*!< Disable */
#define POWER_INTEN_IOIFLDOSTARED_Enabled (1UL) /*!< Enable */

/* Bit 3 : Enable or disable interrupt for event RFFELDOSTARTED */
#define POWER_INTEN_RFFELDOSTARTED_Pos (3UL) /*!< Position of RFFELDOSTARTED field. */
#define POWER_INTEN_RFFELDOSTARTED_Msk (0x1UL << POWER_INTEN_RFFELDOSTARTED_Pos) /*!< Bit mask of RFFELDOSTARTED field. */
#define POWER_INTEN_RFFELDOSTARTED_Disabled (0UL) /*!< Disable */
#define POWER_INTEN_RFFELDOSTARTED_Enabled (1UL) /*!< Enable */

/* Bit 2 : Enable or disable interrupt for event POFWARN */
#define POWER_INTEN_POFWARN_Pos (2UL) /*!< Position of POFWARN field. */
#define POWER_INTEN_POFWARN_Msk (0x1UL << POWER_INTEN_POFWARN_Pos) /*!< Bit mask of POFWARN field. */
#define POWER_INTEN_POFWARN_Disabled (0UL) /*!< Disable */
#define POWER_INTEN_POFWARN_Enabled (1UL) /*!< Enable */

/* Register: POWER_INTENSET */
/* Description: Enable interrupt */

/* Bit 6 : Write '1' to enable interrupt for event SLEEPEXIT */
#define POWER_INTENSET_SLEEPEXIT_Pos (6UL) /*!< Position of SLEEPEXIT field. */
#define POWER_INTENSET_SLEEPEXIT_Msk (0x1UL << POWER_INTENSET_SLEEPEXIT_Pos) /*!< Bit mask of SLEEPEXIT field. */
#define POWER_INTENSET_SLEEPEXIT_Disabled (0UL) /*!< Read: Disabled */
#define POWER_INTENSET_SLEEPEXIT_Enabled (1UL) /*!< Read: Enabled */
#define POWER_INTENSET_SLEEPEXIT_Set (1UL) /*!< Enable */

/* Bit 5 : Write '1' to enable interrupt for event SLEEPENTER */
#define POWER_INTENSET_SLEEPENTER_Pos (5UL) /*!< Position of SLEEPENTER field. */
#define POWER_INTENSET_SLEEPENTER_Msk (0x1UL << POWER_INTENSET_SLEEPENTER_Pos) /*!< Bit mask of SLEEPENTER field. */
#define POWER_INTENSET_SLEEPENTER_Disabled (0UL) /*!< Read: Disabled */
#define POWER_INTENSET_SLEEPENTER_Enabled (1UL) /*!< Read: Enabled */
#define POWER_INTENSET_SLEEPENTER_Set (1UL) /*!< Enable */

/* Bit 4 : Write '1' to enable interrupt for event IOIFLDOSTARED */
#define POWER_INTENSET_IOIFLDOSTARED_Pos (4UL) /*!< Position of IOIFLDOSTARED field. */
#define POWER_INTENSET_IOIFLDOSTARED_Msk (0x1UL << POWER_INTENSET_IOIFLDOSTARED_Pos) /*!< Bit mask of IOIFLDOSTARED field. */
#define POWER_INTENSET_IOIFLDOSTARED_Disabled (0UL) /*!< Read: Disabled */
#define POWER_INTENSET_IOIFLDOSTARED_Enabled (1UL) /*!< Read: Enabled */
#define POWER_INTENSET_IOIFLDOSTARED_Set (1UL) /*!< Enable */

/* Bit 3 : Write '1' to enable interrupt for event RFFELDOSTARTED */
#define POWER_INTENSET_RFFELDOSTARTED_Pos (3UL) /*!< Position of RFFELDOSTARTED field. */
#define POWER_INTENSET_RFFELDOSTARTED_Msk (0x1UL << POWER_INTENSET_RFFELDOSTARTED_Pos) /*!< Bit mask of RFFELDOSTARTED field. */
#define POWER_INTENSET_RFFELDOSTARTED_Disabled (0UL) /*!< Read: Disabled */
#define POWER_INTENSET_RFFELDOSTARTED_Enabled (1UL) /*!< Read: Enabled */
#define POWER_INTENSET_RFFELDOSTARTED_Set (1UL) /*!< Enable */

/* Bit 2 : Write '1' to enable interrupt for event POFWARN */
#define POWER_INTENSET_POFWARN_Pos (2UL) /*!< Position of POFWARN field. */
#define POWER_INTENSET_POFWARN_Msk (0x1UL << POWER_INTENSET_POFWARN_Pos) /*!< Bit mask of POFWARN field. */
#define POWER_INTENSET_POFWARN_Disabled (0UL) /*!< Read: Disabled */
#define POWER_INTENSET_POFWARN_Enabled (1UL) /*!< Read: Enabled */
#define POWER_INTENSET_POFWARN_Set (1UL) /*!< Enable */

/* Register: POWER_INTENCLR */
/* Description: Disable interrupt */

/* Bit 6 : Write '1' to disable interrupt for event SLEEPEXIT */
#define POWER_INTENCLR_SLEEPEXIT_Pos (6UL) /*!< Position of SLEEPEXIT field. */
#define POWER_INTENCLR_SLEEPEXIT_Msk (0x1UL << POWER_INTENCLR_SLEEPEXIT_Pos) /*!< Bit mask of SLEEPEXIT field. */
#define POWER_INTENCLR_SLEEPEXIT_Disabled (0UL) /*!< Read: Disabled */
#define POWER_INTENCLR_SLEEPEXIT_Enabled (1UL) /*!< Read: Enabled */
#define POWER_INTENCLR_SLEEPEXIT_Clear (1UL) /*!< Disable */

/* Bit 5 : Write '1' to disable interrupt for event SLEEPENTER */
#define POWER_INTENCLR_SLEEPENTER_Pos (5UL) /*!< Position of SLEEPENTER field. */
#define POWER_INTENCLR_SLEEPENTER_Msk (0x1UL << POWER_INTENCLR_SLEEPENTER_Pos) /*!< Bit mask of SLEEPENTER field. */
#define POWER_INTENCLR_SLEEPENTER_Disabled (0UL) /*!< Read: Disabled */
#define POWER_INTENCLR_SLEEPENTER_Enabled (1UL) /*!< Read: Enabled */
#define POWER_INTENCLR_SLEEPENTER_Clear (1UL) /*!< Disable */

/* Bit 4 : Write '1' to disable interrupt for event IOIFLDOSTARED */
#define POWER_INTENCLR_IOIFLDOSTARED_Pos (4UL) /*!< Position of IOIFLDOSTARED field. */
#define POWER_INTENCLR_IOIFLDOSTARED_Msk (0x1UL << POWER_INTENCLR_IOIFLDOSTARED_Pos) /*!< Bit mask of IOIFLDOSTARED field. */
#define POWER_INTENCLR_IOIFLDOSTARED_Disabled (0UL) /*!< Read: Disabled */
#define POWER_INTENCLR_IOIFLDOSTARED_Enabled (1UL) /*!< Read: Enabled */
#define POWER_INTENCLR_IOIFLDOSTARED_Clear (1UL) /*!< Disable */

/* Bit 3 : Write '1' to disable interrupt for event RFFELDOSTARTED */
#define POWER_INTENCLR_RFFELDOSTARTED_Pos (3UL) /*!< Position of RFFELDOSTARTED field. */
#define POWER_INTENCLR_RFFELDOSTARTED_Msk (0x1UL << POWER_INTENCLR_RFFELDOSTARTED_Pos) /*!< Bit mask of RFFELDOSTARTED field. */
#define POWER_INTENCLR_RFFELDOSTARTED_Disabled (0UL) /*!< Read: Disabled */
#define POWER_INTENCLR_RFFELDOSTARTED_Enabled (1UL) /*!< Read: Enabled */
#define POWER_INTENCLR_RFFELDOSTARTED_Clear (1UL) /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event POFWARN */
#define POWER_INTENCLR_POFWARN_Pos (2UL) /*!< Position of POFWARN field. */
#define POWER_INTENCLR_POFWARN_Msk (0x1UL << POWER_INTENCLR_POFWARN_Pos) /*!< Bit mask of POFWARN field. */
#define POWER_INTENCLR_POFWARN_Disabled (0UL) /*!< Read: Disabled */
#define POWER_INTENCLR_POFWARN_Enabled (1UL) /*!< Read: Enabled */
#define POWER_INTENCLR_POFWARN_Clear (1UL) /*!< Disable */

/* Register: POWER_RESETREAS */
/* Description: Reset reason */

/* Bit 23 : Force off reset from MCUMASTER detected */
#define POWER_RESETREAS_FORCEOFF_Pos (23UL) /*!< Position of FORCEOFF field. */
#define POWER_RESETREAS_FORCEOFF_Msk (0x1UL << POWER_RESETREAS_FORCEOFF_Pos) /*!< Bit mask of FORCEOFF field. */
#define POWER_RESETREAS_FORCEOFF_NotDetected (0UL) /*!< Not detected */
#define POWER_RESETREAS_FORCEOFF_Detected (1UL) /*!< Detected */

/* Bit 22 : CPU reset from MCUMASTER detected */
#define POWER_RESETREAS_MRST_Pos (22UL) /*!< Position of MRST field. */
#define POWER_RESETREAS_MRST_Msk (0x1UL << POWER_RESETREAS_MRST_Pos) /*!< Bit mask of MRST field. */
#define POWER_RESETREAS_MRST_NotDetected (0UL) /*!< Not detected */
#define POWER_RESETREAS_MRST_Detected (1UL) /*!< Detected */

/* Bit 21 : SW reset from modem CTRL-AP detected */
#define POWER_RESETREAS_LCTRLAP_Pos (21UL) /*!< Position of LCTRLAP field. */
#define POWER_RESETREAS_LCTRLAP_Msk (0x1UL << POWER_RESETREAS_LCTRLAP_Pos) /*!< Bit mask of LCTRLAP field. */
#define POWER_RESETREAS_LCTRLAP_NotDetected (0UL) /*!< Not detected */
#define POWER_RESETREAS_LCTRLAP_Detected (1UL) /*!< Detected */

/* Bit 20 : Reset from secure control detected */
#define POWER_RESETREAS_SCTRL_Pos (20UL) /*!< Position of SCTRL field. */
#define POWER_RESETREAS_SCTRL_Msk (0x1UL << POWER_RESETREAS_SCTRL_Pos) /*!< Bit mask of SCTRL field. */
#define POWER_RESETREAS_SCTRL_NotDetected (0UL) /*!< Not detected */
#define POWER_RESETREAS_SCTRL_Detected (1UL) /*!< Detected */

/* Bit 19 : Reset from secure watchdog detected */
#define POWER_RESETREAS_SDOG_Pos (19UL) /*!< Position of SDOG field. */
#define POWER_RESETREAS_SDOG_Msk (0x1UL << POWER_RESETREAS_SDOG_Pos) /*!< Bit mask of SDOG field. */
#define POWER_RESETREAS_SDOG_NotDetected (0UL) /*!< Not detected */
#define POWER_RESETREAS_SDOG_Detected (1UL) /*!< Detected */

/* Bit 18 : Reset from local watchdog detected */
#define POWER_RESETREAS_LDOG_Pos (18UL) /*!< Position of LDOG field. */
#define POWER_RESETREAS_LDOG_Msk (0x1UL << POWER_RESETREAS_LDOG_Pos) /*!< Bit mask of LDOG field. */
#define POWER_RESETREAS_LDOG_NotDetected (0UL) /*!< Not detected */
#define POWER_RESETREAS_LDOG_Detected (1UL) /*!< Detected */

/* Bit 17 : Reset from local CPU lock-up detected */
#define POWER_RESETREAS_LOCKUP_Pos (17UL) /*!< Position of LOCKUP field. */
#define POWER_RESETREAS_LOCKUP_Msk (0x1UL << POWER_RESETREAS_LOCKUP_Pos) /*!< Bit mask of LOCKUP field. */
#define POWER_RESETREAS_LOCKUP_NotDetected (0UL) /*!< Not detected */
#define POWER_RESETREAS_LOCKUP_Detected (1UL) /*!< Detected */

