adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem_bitfields.h
/* Bit 16 : Reset from local AIRCR.SYSRESETREQ detected */
#define POWER_RESETREAS_SREQ_Pos (16UL) /*!< Position of SREQ field. */
#define POWER_RESETREAS_SREQ_Msk (0x1UL << POWER_RESETREAS_SREQ_Pos) /*!< Bit mask of SREQ field. */
#define POWER_RESETREAS_SREQ_NotDetected (0UL) /*!< Not detected */
#define POWER_RESETREAS_SREQ_Detected (1UL) /*!< Detected */

/* Bit 7 : Reset due to wake up from System OFF mode when wakeup is triggered from entering into debug interface mode */
#define POWER_RESETREAS_DIF_Pos (7UL) /*!< Position of DIF field. */
#define POWER_RESETREAS_DIF_Msk (0x1UL << POWER_RESETREAS_DIF_Pos) /*!< Bit mask of DIF field. */
#define POWER_RESETREAS_DIF_NotDetected (0UL) /*!< Not detected */
#define POWER_RESETREAS_DIF_Detected (1UL) /*!< Detected */

/* Bit 5 : Reset due to wake up from System OFF mode when wakeup is triggered from DETECT signal from GPIO */
#define POWER_RESETREAS_OFF_Pos (5UL) /*!< Position of OFF field. */
#define POWER_RESETREAS_OFF_Msk (0x1UL << POWER_RESETREAS_OFF_Pos) /*!< Bit mask of OFF field. */
#define POWER_RESETREAS_OFF_NotDetected (0UL) /*!< Not detected */
#define POWER_RESETREAS_OFF_Detected (1UL) /*!< Detected */

/* Bit 4 : Reset from global application CPU lock-up detected */
#define POWER_RESETREAS_GLOCKUP_Pos (4UL) /*!< Position of GLOCKUP field. */
#define POWER_RESETREAS_GLOCKUP_Msk (0x1UL << POWER_RESETREAS_GLOCKUP_Pos) /*!< Bit mask of GLOCKUP field. */
#define POWER_RESETREAS_GLOCKUP_NotDetected (0UL) /*!< Not detected */
#define POWER_RESETREAS_GLOCKUP_Detected (1UL) /*!< Detected */

/* Bit 3 : Reset from global application AIRCR.SYSRESETREQ detected */
#define POWER_RESETREAS_GSREQ_Pos (3UL) /*!< Position of GSREQ field. */
#define POWER_RESETREAS_GSREQ_Msk (0x1UL << POWER_RESETREAS_GSREQ_Pos) /*!< Bit mask of GSREQ field. */
#define POWER_RESETREAS_GSREQ_NotDetected (0UL) /*!< Not detected */
#define POWER_RESETREAS_GSREQ_Detected (1UL) /*!< Detected */

/* Bit 2 : Reset from global application CTRL-AP detected */
#define POWER_RESETREAS_CTRLAP_Pos (2UL) /*!< Position of CTRLAP field. */
#define POWER_RESETREAS_CTRLAP_Msk (0x1UL << POWER_RESETREAS_CTRLAP_Pos) /*!< Bit mask of CTRLAP field. */
#define POWER_RESETREAS_CTRLAP_NotDetected (0UL) /*!< Not detected */
#define POWER_RESETREAS_CTRLAP_Detected (1UL) /*!< Detected */

/* Bit 1 : Reset from global application watchdog detected */
#define POWER_RESETREAS_DOG_Pos (1UL) /*!< Position of DOG field. */
#define POWER_RESETREAS_DOG_Msk (0x1UL << POWER_RESETREAS_DOG_Pos) /*!< Bit mask of DOG field. */
#define POWER_RESETREAS_DOG_NotDetected (0UL) /*!< Not detected */
#define POWER_RESETREAS_DOG_Detected (1UL) /*!< Detected */

/* Bit 0 : Reset from pin-reset detected */
#define POWER_RESETREAS_RESETPIN_Pos (0UL) /*!< Position of RESETPIN field. */
#define POWER_RESETREAS_RESETPIN_Msk (0x1UL << POWER_RESETREAS_RESETPIN_Pos) /*!< Bit mask of RESETPIN field. */
#define POWER_RESETREAS_RESETPIN_NotDetected (0UL) /*!< Not detected */
#define POWER_RESETREAS_RESETPIN_Detected (1UL) /*!< Detected */

/* Register: POWER_DSPPOWERSTATUS */
/* Description: Slave power status: DSP power domain power state. */

/* Bit 0 : Modem DSP power state */
#define POWER_DSPPOWERSTATUS_DSPPOWERSTATUS_Pos (0UL) /*!< Position of DSPPOWERSTATUS field. */
#define POWER_DSPPOWERSTATUS_DSPPOWERSTATUS_Msk (0x1UL << POWER_DSPPOWERSTATUS_DSPPOWERSTATUS_Pos) /*!< Bit mask of DSPPOWERSTATUS field. */
#define POWER_DSPPOWERSTATUS_DSPPOWERSTATUS_ON (0UL) /*!< DSP domain powered on */
#define POWER_DSPPOWERSTATUS_DSPPOWERSTATUS_OFF (1UL) /*!< DSP domain powered off */

/* Register: POWER_M0POWERSTATUS */
/* Description: Slave power status: RF M0 power domain power state. */

/* Bit 0 : Modem RF M0 power state */
#define POWER_M0POWERSTATUS_M0POWERSTATUS_Pos (0UL) /*!< Position of M0POWERSTATUS field. */
#define POWER_M0POWERSTATUS_M0POWERSTATUS_Msk (0x1UL << POWER_M0POWERSTATUS_M0POWERSTATUS_Pos) /*!< Bit mask of M0POWERSTATUS field. */
#define POWER_M0POWERSTATUS_M0POWERSTATUS_ON (0UL) /*!< RF domain powered on */
#define POWER_M0POWERSTATUS_M0POWERSTATUS_OFF (1UL) /*!< RF domain powered off */

/* Register: POWER_SLEEPCNF */
/* Description: Sleep configuration */

/* Bit 0 : Sleep mode */
#define POWER_SLEEPCNF_SLEEPMODE_Pos (0UL) /*!< Position of SLEEPMODE field. */
#define POWER_SLEEPCNF_SLEEPMODE_Msk (0x1UL << POWER_SLEEPCNF_SLEEPMODE_Pos) /*!< Bit mask of SLEEPMODE field. */
#define POWER_SLEEPCNF_SLEEPMODE_LIGHTSLEEP (0UL) /*!< Light sleep FF retention mode will be used if available. Otherwise FFs are kept powered. */
#define POWER_SLEEPCNF_SLEEPMODE_DEEPSLEEP (1UL) /*!< Deep sleep (wake from reset) No FF retention (needs wake from reset). */

/* Register: POWER_GPREGRET */
/* Description: Description collection: General purpose retention register */

/* Bits 7..0 : General purpose retention register */
#define POWER_GPREGRET_GPREGRET_Pos (0UL) /*!< Position of GPREGRET field. */
#define POWER_GPREGRET_GPREGRET_Msk (0xFFUL << POWER_GPREGRET_GPREGRET_Pos) /*!< Bit mask of GPREGRET field. */

/* Register: POWER_DSP_RESET */
/* Description: Reset DSP subsystem */

/* Bit 0 : RESET */
#define POWER_DSP_RESET_RESET_Pos (0UL) /*!< Position of RESET field. */
#define POWER_DSP_RESET_RESET_Msk (0x1UL << POWER_DSP_RESET_RESET_Pos) /*!< Bit mask of RESET field. */
#define POWER_DSP_RESET_RESET_Release (0UL) /*!< Release CPU reset signal. */
#define POWER_DSP_RESET_RESET_Hold (1UL) /*!< Hold CPU reset signal. */

/* Register: POWER_DSP_FORCEON */
/* Description: Force on power and clock in DSP subsystem */

/* Bit 0 : Forces on power and clock in DSP subsystem */
#define POWER_DSP_FORCEON_FORCEON_Pos (0UL) /*!< Position of FORCEON field. */
#define POWER_DSP_FORCEON_FORCEON_Msk (0x1UL << POWER_DSP_FORCEON_FORCEON_Pos) /*!< Bit mask of FORCEON field. */
#define POWER_DSP_FORCEON_FORCEON_Release (0UL) /*!< Release force on signal. */
#define POWER_DSP_FORCEON_FORCEON_Hold (1UL) /*!< Hold force on signal. */

/* Register: POWER_DSP_HALT */
/* Description: Halt DSP subsystem */

