adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem_bitfields.h
/* Bit 0 : Halt DSP subsystem */
#define POWER_DSP_HALT_HALT_Pos (0UL) /*!< Position of HALT field. */
#define POWER_DSP_HALT_HALT_Msk (0x1UL << POWER_DSP_HALT_HALT_Pos) /*!< Bit mask of HALT field. */
#define POWER_DSP_HALT_HALT_Release (0UL) /*!< Release halt signal. */
#define POWER_DSP_HALT_HALT_Hold (1UL) /*!< Hold halt signal. */

/* Register: POWER_LYNX_RESET */
/* Description: Reset Lynx RF subsystem */

/* Bit 0 : CPU soft reset */
#define POWER_LYNX_RESET_RESET_Pos (0UL) /*!< Position of RESET field. */
#define POWER_LYNX_RESET_RESET_Msk (0x1UL << POWER_LYNX_RESET_RESET_Pos) /*!< Bit mask of RESET field. */
#define POWER_LYNX_RESET_RESET_Release (0UL) /*!< Release CPU reset signal. */
#define POWER_LYNX_RESET_RESET_Hold (1UL) /*!< Hold CPU reset signal. */

/* Register: POWER_LYNX_FORCEON */
/* Description: Force on Lynx RF subsystem */

/* Bit 0 : Forces an power and clock DSP subsystem */
#define POWER_LYNX_FORCEON_FORCEON_Pos (0UL) /*!< Position of FORCEON field. */
#define POWER_LYNX_FORCEON_FORCEON_Msk (0x1UL << POWER_LYNX_FORCEON_FORCEON_Pos) /*!< Bit mask of FORCEON field. */
#define POWER_LYNX_FORCEON_FORCEON_Release (0UL) /*!< Release force on signal. */
#define POWER_LYNX_FORCEON_FORCEON_Hold (1UL) /*!< Hold force on signal. */


/* Peripheral: RAMBISTHUB */
/* Description: RAM BIST Hub */

/* Register: RAMBISTHUB_RUN */
/* Description: RUN BIST */

/* Bit 0 : RUN BIST */
#define RAMBISTHUB_RUN_RUN_Pos (0UL) /*!< Position of RUN field. */
#define RAMBISTHUB_RUN_RUN_Msk (0x1UL << RAMBISTHUB_RUN_RUN_Pos) /*!< Bit mask of RUN field. */
#define RAMBISTHUB_RUN_RUN_Clear (0UL) /*!< Clear the task */
#define RAMBISTHUB_RUN_RUN_Set (1UL) /*!< Run the task */

/* Register: RAMBISTHUB_SLEEP */
/* Description: BIST SLEEP EVENT */

/* Bit 0 : BIST SLEEP EVENT */
#define RAMBISTHUB_SLEEP_SLEEP_Pos (0UL) /*!< Position of SLEEP field. */
#define RAMBISTHUB_SLEEP_SLEEP_Msk (0x1UL << RAMBISTHUB_SLEEP_SLEEP_Pos) /*!< Bit mask of SLEEP field. */
#define RAMBISTHUB_SLEEP_SLEEP_NoEventDetected (0UL) /*!< No event detected. Write zero to clear the event. */
#define RAMBISTHUB_SLEEP_SLEEP_EventDetected (1UL) /*!< Event detected */

/* Register: RAMBISTHUB_FINISHED */
/* Description: BIST FINISHED EVENT */

/* Bit 0 : BIST FINISHED EVENT */
#define RAMBISTHUB_FINISHED_FINISHED_Pos (0UL) /*!< Position of FINISHED field. */
#define RAMBISTHUB_FINISHED_FINISHED_Msk (0x1UL << RAMBISTHUB_FINISHED_FINISHED_Pos) /*!< Bit mask of FINISHED field. */
#define RAMBISTHUB_FINISHED_FINISHED_NoEventDetected (0UL) /*!< No event detected. Write zero to clear the event. */
#define RAMBISTHUB_FINISHED_FINISHED_EventDetected (1UL) /*!< Event detected */

/* Register: RAMBISTHUB_HUBENABLE */
/* Description: RAM BIST Hub enable */

/* Bit 0 : RAM BIST Hub enable */
#define RAMBISTHUB_HUBENABLE_HUBENABLE_Pos (0UL) /*!< Position of HUBENABLE field. */
#define RAMBISTHUB_HUBENABLE_HUBENABLE_Msk (0x1UL << RAMBISTHUB_HUBENABLE_HUBENABLE_Pos) /*!< Bit mask of HUBENABLE field. */
#define RAMBISTHUB_HUBENABLE_HUBENABLE_Disabled (0UL) /*!< RAM BIST Hub disabled */
#define RAMBISTHUB_HUBENABLE_HUBENABLE_Enabled (1UL) /*!< RAM BIST Hub enabled */

/* Register: RAMBISTHUB_SELECTBIST */
/* Description: Select bits for the individual BISTs to run */

/* Bit 2 : Select and enable BIST2 */
#define RAMBISTHUB_SELECTBIST_SELECTBIST2_Pos (2UL) /*!< Position of SELECTBIST2 field. */
#define RAMBISTHUB_SELECTBIST_SELECTBIST2_Msk (0x1UL << RAMBISTHUB_SELECTBIST_SELECTBIST2_Pos) /*!< Bit mask of SELECTBIST2 field. */
#define RAMBISTHUB_SELECTBIST_SELECTBIST2_Disabled (0UL) /*!< BIST2 disabled */
#define RAMBISTHUB_SELECTBIST_SELECTBIST2_Enabled (1UL) /*!< BIST2 enabled */

/* Bit 1 : Select and enable BIST1 */
#define RAMBISTHUB_SELECTBIST_SELECTBIST1_Pos (1UL) /*!< Position of SELECTBIST1 field. */
#define RAMBISTHUB_SELECTBIST_SELECTBIST1_Msk (0x1UL << RAMBISTHUB_SELECTBIST_SELECTBIST1_Pos) /*!< Bit mask of SELECTBIST1 field. */
#define RAMBISTHUB_SELECTBIST_SELECTBIST1_Disabled (0UL) /*!< BIST1 disabled */
#define RAMBISTHUB_SELECTBIST_SELECTBIST1_Enabled (1UL) /*!< BIST1 enabled */

/* Bit 0 : Select and enable BIST0 */
#define RAMBISTHUB_SELECTBIST_SELECTBIST0_Pos (0UL) /*!< Position of SELECTBIST0 field. */
#define RAMBISTHUB_SELECTBIST_SELECTBIST0_Msk (0x1UL << RAMBISTHUB_SELECTBIST_SELECTBIST0_Pos) /*!< Bit mask of SELECTBIST0 field. */
#define RAMBISTHUB_SELECTBIST_SELECTBIST0_Disabled (0UL) /*!< BIST0 disabled */
#define RAMBISTHUB_SELECTBIST_SELECTBIST0_Enabled (1UL) /*!< BIST0 enabled */

/* Register: RAMBISTHUB_BISTSTATUS */
/* Description: BIST status */

/* Bit 2 : Status of BIST2. Write to clear. */
#define RAMBISTHUB_BISTSTATUS_BISTSTATUS2_Pos (2UL) /*!< Position of BISTSTATUS2 field. */
#define RAMBISTHUB_BISTSTATUS_BISTSTATUS2_Msk (0x1UL << RAMBISTHUB_BISTSTATUS_BISTSTATUS2_Pos) /*!< Bit mask of BISTSTATUS2 field. */
#define RAMBISTHUB_BISTSTATUS_BISTSTATUS2_NotPassed (0UL) /*!< Read: BIST2 not passed */
#define RAMBISTHUB_BISTSTATUS_BISTSTATUS2_Passed (1UL) /*!< Read: BIST2 passed. Write zero to clear. */

/* Bit 1 : Status of BIST1. Write to clear. */
#define RAMBISTHUB_BISTSTATUS_BISTSTATUS1_Pos (1UL) /*!< Position of BISTSTATUS1 field. */
#define RAMBISTHUB_BISTSTATUS_BISTSTATUS1_Msk (0x1UL << RAMBISTHUB_BISTSTATUS_BISTSTATUS1_Pos) /*!< Bit mask of BISTSTATUS1 field. */
#define RAMBISTHUB_BISTSTATUS_BISTSTATUS1_NotPassed (0UL) /*!< Read: BIST1 not passed */
#define RAMBISTHUB_BISTSTATUS_BISTSTATUS1_Passed (1UL) /*!< Read: BIST1 passed. Write zero to clear. */

/* Bit 0 : Status of BIST0. Write to clear. */
#define RAMBISTHUB_BISTSTATUS_BISTSTATUS0_Pos (0UL) /*!< Position of BISTSTATUS0 field. */
#define RAMBISTHUB_BISTSTATUS_BISTSTATUS0_Msk (0x1UL << RAMBISTHUB_BISTSTATUS_BISTSTATUS0_Pos) /*!< Bit mask of BISTSTATUS0 field. */
#define RAMBISTHUB_BISTSTATUS_BISTSTATUS0_NotPassed (0UL) /*!< Read: BIST0 not passed */
#define RAMBISTHUB_BISTSTATUS_BISTSTATUS0_Passed (1UL) /*!< Read: BIST0 passed. Write zero to clear. */

/* Register: RAMBISTHUB_TESTTYPE */
/* Description: RAM BIST test type */

/* Bit 0 : RAM BIST Hub enable */
#define RAMBISTHUB_TESTTYPE_TESTTYPE_Pos (0UL) /*!< Position of TESTTYPE field. */
#define RAMBISTHUB_TESTTYPE_TESTTYPE_Msk (0x1UL << RAMBISTHUB_TESTTYPE_TESTTYPE_Pos) /*!< Bit mask of TESTTYPE field. */
#define RAMBISTHUB_TESTTYPE_TESTTYPE_BIST (0UL) /*!< Non-retention BIST */
#define RAMBISTHUB_TESTTYPE_TESTTYPE_RetentionBIST (1UL) /*!< Retention BIST */

/* Register: RAMBISTHUB_FORCEONRETENTION */
/* Description: Power request override to force RAM retention on */

