adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem_bitfields.h
/* Bit 0 : SHA calculated. */
#define SHA_EVENTS_SHA_READY_EVENTS_SHA_READY_Pos (0UL) /*!< Position of EVENTS_SHA_READY field. */
#define SHA_EVENTS_SHA_READY_EVENTS_SHA_READY_Msk (0x1UL << SHA_EVENTS_SHA_READY_EVENTS_SHA_READY_Pos) /*!< Bit mask of EVENTS_SHA_READY field. */
#define SHA_EVENTS_SHA_READY_EVENTS_SHA_READY_NotGenerated (0UL) /*!< Event not generated */
#define SHA_EVENTS_SHA_READY_EVENTS_SHA_READY_Generated (1UL) /*!< Event generated */

/* Register: SHA_EVENTS_MESSAGE_READY */
/* Description: LENGTH == 0. */

/* Bit 0 : LENGTH == 0. */
#define SHA_EVENTS_MESSAGE_READY_EVENTS_MESSAGE_READY_Pos (0UL) /*!< Position of EVENTS_MESSAGE_READY field. */
#define SHA_EVENTS_MESSAGE_READY_EVENTS_MESSAGE_READY_Msk (0x1UL << SHA_EVENTS_MESSAGE_READY_EVENTS_MESSAGE_READY_Pos) /*!< Bit mask of EVENTS_MESSAGE_READY field. */
#define SHA_EVENTS_MESSAGE_READY_EVENTS_MESSAGE_READY_NotGenerated (0UL) /*!< Event not generated */
#define SHA_EVENTS_MESSAGE_READY_EVENTS_MESSAGE_READY_Generated (1UL) /*!< Event generated */

/* Register: SHA_EVENTS_RESETTED */
/* Description: Resetted (all transfers and crypto operations stopped). */

/* Bit 0 : Resetted (all transfers and crypto operations stopped). */
#define SHA_EVENTS_RESETTED_EVENTS_RESETTED_Pos (0UL) /*!< Position of EVENTS_RESETTED field. */
#define SHA_EVENTS_RESETTED_EVENTS_RESETTED_Msk (0x1UL << SHA_EVENTS_RESETTED_EVENTS_RESETTED_Pos) /*!< Bit mask of EVENTS_RESETTED field. */
#define SHA_EVENTS_RESETTED_EVENTS_RESETTED_NotGenerated (0UL) /*!< Event not generated */
#define SHA_EVENTS_RESETTED_EVENTS_RESETTED_Generated (1UL) /*!< Event generated */

/* Register: SHA_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 1 : Shortcut between event GATHER_DONE and task FINALIZE */
#define SHA_SHORTS_GATHER_DONE_FINALIZE_Pos (1UL) /*!< Position of GATHER_DONE_FINALIZE field. */
#define SHA_SHORTS_GATHER_DONE_FINALIZE_Msk (0x1UL << SHA_SHORTS_GATHER_DONE_FINALIZE_Pos) /*!< Bit mask of GATHER_DONE_FINALIZE field. */
#define SHA_SHORTS_GATHER_DONE_FINALIZE_Disabled (0UL) /*!< Disable shortcut */
#define SHA_SHORTS_GATHER_DONE_FINALIZE_Enabled (1UL) /*!< Enable shortcut */

/* Bit 0 : Shortcut between event GATHER_STARTED and task START_OPERATION */
#define SHA_SHORTS_GATHER_STARTED_START_OPERATION_Pos (0UL) /*!< Position of GATHER_STARTED_START_OPERATION field. */
#define SHA_SHORTS_GATHER_STARTED_START_OPERATION_Msk (0x1UL << SHA_SHORTS_GATHER_STARTED_START_OPERATION_Pos) /*!< Bit mask of GATHER_STARTED_START_OPERATION field. */
#define SHA_SHORTS_GATHER_STARTED_START_OPERATION_Disabled (0UL) /*!< Disable shortcut */
#define SHA_SHORTS_GATHER_STARTED_START_OPERATION_Enabled (1UL) /*!< Enable shortcut */

/* Register: SHA_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 5 : Enable or disable interrupt for event RESETTED */
#define SHA_INTEN_RESETTED_Pos (5UL) /*!< Position of RESETTED field. */
#define SHA_INTEN_RESETTED_Msk (0x1UL << SHA_INTEN_RESETTED_Pos) /*!< Bit mask of RESETTED field. */
#define SHA_INTEN_RESETTED_Disabled (0UL) /*!< Disable */
#define SHA_INTEN_RESETTED_Enabled (1UL) /*!< Enable */

/* Bit 4 : Enable or disable interrupt for event MESSAGE_READY */
#define SHA_INTEN_MESSAGE_READY_Pos (4UL) /*!< Position of MESSAGE_READY field. */
#define SHA_INTEN_MESSAGE_READY_Msk (0x1UL << SHA_INTEN_MESSAGE_READY_Pos) /*!< Bit mask of MESSAGE_READY field. */
#define SHA_INTEN_MESSAGE_READY_Disabled (0UL) /*!< Disable */
#define SHA_INTEN_MESSAGE_READY_Enabled (1UL) /*!< Enable */

/* Bit 3 : Enable or disable interrupt for event SHA_READY */
#define SHA_INTEN_SHA_READY_Pos (3UL) /*!< Position of SHA_READY field. */
#define SHA_INTEN_SHA_READY_Msk (0x1UL << SHA_INTEN_SHA_READY_Pos) /*!< Bit mask of SHA_READY field. */
#define SHA_INTEN_SHA_READY_Disabled (0UL) /*!< Disable */
#define SHA_INTEN_SHA_READY_Enabled (1UL) /*!< Enable */

/* Bit 1 : Enable or disable interrupt for event GATHER_DONE */
#define SHA_INTEN_GATHER_DONE_Pos (1UL) /*!< Position of GATHER_DONE field. */
#define SHA_INTEN_GATHER_DONE_Msk (0x1UL << SHA_INTEN_GATHER_DONE_Pos) /*!< Bit mask of GATHER_DONE field. */
#define SHA_INTEN_GATHER_DONE_Disabled (0UL) /*!< Disable */
#define SHA_INTEN_GATHER_DONE_Enabled (1UL) /*!< Enable */

/* Bit 0 : Enable or disable interrupt for event GATHER_STARTED */
#define SHA_INTEN_GATHER_STARTED_Pos (0UL) /*!< Position of GATHER_STARTED field. */
#define SHA_INTEN_GATHER_STARTED_Msk (0x1UL << SHA_INTEN_GATHER_STARTED_Pos) /*!< Bit mask of GATHER_STARTED field. */
#define SHA_INTEN_GATHER_STARTED_Disabled (0UL) /*!< Disable */
#define SHA_INTEN_GATHER_STARTED_Enabled (1UL) /*!< Enable */

/* Register: SHA_INTENSET */
/* Description: Enable interrupt */

/* Bit 5 : Write '1' to enable interrupt for event RESETTED */
#define SHA_INTENSET_RESETTED_Pos (5UL) /*!< Position of RESETTED field. */
#define SHA_INTENSET_RESETTED_Msk (0x1UL << SHA_INTENSET_RESETTED_Pos) /*!< Bit mask of RESETTED field. */
#define SHA_INTENSET_RESETTED_Disabled (0UL) /*!< Read: Disabled */
#define SHA_INTENSET_RESETTED_Enabled (1UL) /*!< Read: Enabled */
#define SHA_INTENSET_RESETTED_Set (1UL) /*!< Enable */

/* Bit 4 : Write '1' to enable interrupt for event MESSAGE_READY */
#define SHA_INTENSET_MESSAGE_READY_Pos (4UL) /*!< Position of MESSAGE_READY field. */
#define SHA_INTENSET_MESSAGE_READY_Msk (0x1UL << SHA_INTENSET_MESSAGE_READY_Pos) /*!< Bit mask of MESSAGE_READY field. */
#define SHA_INTENSET_MESSAGE_READY_Disabled (0UL) /*!< Read: Disabled */
#define SHA_INTENSET_MESSAGE_READY_Enabled (1UL) /*!< Read: Enabled */
#define SHA_INTENSET_MESSAGE_READY_Set (1UL) /*!< Enable */

/* Bit 3 : Write '1' to enable interrupt for event SHA_READY */
#define SHA_INTENSET_SHA_READY_Pos (3UL) /*!< Position of SHA_READY field. */
#define SHA_INTENSET_SHA_READY_Msk (0x1UL << SHA_INTENSET_SHA_READY_Pos) /*!< Bit mask of SHA_READY field. */
#define SHA_INTENSET_SHA_READY_Disabled (0UL) /*!< Read: Disabled */
#define SHA_INTENSET_SHA_READY_Enabled (1UL) /*!< Read: Enabled */
#define SHA_INTENSET_SHA_READY_Set (1UL) /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event GATHER_DONE */
#define SHA_INTENSET_GATHER_DONE_Pos (1UL) /*!< Position of GATHER_DONE field. */
#define SHA_INTENSET_GATHER_DONE_Msk (0x1UL << SHA_INTENSET_GATHER_DONE_Pos) /*!< Bit mask of GATHER_DONE field. */
#define SHA_INTENSET_GATHER_DONE_Disabled (0UL) /*!< Read: Disabled */
#define SHA_INTENSET_GATHER_DONE_Enabled (1UL) /*!< Read: Enabled */
#define SHA_INTENSET_GATHER_DONE_Set (1UL) /*!< Enable */

