adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem_bitfields.h
/* Bit 0 : Write '1' to enable interrupt for event GATHER_STARTED */
#define SHA_INTENSET_GATHER_STARTED_Pos (0UL) /*!< Position of GATHER_STARTED field. */
#define SHA_INTENSET_GATHER_STARTED_Msk (0x1UL << SHA_INTENSET_GATHER_STARTED_Pos) /*!< Bit mask of GATHER_STARTED field. */
#define SHA_INTENSET_GATHER_STARTED_Disabled (0UL) /*!< Read: Disabled */
#define SHA_INTENSET_GATHER_STARTED_Enabled (1UL) /*!< Read: Enabled */
#define SHA_INTENSET_GATHER_STARTED_Set (1UL) /*!< Enable */

/* Register: SHA_INTENCLR */
/* Description: Disable interrupt */

/* Bit 5 : Write '1' to disable interrupt for event RESETTED */
#define SHA_INTENCLR_RESETTED_Pos (5UL) /*!< Position of RESETTED field. */
#define SHA_INTENCLR_RESETTED_Msk (0x1UL << SHA_INTENCLR_RESETTED_Pos) /*!< Bit mask of RESETTED field. */
#define SHA_INTENCLR_RESETTED_Disabled (0UL) /*!< Read: Disabled */
#define SHA_INTENCLR_RESETTED_Enabled (1UL) /*!< Read: Enabled */
#define SHA_INTENCLR_RESETTED_Clear (1UL) /*!< Disable */

/* Bit 4 : Write '1' to disable interrupt for event MESSAGE_READY */
#define SHA_INTENCLR_MESSAGE_READY_Pos (4UL) /*!< Position of MESSAGE_READY field. */
#define SHA_INTENCLR_MESSAGE_READY_Msk (0x1UL << SHA_INTENCLR_MESSAGE_READY_Pos) /*!< Bit mask of MESSAGE_READY field. */
#define SHA_INTENCLR_MESSAGE_READY_Disabled (0UL) /*!< Read: Disabled */
#define SHA_INTENCLR_MESSAGE_READY_Enabled (1UL) /*!< Read: Enabled */
#define SHA_INTENCLR_MESSAGE_READY_Clear (1UL) /*!< Disable */

/* Bit 3 : Write '1' to disable interrupt for event SHA_READY */
#define SHA_INTENCLR_SHA_READY_Pos (3UL) /*!< Position of SHA_READY field. */
#define SHA_INTENCLR_SHA_READY_Msk (0x1UL << SHA_INTENCLR_SHA_READY_Pos) /*!< Bit mask of SHA_READY field. */
#define SHA_INTENCLR_SHA_READY_Disabled (0UL) /*!< Read: Disabled */
#define SHA_INTENCLR_SHA_READY_Enabled (1UL) /*!< Read: Enabled */
#define SHA_INTENCLR_SHA_READY_Clear (1UL) /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event GATHER_DONE */
#define SHA_INTENCLR_GATHER_DONE_Pos (1UL) /*!< Position of GATHER_DONE field. */
#define SHA_INTENCLR_GATHER_DONE_Msk (0x1UL << SHA_INTENCLR_GATHER_DONE_Pos) /*!< Bit mask of GATHER_DONE field. */
#define SHA_INTENCLR_GATHER_DONE_Disabled (0UL) /*!< Read: Disabled */
#define SHA_INTENCLR_GATHER_DONE_Enabled (1UL) /*!< Read: Enabled */
#define SHA_INTENCLR_GATHER_DONE_Clear (1UL) /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event GATHER_STARTED */
#define SHA_INTENCLR_GATHER_STARTED_Pos (0UL) /*!< Position of GATHER_STARTED field. */
#define SHA_INTENCLR_GATHER_STARTED_Msk (0x1UL << SHA_INTENCLR_GATHER_STARTED_Pos) /*!< Bit mask of GATHER_STARTED field. */
#define SHA_INTENCLR_GATHER_STARTED_Disabled (0UL) /*!< Read: Disabled */
#define SHA_INTENCLR_GATHER_STARTED_Enabled (1UL) /*!< Read: Enabled */
#define SHA_INTENCLR_GATHER_STARTED_Clear (1UL) /*!< Disable */

/* Register: SHA_LENGTH */
/* Description: Message length in bits. */

/* Bits 31..0 : Message length in bits. */
#define SHA_LENGTH_LENGTH_Pos (0UL) /*!< Position of LENGTH field. */
#define SHA_LENGTH_LENGTH_Msk (0xFFFFFFFFUL << SHA_LENGTH_LENGTH_Pos) /*!< Bit mask of LENGTH field. */

/* Register: SHA_MODE */
/* Description: Configuration. */

/* Bits 1..0 : MODE SELECTION */
#define SHA_MODE_MODE_Pos (0UL) /*!< Position of MODE field. */
#define SHA_MODE_MODE_Msk (0x3UL << SHA_MODE_MODE_Pos) /*!< Bit mask of MODE field. */
#define SHA_MODE_MODE_SHA_1 (0UL) /*!< SHA-1 mode */
#define SHA_MODE_MODE_SHA_256 (2UL) /*!< SHA-256 mode */

/* Register: SHA_H7 */
/* Description: Final result H7 (SHA-256), H4 (SHA-1). Updated after every 512bit block calculated. */

/* Bits 31..0 : Data7 */
#define SHA_H7_Data_Pos (0UL) /*!< Position of Data field. */
#define SHA_H7_Data_Msk (0xFFFFFFFFUL << SHA_H7_Data_Pos) /*!< Bit mask of Data field. */

/* Register: SHA_H6 */
/* Description: Final result H6 (SHA-256), H3 (SHA-1). Updated after every 512bit block calculated. */

/* Bits 31..0 : Data6 */
#define SHA_H6_Data_Pos (0UL) /*!< Position of Data field. */
#define SHA_H6_Data_Msk (0xFFFFFFFFUL << SHA_H6_Data_Pos) /*!< Bit mask of Data field. */

/* Register: SHA_H5 */
/* Description: Final result H5 (SHA-256), H2 (SHA-1). Updated after every 512bit block calculated. */

/* Bits 31..0 : Data5 */
#define SHA_H5_Data_Pos (0UL) /*!< Position of Data field. */
#define SHA_H5_Data_Msk (0xFFFFFFFFUL << SHA_H5_Data_Pos) /*!< Bit mask of Data field. */

/* Register: SHA_H4 */
/* Description: Final result H4 (SHA-256), H1 (SHA-1). Updated after every 512bit block calculated. */

/* Bits 31..0 : Data4 */
#define SHA_H4_Data_Pos (0UL) /*!< Position of Data field. */
#define SHA_H4_Data_Msk (0xFFFFFFFFUL << SHA_H4_Data_Pos) /*!< Bit mask of Data field. */

/* Register: SHA_H3 */
/* Description: Final result H3 (SHA-256), H0 (SHA-1). Updated after every 512bit block calculated. */

/* Bits 31..0 : Data3 */
#define SHA_H3_Data_Pos (0UL) /*!< Position of Data field. */
#define SHA_H3_Data_Msk (0xFFFFFFFFUL << SHA_H3_Data_Pos) /*!< Bit mask of Data field. */

/* Register: SHA_H2 */
/* Description: Final result H2 (SHA-256). Updated after every 512bit block calculated. */

/* Bits 31..0 : Data2 */
#define SHA_H2_Data_Pos (0UL) /*!< Position of Data field. */
#define SHA_H2_Data_Msk (0xFFFFFFFFUL << SHA_H2_Data_Pos) /*!< Bit mask of Data field. */

/* Register: SHA_H1 */
/* Description: Final result H1 (SHA-256). Updated after every 512bit block calculated. */

/* Bits 31..0 : Data1 */
#define SHA_H1_Data_Pos (0UL) /*!< Position of Data field. */
#define SHA_H1_Data_Msk (0xFFFFFFFFUL << SHA_H1_Data_Pos) /*!< Bit mask of Data field. */

/* Register: SHA_H0 */
/* Description: Final result H0 (SHA-256). Updated after every 512bit block calculated.. */

/* Bits 31..0 : Data0 */
#define SHA_H0_Data_Pos (0UL) /*!< Position of Data field. */
#define SHA_H0_Data_Msk (0xFFFFFFFFUL << SHA_H0_Data_Pos) /*!< Bit mask of Data field. */

/* Register: SHA_H7_R */
/* Description: Final result H7_R (SHA-256), H4_R (SHA-1) in reversed byte order. Updated after every 512bit block calculated. */

/* Bits 31..0 : Data7 */
#define SHA_H7_R_Data_Pos (0UL) /*!< Position of Data field. */
#define SHA_H7_R_Data_Msk (0xFFFFFFFFUL << SHA_H7_R_Data_Pos) /*!< Bit mask of Data field. */

