adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem_bitfields.h
/* Bit 0 : Write test data from Ahb test reg to Ahb Rx bus */
#define SIMIF_TASKS_STARTWRITEFROMREG_TASKS_STARTWRITEFROMREG_Pos (0UL) /*!< Position of TASKS_STARTWRITEFROMREG field. */
#define SIMIF_TASKS_STARTWRITEFROMREG_TASKS_STARTWRITEFROMREG_Msk (0x1UL << SIMIF_TASKS_STARTWRITEFROMREG_TASKS_STARTWRITEFROMREG_Pos) /*!< Bit mask of TASKS_STARTWRITEFROMREG field. */
#define SIMIF_TASKS_STARTWRITEFROMREG_TASKS_STARTWRITEFROMREG_Trigger (1UL) /*!< Trigger task */

/* Register: SIMIF_TASKS_STARTREADTOREG */
/* Description: Read data from Ahb Tx bus to Ahb test reg */

/* Bit 0 : Read data from Ahb Tx bus to Ahb test reg */
#define SIMIF_TASKS_STARTREADTOREG_TASKS_STARTREADTOREG_Pos (0UL) /*!< Position of TASKS_STARTREADTOREG field. */
#define SIMIF_TASKS_STARTREADTOREG_TASKS_STARTREADTOREG_Msk (0x1UL << SIMIF_TASKS_STARTREADTOREG_TASKS_STARTREADTOREG_Pos) /*!< Bit mask of TASKS_STARTREADTOREG field. */
#define SIMIF_TASKS_STARTREADTOREG_TASKS_STARTREADTOREG_Trigger (1UL) /*!< Trigger task */

/* Register: SIMIF_TASKS_PROTOCOLT0SET */
/* Description: Start using protocol T0 */

/* Bit 0 : Start using protocol T0 */
#define SIMIF_TASKS_PROTOCOLT0SET_TASKS_PROTOCOLT0SET_Pos (0UL) /*!< Position of TASKS_PROTOCOLT0SET field. */
#define SIMIF_TASKS_PROTOCOLT0SET_TASKS_PROTOCOLT0SET_Msk (0x1UL << SIMIF_TASKS_PROTOCOLT0SET_TASKS_PROTOCOLT0SET_Pos) /*!< Bit mask of TASKS_PROTOCOLT0SET field. */
#define SIMIF_TASKS_PROTOCOLT0SET_TASKS_PROTOCOLT0SET_Trigger (1UL) /*!< Trigger task */

/* Register: SIMIF_TASKS_PROTOCOLT1SET */
/* Description: Start using protocol T1 */

/* Bit 0 : Start using protocol T1 */
#define SIMIF_TASKS_PROTOCOLT1SET_TASKS_PROTOCOLT1SET_Pos (0UL) /*!< Position of TASKS_PROTOCOLT1SET field. */
#define SIMIF_TASKS_PROTOCOLT1SET_TASKS_PROTOCOLT1SET_Msk (0x1UL << SIMIF_TASKS_PROTOCOLT1SET_TASKS_PROTOCOLT1SET_Pos) /*!< Bit mask of TASKS_PROTOCOLT1SET field. */
#define SIMIF_TASKS_PROTOCOLT1SET_TASKS_PROTOCOLT1SET_Trigger (1UL) /*!< Trigger task */

/* Register: SIMIF_TASKS_PROTOCOLNONSET */
/* Description: Start using protocol none */

/* Bit 0 : Start using protocol none */
#define SIMIF_TASKS_PROTOCOLNONSET_TASKS_PROTOCOLNONSET_Pos (0UL) /*!< Position of TASKS_PROTOCOLNONSET field. */
#define SIMIF_TASKS_PROTOCOLNONSET_TASKS_PROTOCOLNONSET_Msk (0x1UL << SIMIF_TASKS_PROTOCOLNONSET_TASKS_PROTOCOLNONSET_Pos) /*!< Bit mask of TASKS_PROTOCOLNONSET field. */
#define SIMIF_TASKS_PROTOCOLNONSET_TASKS_PROTOCOLNONSET_Trigger (1UL) /*!< Trigger task */

/* Register: SIMIF_TASKS_TIMECOUNTCLEAR */
/* Description: Stop and clear time out counter */

/* Bit 0 : Stop and clear time out counter */
#define SIMIF_TASKS_TIMECOUNTCLEAR_TASKS_TIMECOUNTCLEAR_Pos (0UL) /*!< Position of TASKS_TIMECOUNTCLEAR field. */
#define SIMIF_TASKS_TIMECOUNTCLEAR_TASKS_TIMECOUNTCLEAR_Msk (0x1UL << SIMIF_TASKS_TIMECOUNTCLEAR_TASKS_TIMECOUNTCLEAR_Pos) /*!< Bit mask of TASKS_TIMECOUNTCLEAR field. */
#define SIMIF_TASKS_TIMECOUNTCLEAR_TASKS_TIMECOUNTCLEAR_Trigger (1UL) /*!< Trigger task */

/* Register: SIMIF_EVENTS_DMA_RX_STARTED */
/* Description: DMA Rx  operation started */

/* Bit 0 : DMA Rx  operation started */
#define SIMIF_EVENTS_DMA_RX_STARTED_EVENTS_DMA_RX_STARTED_Pos (0UL) /*!< Position of EVENTS_DMA_RX_STARTED field. */
#define SIMIF_EVENTS_DMA_RX_STARTED_EVENTS_DMA_RX_STARTED_Msk (0x1UL << SIMIF_EVENTS_DMA_RX_STARTED_EVENTS_DMA_RX_STARTED_Pos) /*!< Bit mask of EVENTS_DMA_RX_STARTED field. */
#define SIMIF_EVENTS_DMA_RX_STARTED_EVENTS_DMA_RX_STARTED_NotGenerated (0UL) /*!< Event not generated */
#define SIMIF_EVENTS_DMA_RX_STARTED_EVENTS_DMA_RX_STARTED_Generated (1UL) /*!< Event generated */

/* Register: SIMIF_EVENTS_DMA_RX_DONE */
/* Description: DMA Tx  operation finished */

/* Bit 0 : DMA Tx  operation finished */
#define SIMIF_EVENTS_DMA_RX_DONE_EVENTS_DMA_RX_DONE_Pos (0UL) /*!< Position of EVENTS_DMA_RX_DONE field. */
#define SIMIF_EVENTS_DMA_RX_DONE_EVENTS_DMA_RX_DONE_Msk (0x1UL << SIMIF_EVENTS_DMA_RX_DONE_EVENTS_DMA_RX_DONE_Pos) /*!< Bit mask of EVENTS_DMA_RX_DONE field. */
#define SIMIF_EVENTS_DMA_RX_DONE_EVENTS_DMA_RX_DONE_NotGenerated (0UL) /*!< Event not generated */
#define SIMIF_EVENTS_DMA_RX_DONE_EVENTS_DMA_RX_DONE_Generated (1UL) /*!< Event generated */

/* Register: SIMIF_EVENTS_DMA_TX_STARTED */
/* Description: DMA Tx operation started */

/* Bit 0 : DMA Tx operation started */
#define SIMIF_EVENTS_DMA_TX_STARTED_EVENTS_DMA_TX_STARTED_Pos (0UL) /*!< Position of EVENTS_DMA_TX_STARTED field. */
#define SIMIF_EVENTS_DMA_TX_STARTED_EVENTS_DMA_TX_STARTED_Msk (0x1UL << SIMIF_EVENTS_DMA_TX_STARTED_EVENTS_DMA_TX_STARTED_Pos) /*!< Bit mask of EVENTS_DMA_TX_STARTED field. */
#define SIMIF_EVENTS_DMA_TX_STARTED_EVENTS_DMA_TX_STARTED_NotGenerated (0UL) /*!< Event not generated */
#define SIMIF_EVENTS_DMA_TX_STARTED_EVENTS_DMA_TX_STARTED_Generated (1UL) /*!< Event generated */

/* Register: SIMIF_EVENTS_DMA_TX_DONE */
/* Description: DMA Tx operation finished */

/* Bit 0 : DMA Tx operation finished */
#define SIMIF_EVENTS_DMA_TX_DONE_EVENTS_DMA_TX_DONE_Pos (0UL) /*!< Position of EVENTS_DMA_TX_DONE field. */
#define SIMIF_EVENTS_DMA_TX_DONE_EVENTS_DMA_TX_DONE_Msk (0x1UL << SIMIF_EVENTS_DMA_TX_DONE_EVENTS_DMA_TX_DONE_Pos) /*!< Bit mask of EVENTS_DMA_TX_DONE field. */
#define SIMIF_EVENTS_DMA_TX_DONE_EVENTS_DMA_TX_DONE_NotGenerated (0UL) /*!< Event not generated */
#define SIMIF_EVENTS_DMA_TX_DONE_EVENTS_DMA_TX_DONE_Generated (1UL) /*!< Event generated */

/* Register: SIMIF_EVENTS_INVALID_CONVENTION */
/* Description: ATR.TS convention not recognized */

/* Bit 0 : ATR.TS convention not recognized */
#define SIMIF_EVENTS_INVALID_CONVENTION_EVENTS_INVALID_CONVENTION_Pos (0UL) /*!< Position of EVENTS_INVALID_CONVENTION field. */
#define SIMIF_EVENTS_INVALID_CONVENTION_EVENTS_INVALID_CONVENTION_Msk (0x1UL << SIMIF_EVENTS_INVALID_CONVENTION_EVENTS_INVALID_CONVENTION_Pos) /*!< Bit mask of EVENTS_INVALID_CONVENTION field. */
#define SIMIF_EVENTS_INVALID_CONVENTION_EVENTS_INVALID_CONVENTION_NotGenerated (0UL) /*!< Event not generated */
#define SIMIF_EVENTS_INVALID_CONVENTION_EVENTS_INVALID_CONVENTION_Generated (1UL) /*!< Event generated */

