adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem_bitfields.h
/* Register: SIMIF_INTPEND */
/* Description: Pending interrupts */

/* Bit 24 : Read pending status of interrupt for event T1_RX_FRAME_END */
#define SIMIF_INTPEND_T1_RX_FRAME_END_Pos (24UL) /*!< Position of T1_RX_FRAME_END field. */
#define SIMIF_INTPEND_T1_RX_FRAME_END_Msk (0x1UL << SIMIF_INTPEND_T1_RX_FRAME_END_Pos) /*!< Bit mask of T1_RX_FRAME_END field. */
#define SIMIF_INTPEND_T1_RX_FRAME_END_NotPending (0UL) /*!< Read: Not pending */
#define SIMIF_INTPEND_T1_RX_FRAME_END_Pending (1UL) /*!< Read: Pending */

/* Bit 23 : Read pending status of interrupt for event T1_RX_MORE */
#define SIMIF_INTPEND_T1_RX_MORE_Pos (23UL) /*!< Position of T1_RX_MORE field. */
#define SIMIF_INTPEND_T1_RX_MORE_Msk (0x1UL << SIMIF_INTPEND_T1_RX_MORE_Pos) /*!< Bit mask of T1_RX_MORE field. */
#define SIMIF_INTPEND_T1_RX_MORE_NotPending (0UL) /*!< Read: Not pending */
#define SIMIF_INTPEND_T1_RX_MORE_Pending (1UL) /*!< Read: Pending */

/* Bit 22 : Read pending status of interrupt for event ERROR_COUNT_MAX */
#define SIMIF_INTPEND_ERROR_COUNT_MAX_Pos (22UL) /*!< Position of ERROR_COUNT_MAX field. */
#define SIMIF_INTPEND_ERROR_COUNT_MAX_Msk (0x1UL << SIMIF_INTPEND_ERROR_COUNT_MAX_Pos) /*!< Bit mask of ERROR_COUNT_MAX field. */
#define SIMIF_INTPEND_ERROR_COUNT_MAX_NotPending (0UL) /*!< Read: Not pending */
#define SIMIF_INTPEND_ERROR_COUNT_MAX_Pending (1UL) /*!< Read: Pending */

/* Bit 21 : Read pending status of interrupt for event NAD_ERROR */
#define SIMIF_INTPEND_NAD_ERROR_Pos (21UL) /*!< Position of NAD_ERROR field. */
#define SIMIF_INTPEND_NAD_ERROR_Msk (0x1UL << SIMIF_INTPEND_NAD_ERROR_Pos) /*!< Bit mask of NAD_ERROR field. */
#define SIMIF_INTPEND_NAD_ERROR_NotPending (0UL) /*!< Read: Not pending */
#define SIMIF_INTPEND_NAD_ERROR_Pending (1UL) /*!< Read: Pending */

/* Bit 20 : Read pending status of interrupt for event EDC_ERROR */
#define SIMIF_INTPEND_EDC_ERROR_Pos (20UL) /*!< Position of EDC_ERROR field. */
#define SIMIF_INTPEND_EDC_ERROR_Msk (0x1UL << SIMIF_INTPEND_EDC_ERROR_Pos) /*!< Bit mask of EDC_ERROR field. */
#define SIMIF_INTPEND_EDC_ERROR_NotPending (0UL) /*!< Read: Not pending */
#define SIMIF_INTPEND_EDC_ERROR_Pending (1UL) /*!< Read: Pending */

/* Bit 19 : Read pending status of interrupt for event T1_LEN_ERROR */
#define SIMIF_INTPEND_T1_LEN_ERROR_Pos (19UL) /*!< Position of T1_LEN_ERROR field. */
#define SIMIF_INTPEND_T1_LEN_ERROR_Msk (0x1UL << SIMIF_INTPEND_T1_LEN_ERROR_Pos) /*!< Bit mask of T1_LEN_ERROR field. */
#define SIMIF_INTPEND_T1_LEN_ERROR_NotPending (0UL) /*!< Read: Not pending */
#define SIMIF_INTPEND_T1_LEN_ERROR_Pending (1UL) /*!< Read: Pending */

/* Bit 18 : Read pending status of interrupt for event T1_NON_I_BLOCK */
#define SIMIF_INTPEND_T1_NON_I_BLOCK_Pos (18UL) /*!< Position of T1_NON_I_BLOCK field. */
#define SIMIF_INTPEND_T1_NON_I_BLOCK_Msk (0x1UL << SIMIF_INTPEND_T1_NON_I_BLOCK_Pos) /*!< Bit mask of T1_NON_I_BLOCK field. */
#define SIMIF_INTPEND_T1_NON_I_BLOCK_NotPending (0UL) /*!< Read: Not pending */
#define SIMIF_INTPEND_T1_NON_I_BLOCK_Pending (1UL) /*!< Read: Pending */

/* Bit 17 : Read pending status of interrupt for event T1_TX_ABORTED */
#define SIMIF_INTPEND_T1_TX_ABORTED_Pos (17UL) /*!< Position of T1_TX_ABORTED field. */
#define SIMIF_INTPEND_T1_TX_ABORTED_Msk (0x1UL << SIMIF_INTPEND_T1_TX_ABORTED_Pos) /*!< Bit mask of T1_TX_ABORTED field. */
#define SIMIF_INTPEND_T1_TX_ABORTED_NotPending (0UL) /*!< Read: Not pending */
#define SIMIF_INTPEND_T1_TX_ABORTED_Pending (1UL) /*!< Read: Pending */

/* Bit 16 : Read pending status of interrupt for event T1_RX_OVERRUN */
#define SIMIF_INTPEND_T1_RX_OVERRUN_Pos (16UL) /*!< Position of T1_RX_OVERRUN field. */
#define SIMIF_INTPEND_T1_RX_OVERRUN_Msk (0x1UL << SIMIF_INTPEND_T1_RX_OVERRUN_Pos) /*!< Bit mask of T1_RX_OVERRUN field. */
#define SIMIF_INTPEND_T1_RX_OVERRUN_NotPending (0UL) /*!< Read: Not pending */
#define SIMIF_INTPEND_T1_RX_OVERRUN_Pending (1UL) /*!< Read: Pending */

/* Bit 15 : Read pending status of interrupt for event RX_DATA_READY */
#define SIMIF_INTPEND_RX_DATA_READY_Pos (15UL) /*!< Position of RX_DATA_READY field. */
#define SIMIF_INTPEND_RX_DATA_READY_Msk (0x1UL << SIMIF_INTPEND_RX_DATA_READY_Pos) /*!< Bit mask of RX_DATA_READY field. */
#define SIMIF_INTPEND_RX_DATA_READY_NotPending (0UL) /*!< Read: Not pending */
#define SIMIF_INTPEND_RX_DATA_READY_Pending (1UL) /*!< Read: Pending */

/* Bit 14 : Read pending status of interrupt for event READY_TX */
#define SIMIF_INTPEND_READY_TX_Pos (14UL) /*!< Position of READY_TX field. */
#define SIMIF_INTPEND_READY_TX_Msk (0x1UL << SIMIF_INTPEND_READY_TX_Pos) /*!< Bit mask of READY_TX field. */
#define SIMIF_INTPEND_READY_TX_NotPending (0UL) /*!< Read: Not pending */
#define SIMIF_INTPEND_READY_TX_Pending (1UL) /*!< Read: Pending */

/* Bit 13 : Read pending status of interrupt for event ERROR */
#define SIMIF_INTPEND_ERROR_Pos (13UL) /*!< Position of ERROR field. */
#define SIMIF_INTPEND_ERROR_Msk (0x1UL << SIMIF_INTPEND_ERROR_Pos) /*!< Bit mask of ERROR field. */
#define SIMIF_INTPEND_ERROR_NotPending (0UL) /*!< Read: Not pending */
#define SIMIF_INTPEND_ERROR_Pending (1UL) /*!< Read: Pending */

/* Bit 12 : Read pending status of interrupt for event NINS */
#define SIMIF_INTPEND_NINS_Pos (12UL) /*!< Position of NINS field. */
#define SIMIF_INTPEND_NINS_Msk (0x1UL << SIMIF_INTPEND_NINS_Pos) /*!< Bit mask of NINS field. */
#define SIMIF_INTPEND_NINS_NotPending (0UL) /*!< Read: Not pending */
#define SIMIF_INTPEND_NINS_Pending (1UL) /*!< Read: Pending */

/* Bit 11 : Read pending status of interrupt for event INS */
#define SIMIF_INTPEND_INS_Pos (11UL) /*!< Position of INS field. */
#define SIMIF_INTPEND_INS_Msk (0x1UL << SIMIF_INTPEND_INS_Pos) /*!< Bit mask of INS field. */
#define SIMIF_INTPEND_INS_NotPending (0UL) /*!< Read: Not pending */
#define SIMIF_INTPEND_INS_Pending (1UL) /*!< Read: Pending */

/* Bit 10 : Read pending status of interrupt for event RESET */
#define SIMIF_INTPEND_RESET_Pos (10UL) /*!< Position of RESET field. */
#define SIMIF_INTPEND_RESET_Msk (0x1UL << SIMIF_INTPEND_RESET_Pos) /*!< Bit mask of RESET field. */
#define SIMIF_INTPEND_RESET_NotPending (0UL) /*!< Read: Not pending */
#define SIMIF_INTPEND_RESET_Pending (1UL) /*!< Read: Pending */

