adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem_bitfields.h
/* Bit 0 : MAC calculated */
#define SNOW_EVENTS_MACREADY_EVENTS_MACREADY_Pos (0UL) /*!< Position of EVENTS_MACREADY field. */
#define SNOW_EVENTS_MACREADY_EVENTS_MACREADY_Msk (0x1UL << SNOW_EVENTS_MACREADY_EVENTS_MACREADY_Pos) /*!< Bit mask of EVENTS_MACREADY field. */
#define SNOW_EVENTS_MACREADY_EVENTS_MACREADY_NotGenerated (0UL) /*!< Event not generated */
#define SNOW_EVENTS_MACREADY_EVENTS_MACREADY_Generated (1UL) /*!< Event generated */

/* Register: SNOW_EVENTS_RESETTED */
/* Description: Resetted (all transfers and crypto operations stopped) */

/* Bit 0 : Resetted (all transfers and crypto operations stopped) */
#define SNOW_EVENTS_RESETTED_EVENTS_RESETTED_Pos (0UL) /*!< Position of EVENTS_RESETTED field. */
#define SNOW_EVENTS_RESETTED_EVENTS_RESETTED_Msk (0x1UL << SNOW_EVENTS_RESETTED_EVENTS_RESETTED_Pos) /*!< Bit mask of EVENTS_RESETTED field. */
#define SNOW_EVENTS_RESETTED_EVENTS_RESETTED_NotGenerated (0UL) /*!< Event not generated */
#define SNOW_EVENTS_RESETTED_EVENTS_RESETTED_Generated (1UL) /*!< Event generated */

/* Register: SNOW_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 6 : Shortcut between event MACREADY and task RESET */
#define SNOW_SHORTS_MACREADY_RESET_Pos (6UL) /*!< Position of MACREADY_RESET field. */
#define SNOW_SHORTS_MACREADY_RESET_Msk (0x1UL << SNOW_SHORTS_MACREADY_RESET_Pos) /*!< Bit mask of MACREADY_RESET field. */
#define SNOW_SHORTS_MACREADY_RESET_Disabled (0UL) /*!< Disable shortcut */
#define SNOW_SHORTS_MACREADY_RESET_Enabled (1UL) /*!< Enable shortcut */

/* Bit 5 : Shortcut between event SCATTERDONE and task RESET */
#define SNOW_SHORTS_SCATTERDONE_RESET_Pos (5UL) /*!< Position of SCATTERDONE_RESET field. */
#define SNOW_SHORTS_SCATTERDONE_RESET_Msk (0x1UL << SNOW_SHORTS_SCATTERDONE_RESET_Pos) /*!< Bit mask of SCATTERDONE_RESET field. */
#define SNOW_SHORTS_SCATTERDONE_RESET_Disabled (0UL) /*!< Disable shortcut */
#define SNOW_SHORTS_SCATTERDONE_RESET_Enabled (1UL) /*!< Enable shortcut */

/* Bit 4 : Shortcut between event SNOW3GINITIALIZED and task STARTGATHER */
#define SNOW_SHORTS_SNOW3GINITIALIZED_STARTGATHER_Pos (4UL) /*!< Position of SNOW3GINITIALIZED_STARTGATHER field. */
#define SNOW_SHORTS_SNOW3GINITIALIZED_STARTGATHER_Msk (0x1UL << SNOW_SHORTS_SNOW3GINITIALIZED_STARTGATHER_Pos) /*!< Bit mask of SNOW3GINITIALIZED_STARTGATHER field. */
#define SNOW_SHORTS_SNOW3GINITIALIZED_STARTGATHER_Disabled (0UL) /*!< Disable shortcut */
#define SNOW_SHORTS_SNOW3GINITIALIZED_STARTGATHER_Enabled (1UL) /*!< Enable shortcut */

/* Bit 3 : Shortcut between event MESSAGEREADY and task FINALIZEMAC */
#define SNOW_SHORTS_MESSAGEREADY_FINALIZEMAC_Pos (3UL) /*!< Position of MESSAGEREADY_FINALIZEMAC field. */
#define SNOW_SHORTS_MESSAGEREADY_FINALIZEMAC_Msk (0x1UL << SNOW_SHORTS_MESSAGEREADY_FINALIZEMAC_Pos) /*!< Bit mask of MESSAGEREADY_FINALIZEMAC field. */
#define SNOW_SHORTS_MESSAGEREADY_FINALIZEMAC_Disabled (0UL) /*!< Disable shortcut */
#define SNOW_SHORTS_MESSAGEREADY_FINALIZEMAC_Enabled (1UL) /*!< Enable shortcut */

/* Bit 2 : Shortcut between event SNOW3GINITIALIZED and task STARTOPERATION */
#define SNOW_SHORTS_SNOW3GINITIALIZED_STARTOPERATION_Pos (2UL) /*!< Position of SNOW3GINITIALIZED_STARTOPERATION field. */
#define SNOW_SHORTS_SNOW3GINITIALIZED_STARTOPERATION_Msk (0x1UL << SNOW_SHORTS_SNOW3GINITIALIZED_STARTOPERATION_Pos) /*!< Bit mask of SNOW3GINITIALIZED_STARTOPERATION field. */
#define SNOW_SHORTS_SNOW3GINITIALIZED_STARTOPERATION_Disabled (0UL) /*!< Disable shortcut */
#define SNOW_SHORTS_SNOW3GINITIALIZED_STARTOPERATION_Enabled (1UL) /*!< Enable shortcut */

/* Bit 1 : Shortcut between event IVREADY and task INITIALIZESNOW3G */
#define SNOW_SHORTS_IVREADY_INITIALIZESNOW3G_Pos (1UL) /*!< Position of IVREADY_INITIALIZESNOW3G field. */
#define SNOW_SHORTS_IVREADY_INITIALIZESNOW3G_Msk (0x1UL << SNOW_SHORTS_IVREADY_INITIALIZESNOW3G_Pos) /*!< Bit mask of IVREADY_INITIALIZESNOW3G field. */
#define SNOW_SHORTS_IVREADY_INITIALIZESNOW3G_Disabled (0UL) /*!< Disable shortcut */
#define SNOW_SHORTS_IVREADY_INITIALIZESNOW3G_Enabled (1UL) /*!< Enable shortcut */

/* Bit 0 : Shortcut between event GATHERSTARTED and task STARTSCATTER */
#define SNOW_SHORTS_GATHERSTARTED_STARTSCATTER_Pos (0UL) /*!< Position of GATHERSTARTED_STARTSCATTER field. */
#define SNOW_SHORTS_GATHERSTARTED_STARTSCATTER_Msk (0x1UL << SNOW_SHORTS_GATHERSTARTED_STARTSCATTER_Pos) /*!< Bit mask of GATHERSTARTED_STARTSCATTER field. */
#define SNOW_SHORTS_GATHERSTARTED_STARTSCATTER_Disabled (0UL) /*!< Disable shortcut */
#define SNOW_SHORTS_GATHERSTARTED_STARTSCATTER_Enabled (1UL) /*!< Enable shortcut */

/* Register: SNOW_INTPEND */
/* Description: Pending interrupts */

/* Bit 8 : Read pending status of interrupt for event RESETTED */
#define SNOW_INTPEND_RESETTED_Pos (8UL) /*!< Position of RESETTED field. */
#define SNOW_INTPEND_RESETTED_Msk (0x1UL << SNOW_INTPEND_RESETTED_Pos) /*!< Bit mask of RESETTED field. */
#define SNOW_INTPEND_RESETTED_NotPending (0UL) /*!< Read: Not pending */
#define SNOW_INTPEND_RESETTED_Pending (1UL) /*!< Read: Pending */

/* Bit 7 : Read pending status of interrupt for event MACREADY */
#define SNOW_INTPEND_MACREADY_Pos (7UL) /*!< Position of MACREADY field. */
#define SNOW_INTPEND_MACREADY_Msk (0x1UL << SNOW_INTPEND_MACREADY_Pos) /*!< Bit mask of MACREADY field. */
#define SNOW_INTPEND_MACREADY_NotPending (0UL) /*!< Read: Not pending */
#define SNOW_INTPEND_MACREADY_Pending (1UL) /*!< Read: Pending */

/* Bit 6 : Read pending status of interrupt for event MESSAGEREADY */
#define SNOW_INTPEND_MESSAGEREADY_Pos (6UL) /*!< Position of MESSAGEREADY field. */
#define SNOW_INTPEND_MESSAGEREADY_Msk (0x1UL << SNOW_INTPEND_MESSAGEREADY_Pos) /*!< Bit mask of MESSAGEREADY field. */
#define SNOW_INTPEND_MESSAGEREADY_NotPending (0UL) /*!< Read: Not pending */
#define SNOW_INTPEND_MESSAGEREADY_Pending (1UL) /*!< Read: Pending */

/* Bit 5 : Read pending status of interrupt for event SNOW3GINITIALIZED */
#define SNOW_INTPEND_SNOW3GINITIALIZED_Pos (5UL) /*!< Position of SNOW3GINITIALIZED field. */
#define SNOW_INTPEND_SNOW3GINITIALIZED_Msk (0x1UL << SNOW_INTPEND_SNOW3GINITIALIZED_Pos) /*!< Bit mask of SNOW3GINITIALIZED field. */
#define SNOW_INTPEND_SNOW3GINITIALIZED_NotPending (0UL) /*!< Read: Not pending */
#define SNOW_INTPEND_SNOW3GINITIALIZED_Pending (1UL) /*!< Read: Pending */

/* Bit 4 : Read pending status of interrupt for event IVREADY */
#define SNOW_INTPEND_IVREADY_Pos (4UL) /*!< Position of IVREADY field. */
#define SNOW_INTPEND_IVREADY_Msk (0x1UL << SNOW_INTPEND_IVREADY_Pos) /*!< Bit mask of IVREADY field. */
#define SNOW_INTPEND_IVREADY_NotPending (0UL) /*!< Read: Not pending */
#define SNOW_INTPEND_IVREADY_Pending (1UL) /*!< Read: Pending */

