adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem_bitfields.h
/* Bit 3 : Read pending status of interrupt for event SCATTERDONE */
#define SNOW_INTPEND_SCATTERDONE_Pos (3UL) /*!< Position of SCATTERDONE field. */
#define SNOW_INTPEND_SCATTERDONE_Msk (0x1UL << SNOW_INTPEND_SCATTERDONE_Pos) /*!< Bit mask of SCATTERDONE field. */
#define SNOW_INTPEND_SCATTERDONE_NotPending (0UL) /*!< Read: Not pending */
#define SNOW_INTPEND_SCATTERDONE_Pending (1UL) /*!< Read: Pending */

/* Bit 2 : Read pending status of interrupt for event SCATTERSTARTED */
#define SNOW_INTPEND_SCATTERSTARTED_Pos (2UL) /*!< Position of SCATTERSTARTED field. */
#define SNOW_INTPEND_SCATTERSTARTED_Msk (0x1UL << SNOW_INTPEND_SCATTERSTARTED_Pos) /*!< Bit mask of SCATTERSTARTED field. */
#define SNOW_INTPEND_SCATTERSTARTED_NotPending (0UL) /*!< Read: Not pending */
#define SNOW_INTPEND_SCATTERSTARTED_Pending (1UL) /*!< Read: Pending */

/* Bit 1 : Read pending status of interrupt for event GATHERDONE */
#define SNOW_INTPEND_GATHERDONE_Pos (1UL) /*!< Position of GATHERDONE field. */
#define SNOW_INTPEND_GATHERDONE_Msk (0x1UL << SNOW_INTPEND_GATHERDONE_Pos) /*!< Bit mask of GATHERDONE field. */
#define SNOW_INTPEND_GATHERDONE_NotPending (0UL) /*!< Read: Not pending */
#define SNOW_INTPEND_GATHERDONE_Pending (1UL) /*!< Read: Pending */

/* Bit 0 : Read pending status of interrupt for event GATHERSTARTED */
#define SNOW_INTPEND_GATHERSTARTED_Pos (0UL) /*!< Position of GATHERSTARTED field. */
#define SNOW_INTPEND_GATHERSTARTED_Msk (0x1UL << SNOW_INTPEND_GATHERSTARTED_Pos) /*!< Bit mask of GATHERSTARTED field. */
#define SNOW_INTPEND_GATHERSTARTED_NotPending (0UL) /*!< Read: Not pending */
#define SNOW_INTPEND_GATHERSTARTED_Pending (1UL) /*!< Read: Pending */

/* Register: SNOW_LENGTH */
/* Description: Keystream length in bits (Cipher), message length in bits (MAC) */

/* Bits 31..0 : Stream/message length */
#define SNOW_LENGTH_LENGTH_Pos (0UL) /*!< Position of LENGTH field. */
#define SNOW_LENGTH_LENGTH_Msk (0xFFFFFFFFUL << SNOW_LENGTH_LENGTH_Pos) /*!< Bit mask of LENGTH field. */

/* Register: SNOW_MODE */
/* Description: Mode select */

/* Bit 0 : Mode select. */
#define SNOW_MODE_MODE_Pos (0UL) /*!< Position of MODE field. */
#define SNOW_MODE_MODE_Msk (0x1UL << SNOW_MODE_MODE_Pos) /*!< Bit mask of MODE field. */
#define SNOW_MODE_MODE_CIPHER (0UL) /*!< Data cipher mode */
#define SNOW_MODE_MODE_MAC (1UL) /*!< MAC mode. */

/* Register: SNOW_MAC */
/* Description: Message Authentication Code. */

/* Bits 31..0 : Calculated MAC. */
#define SNOW_MAC_MAC_Pos (0UL) /*!< Position of MAC field. */
#define SNOW_MAC_MAC_Msk (0xFFFFFFFFUL << SNOW_MAC_MAC_Pos) /*!< Bit mask of MAC field. */

/* Register: SNOW_INJOBPTR */
/* Description: Input job pointer */

/* Bits 31..0 : Input job pointer */
#define SNOW_INJOBPTR_INJOBPTR_Pos (0UL) /*!< Position of INJOBPTR field. */
#define SNOW_INJOBPTR_INJOBPTR_Msk (0xFFFFFFFFUL << SNOW_INJOBPTR_INJOBPTR_Pos) /*!< Bit mask of INJOBPTR field. */

/* Register: SNOW_OUTJOBPTR */
/* Description: Output job pointer */

/* Bits 31..0 : Output job pointer */
#define SNOW_OUTJOBPTR_OUTJOBPTR_Pos (0UL) /*!< Position of OUTJOBPTR field. */
#define SNOW_OUTJOBPTR_OUTJOBPTR_Msk (0xFFFFFFFFUL << SNOW_OUTJOBPTR_OUTJOBPTR_Pos) /*!< Bit mask of OUTJOBPTR field. */


/* Peripheral: TEMP */
/* Description: Temperature Sensor */

/* Register: TEMP_TASKS_START */
/* Description: Start temperature measurement */

/* Bit 0 : Start temperature measurement */
#define TEMP_TASKS_START_TASKS_START_Pos (0UL) /*!< Position of TASKS_START field. */
#define TEMP_TASKS_START_TASKS_START_Msk (0x1UL << TEMP_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field. */
#define TEMP_TASKS_START_TASKS_START_Trigger (1UL) /*!< Trigger task */

/* Register: TEMP_TASKS_STOP */
/* Description: Stop temperature measurement */

/* Bit 0 : Stop temperature measurement */
#define TEMP_TASKS_STOP_TASKS_STOP_Pos (0UL) /*!< Position of TASKS_STOP field. */
#define TEMP_TASKS_STOP_TASKS_STOP_Msk (0x1UL << TEMP_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field. */
#define TEMP_TASKS_STOP_TASKS_STOP_Trigger (1UL) /*!< Trigger task */

/* Register: TEMP_EVENTS_DATARDY */
/* Description: Temperature measurement complete, data ready */

/* Bit 0 : Temperature measurement complete, data ready */
#define TEMP_EVENTS_DATARDY_EVENTS_DATARDY_Pos (0UL) /*!< Position of EVENTS_DATARDY field. */
#define TEMP_EVENTS_DATARDY_EVENTS_DATARDY_Msk (0x1UL << TEMP_EVENTS_DATARDY_EVENTS_DATARDY_Pos) /*!< Bit mask of EVENTS_DATARDY field. */
#define TEMP_EVENTS_DATARDY_EVENTS_DATARDY_NotGenerated (0UL) /*!< Event not generated */
#define TEMP_EVENTS_DATARDY_EVENTS_DATARDY_Generated (1UL) /*!< Event generated */

/* Register: TEMP_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 0 : Enable or disable interrupt for event DATARDY */
#define TEMP_INTEN_DATARDY_Pos (0UL) /*!< Position of DATARDY field. */
#define TEMP_INTEN_DATARDY_Msk (0x1UL << TEMP_INTEN_DATARDY_Pos) /*!< Bit mask of DATARDY field. */
#define TEMP_INTEN_DATARDY_Disabled (0UL) /*!< Disable */
#define TEMP_INTEN_DATARDY_Enabled (1UL) /*!< Enable */

/* Register: TEMP_INTENSET */
/* Description: Enable interrupt */

/* Bit 0 : Write '1' to enable interrupt for event DATARDY */
#define TEMP_INTENSET_DATARDY_Pos (0UL) /*!< Position of DATARDY field. */
#define TEMP_INTENSET_DATARDY_Msk (0x1UL << TEMP_INTENSET_DATARDY_Pos) /*!< Bit mask of DATARDY field. */
#define TEMP_INTENSET_DATARDY_Disabled (0UL) /*!< Read: Disabled */
#define TEMP_INTENSET_DATARDY_Enabled (1UL) /*!< Read: Enabled */
#define TEMP_INTENSET_DATARDY_Set (1UL) /*!< Enable */

/* Register: TEMP_INTENCLR */
/* Description: Disable interrupt */

/* Bit 0 : Write '1' to disable interrupt for event DATARDY */
#define TEMP_INTENCLR_DATARDY_Pos (0UL) /*!< Position of DATARDY field. */
#define TEMP_INTENCLR_DATARDY_Msk (0x1UL << TEMP_INTENCLR_DATARDY_Pos) /*!< Bit mask of DATARDY field. */
#define TEMP_INTENCLR_DATARDY_Disabled (0UL) /*!< Read: Disabled */
#define TEMP_INTENCLR_DATARDY_Enabled (1UL) /*!< Read: Enabled */
#define TEMP_INTENCLR_DATARDY_Clear (1UL) /*!< Disable */

