adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem_bitfields.h
/* Register: TEMP_ENABLE */
/* Description: Enable temperature sensor bias current */

/* Bit 0 : Enable temperature sensor bias current */
#define TEMP_ENABLE_ENABLE_Pos (0UL) /*!< Position of ENABLE field. */
#define TEMP_ENABLE_ENABLE_Msk (0x1UL << TEMP_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field. */
#define TEMP_ENABLE_ENABLE_Disabled (0UL) /*!< Bias is disabled */
#define TEMP_ENABLE_ENABLE_Enabled (1UL) /*!< Bias is enabled */

/* Register: TEMP_TEMP */
/* Description: Temperature in degC (0.25deg steps) */

/* Bits 31..0 : Temperature in degC (0.25deg steps) */
#define TEMP_TEMP_TEMP_Pos (0UL) /*!< Position of TEMP field. */
#define TEMP_TEMP_TEMP_Msk (0xFFFFFFFFUL << TEMP_TEMP_TEMP_Pos) /*!< Bit mask of TEMP field. */

/* Register: TEMP_DATA */
/* Description: Data after dec and calib */

/* Bits 12..0 : Data after dec and calib */
#define TEMP_DATA_DATA_Pos (0UL) /*!< Position of DATA field. */
#define TEMP_DATA_DATA_Msk (0x1FFFUL << TEMP_DATA_DATA_Pos) /*!< Bit mask of DATA field. */

/* Register: TEMP_CALIB */
/* Description: Calibration value. Reset value is taken from FICR-&gt;CHIPCONF01 bit 31:22 */

/* Bits 9..0 : TBD */
#define TEMP_CALIB_CALIB_Pos (0UL) /*!< Position of CALIB field. */
#define TEMP_CALIB_CALIB_Msk (0x3FFUL << TEMP_CALIB_CALIB_Pos) /*!< Bit mask of CALIB field. */

/* Register: TEMP_A1 */
/* Description: Slope of 1st piece wise linear function */

/* Bits 11..0 : Slope of 1st piece wise linear function */
#define TEMP_A1_A0_Pos (0UL) /*!< Position of A0 field. */
#define TEMP_A1_A0_Msk (0xFFFUL << TEMP_A1_A0_Pos) /*!< Bit mask of A0 field. */

/* Register: TEMP_A2 */
/* Description: Slope of 2nd piece wise linear function */

/* Bits 11..0 : Slope of 2nd piece wise linear function */
#define TEMP_A2_A1_Pos (0UL) /*!< Position of A1 field. */
#define TEMP_A2_A1_Msk (0xFFFUL << TEMP_A2_A1_Pos) /*!< Bit mask of A1 field. */

/* Register: TEMP_A3 */
/* Description: Slope of 3rd piece wise linear function */

/* Bits 11..0 : Slope of 3rd piece wise linear function */
#define TEMP_A3_A2_Pos (0UL) /*!< Position of A2 field. */
#define TEMP_A3_A2_Msk (0xFFFUL << TEMP_A3_A2_Pos) /*!< Bit mask of A2 field. */

/* Register: TEMP_A4 */
/* Description: Slope of 4th piece wise linear function */

/* Bits 11..0 : Slope of 4th piece wise linear function */
#define TEMP_A4_A3_Pos (0UL) /*!< Position of A3 field. */
#define TEMP_A4_A3_Msk (0xFFFUL << TEMP_A4_A3_Pos) /*!< Bit mask of A3 field. */

/* Register: TEMP_A5 */
/* Description: Slope of 5th piece wise linear function */

/* Bits 11..0 : Slope of 5th piece wise linear function */
#define TEMP_A5_A4_Pos (0UL) /*!< Position of A4 field. */
#define TEMP_A5_A4_Msk (0xFFFUL << TEMP_A5_A4_Pos) /*!< Bit mask of A4 field. */

/* Register: TEMP_A6 */
/* Description: Slope of 6th piece wise linear function */

/* Bits 11..0 : Slope of 6th piece wise linear function */
#define TEMP_A6_A5_Pos (0UL) /*!< Position of A5 field. */
#define TEMP_A6_A5_Msk (0xFFFUL << TEMP_A6_A5_Pos) /*!< Bit mask of A5 field. */

/* Register: TEMP_B1 */
/* Description: y-intercept of 1st piece wise linear function */

/* Bits 13..0 : y-intercept of 1st piece wise linear function */
#define TEMP_B1_B0_Pos (0UL) /*!< Position of B0 field. */
#define TEMP_B1_B0_Msk (0x3FFFUL << TEMP_B1_B0_Pos) /*!< Bit mask of B0 field. */

/* Register: TEMP_B2 */
/* Description: y-intercept of 2nd piece wise linear function */

/* Bits 13..0 : y-intercept of 2nd piece wise linear function */
#define TEMP_B2_B1_Pos (0UL) /*!< Position of B1 field. */
#define TEMP_B2_B1_Msk (0x3FFFUL << TEMP_B2_B1_Pos) /*!< Bit mask of B1 field. */

/* Register: TEMP_B3 */
/* Description: y-intercept of 3rd piece wise linear function */

/* Bits 13..0 : y-intercept of 3rd piece wise linear function */
#define TEMP_B3_B2_Pos (0UL) /*!< Position of B2 field. */
#define TEMP_B3_B2_Msk (0x3FFFUL << TEMP_B3_B2_Pos) /*!< Bit mask of B2 field. */

/* Register: TEMP_B4 */
/* Description: y-intercept of 4th piece wise linear function */

/* Bits 13..0 : y-intercept of 4th piece wise linear function */
#define TEMP_B4_B3_Pos (0UL) /*!< Position of B3 field. */
#define TEMP_B4_B3_Msk (0x3FFFUL << TEMP_B4_B3_Pos) /*!< Bit mask of B3 field. */

/* Register: TEMP_B5 */
/* Description: y-intercept of 5th piece wise linear function */

/* Bits 13..0 : y-intercept of 5th piece wise linear function */
#define TEMP_B5_B4_Pos (0UL) /*!< Position of B4 field. */
#define TEMP_B5_B4_Msk (0x3FFFUL << TEMP_B5_B4_Pos) /*!< Bit mask of B4 field. */

/* Register: TEMP_B6 */
/* Description: y-intercept of 6th piece wise linear function */

/* Bits 13..0 : y-intercept of 6th piece wise linear function */
#define TEMP_B6_B5_Pos (0UL) /*!< Position of B5 field. */
#define TEMP_B6_B5_Msk (0x3FFFUL << TEMP_B6_B5_Pos) /*!< Bit mask of B5 field. */

/* Register: TEMP_T1 */
/* Description: End point of 1st piece wise linear function */

/* Bits 7..0 : End point of 1st piece wise linear function */
#define TEMP_T1_T0_Pos (0UL) /*!< Position of T0 field. */
#define TEMP_T1_T0_Msk (0xFFUL << TEMP_T1_T0_Pos) /*!< Bit mask of T0 field. */

/* Register: TEMP_T2 */
/* Description: End point of 2nd piece wise linear function */

/* Bits 7..0 : End point of 2nd piece wise linear function */
#define TEMP_T2_T1_Pos (0UL) /*!< Position of T1 field. */
#define TEMP_T2_T1_Msk (0xFFUL << TEMP_T2_T1_Pos) /*!< Bit mask of T1 field. */

/* Register: TEMP_T3 */
/* Description: End point of 3rd piece wise linear function */

/* Bits 7..0 : End point of 3rd piece wise linear function */
#define TEMP_T3_T2_Pos (0UL) /*!< Position of T2 field. */
#define TEMP_T3_T2_Msk (0xFFUL << TEMP_T3_T2_Pos) /*!< Bit mask of T2 field. */

/* Register: TEMP_T4 */
/* Description: End point of 4th piece wise linear function */

/* Bits 7..0 : End point of 4th piece wise linear function */
#define TEMP_T4_T3_Pos (0UL) /*!< Position of T3 field. */
#define TEMP_T4_T3_Msk (0xFFUL << TEMP_T4_T3_Pos) /*!< Bit mask of T3 field. */

/* Register: TEMP_T5 */
/* Description: End point of 5th piece wise linear function */

/* Bits 7..0 : End point of 5th piece wise linear function */
#define TEMP_T5_T4_Pos (0UL) /*!< Position of T4 field. */
#define TEMP_T5_T4_Msk (0xFFUL << TEMP_T5_T4_Pos) /*!< Bit mask of T4 field. */


/* Peripheral: TIMEMARKMUX */
/* Description: Timemark multiplexer for LTE System Timer */

/* Register: TIMEMARKMUX_ENABLE */
/* Description: Enable Timemark Mux */

/* Bit 1 : Enable */
#define TIMEMARKMUX_ENABLE_ENABLE_TMGNSS_Pos (1UL) /*!< Position of ENABLE_TMGNSS field. */
#define TIMEMARKMUX_ENABLE_ENABLE_TMGNSS_Msk (0x1UL << TIMEMARKMUX_ENABLE_ENABLE_TMGNSS_Pos) /*!< Bit mask of ENABLE_TMGNSS field. */
#define TIMEMARKMUX_ENABLE_ENABLE_TMGNSS_Disable (0UL) /*!< Disable GNSS timemark output */
#define TIMEMARKMUX_ENABLE_ENABLE_TMGNSS_Enable (1UL) /*!< Enable GNSS timemark output */

