adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem_bitfields.h
/* Bit 2 : Read pending status of interrupt for event COMPARE[2] */
#define MODEMTIMER_INTPEND0_COMPARE2_Pos (2UL) /*!< Position of COMPARE2 field. */
#define MODEMTIMER_INTPEND0_COMPARE2_Msk (0x1UL << MODEMTIMER_INTPEND0_COMPARE2_Pos) /*!< Bit mask of COMPARE2 field. */
#define MODEMTIMER_INTPEND0_COMPARE2_NotPending (0UL) /*!< Read: Not pending */
#define MODEMTIMER_INTPEND0_COMPARE2_Pending (1UL) /*!< Read: Pending */

/* Bit 1 : Read pending status of interrupt for event COMPARE[1] */
#define MODEMTIMER_INTPEND0_COMPARE1_Pos (1UL) /*!< Position of COMPARE1 field. */
#define MODEMTIMER_INTPEND0_COMPARE1_Msk (0x1UL << MODEMTIMER_INTPEND0_COMPARE1_Pos) /*!< Bit mask of COMPARE1 field. */
#define MODEMTIMER_INTPEND0_COMPARE1_NotPending (0UL) /*!< Read: Not pending */
#define MODEMTIMER_INTPEND0_COMPARE1_Pending (1UL) /*!< Read: Pending */

/* Bit 0 : Read pending status of interrupt for event COMPARE[0] */
#define MODEMTIMER_INTPEND0_COMPARE0_Pos (0UL) /*!< Position of COMPARE0 field. */
#define MODEMTIMER_INTPEND0_COMPARE0_Msk (0x1UL << MODEMTIMER_INTPEND0_COMPARE0_Pos) /*!< Bit mask of COMPARE0 field. */
#define MODEMTIMER_INTPEND0_COMPARE0_NotPending (0UL) /*!< Read: Not pending */
#define MODEMTIMER_INTPEND0_COMPARE0_Pending (1UL) /*!< Read: Pending */

/* Register: MODEMTIMER_INTEN1 */
/* Description: Enable or disable interrupt */

/* Bit 7 : Enable or disable interrupt for event COMPARE[7] */
#define MODEMTIMER_INTEN1_COMPARE7_Pos (7UL) /*!< Position of COMPARE7 field. */
#define MODEMTIMER_INTEN1_COMPARE7_Msk (0x1UL << MODEMTIMER_INTEN1_COMPARE7_Pos) /*!< Bit mask of COMPARE7 field. */
#define MODEMTIMER_INTEN1_COMPARE7_Disabled (0UL) /*!< Disable */
#define MODEMTIMER_INTEN1_COMPARE7_Enabled (1UL) /*!< Enable */

/* Bit 6 : Enable or disable interrupt for event COMPARE[6] */
#define MODEMTIMER_INTEN1_COMPARE6_Pos (6UL) /*!< Position of COMPARE6 field. */
#define MODEMTIMER_INTEN1_COMPARE6_Msk (0x1UL << MODEMTIMER_INTEN1_COMPARE6_Pos) /*!< Bit mask of COMPARE6 field. */
#define MODEMTIMER_INTEN1_COMPARE6_Disabled (0UL) /*!< Disable */
#define MODEMTIMER_INTEN1_COMPARE6_Enabled (1UL) /*!< Enable */

/* Bit 5 : Enable or disable interrupt for event COMPARE[5] */
#define MODEMTIMER_INTEN1_COMPARE5_Pos (5UL) /*!< Position of COMPARE5 field. */
#define MODEMTIMER_INTEN1_COMPARE5_Msk (0x1UL << MODEMTIMER_INTEN1_COMPARE5_Pos) /*!< Bit mask of COMPARE5 field. */
#define MODEMTIMER_INTEN1_COMPARE5_Disabled (0UL) /*!< Disable */
#define MODEMTIMER_INTEN1_COMPARE5_Enabled (1UL) /*!< Enable */

/* Bit 4 : Enable or disable interrupt for event COMPARE[4] */
#define MODEMTIMER_INTEN1_COMPARE4_Pos (4UL) /*!< Position of COMPARE4 field. */
#define MODEMTIMER_INTEN1_COMPARE4_Msk (0x1UL << MODEMTIMER_INTEN1_COMPARE4_Pos) /*!< Bit mask of COMPARE4 field. */
#define MODEMTIMER_INTEN1_COMPARE4_Disabled (0UL) /*!< Disable */
#define MODEMTIMER_INTEN1_COMPARE4_Enabled (1UL) /*!< Enable */

/* Bit 3 : Enable or disable interrupt for event COMPARE[3] */
#define MODEMTIMER_INTEN1_COMPARE3_Pos (3UL) /*!< Position of COMPARE3 field. */
#define MODEMTIMER_INTEN1_COMPARE3_Msk (0x1UL << MODEMTIMER_INTEN1_COMPARE3_Pos) /*!< Bit mask of COMPARE3 field. */
#define MODEMTIMER_INTEN1_COMPARE3_Disabled (0UL) /*!< Disable */
#define MODEMTIMER_INTEN1_COMPARE3_Enabled (1UL) /*!< Enable */

/* Bit 2 : Enable or disable interrupt for event COMPARE[2] */
#define MODEMTIMER_INTEN1_COMPARE2_Pos (2UL) /*!< Position of COMPARE2 field. */
#define MODEMTIMER_INTEN1_COMPARE2_Msk (0x1UL << MODEMTIMER_INTEN1_COMPARE2_Pos) /*!< Bit mask of COMPARE2 field. */
#define MODEMTIMER_INTEN1_COMPARE2_Disabled (0UL) /*!< Disable */
#define MODEMTIMER_INTEN1_COMPARE2_Enabled (1UL) /*!< Enable */

/* Bit 1 : Enable or disable interrupt for event COMPARE[1] */
#define MODEMTIMER_INTEN1_COMPARE1_Pos (1UL) /*!< Position of COMPARE1 field. */
#define MODEMTIMER_INTEN1_COMPARE1_Msk (0x1UL << MODEMTIMER_INTEN1_COMPARE1_Pos) /*!< Bit mask of COMPARE1 field. */
#define MODEMTIMER_INTEN1_COMPARE1_Disabled (0UL) /*!< Disable */
#define MODEMTIMER_INTEN1_COMPARE1_Enabled (1UL) /*!< Enable */

/* Bit 0 : Enable or disable interrupt for event COMPARE[0] */
#define MODEMTIMER_INTEN1_COMPARE0_Pos (0UL) /*!< Position of COMPARE0 field. */
#define MODEMTIMER_INTEN1_COMPARE0_Msk (0x1UL << MODEMTIMER_INTEN1_COMPARE0_Pos) /*!< Bit mask of COMPARE0 field. */
#define MODEMTIMER_INTEN1_COMPARE0_Disabled (0UL) /*!< Disable */
#define MODEMTIMER_INTEN1_COMPARE0_Enabled (1UL) /*!< Enable */

/* Register: MODEMTIMER_INTENSET1 */
/* Description: Enable interrupt */

/* Bit 7 : Write '1' to enable interrupt for event COMPARE[7] */
#define MODEMTIMER_INTENSET1_COMPARE7_Pos (7UL) /*!< Position of COMPARE7 field. */
#define MODEMTIMER_INTENSET1_COMPARE7_Msk (0x1UL << MODEMTIMER_INTENSET1_COMPARE7_Pos) /*!< Bit mask of COMPARE7 field. */
#define MODEMTIMER_INTENSET1_COMPARE7_Disabled (0UL) /*!< Read: Disabled */
#define MODEMTIMER_INTENSET1_COMPARE7_Enabled (1UL) /*!< Read: Enabled */
#define MODEMTIMER_INTENSET1_COMPARE7_Set (1UL) /*!< Enable */

/* Bit 6 : Write '1' to enable interrupt for event COMPARE[6] */
#define MODEMTIMER_INTENSET1_COMPARE6_Pos (6UL) /*!< Position of COMPARE6 field. */
#define MODEMTIMER_INTENSET1_COMPARE6_Msk (0x1UL << MODEMTIMER_INTENSET1_COMPARE6_Pos) /*!< Bit mask of COMPARE6 field. */
#define MODEMTIMER_INTENSET1_COMPARE6_Disabled (0UL) /*!< Read: Disabled */
#define MODEMTIMER_INTENSET1_COMPARE6_Enabled (1UL) /*!< Read: Enabled */
#define MODEMTIMER_INTENSET1_COMPARE6_Set (1UL) /*!< Enable */

/* Bit 5 : Write '1' to enable interrupt for event COMPARE[5] */
#define MODEMTIMER_INTENSET1_COMPARE5_Pos (5UL) /*!< Position of COMPARE5 field. */
#define MODEMTIMER_INTENSET1_COMPARE5_Msk (0x1UL << MODEMTIMER_INTENSET1_COMPARE5_Pos) /*!< Bit mask of COMPARE5 field. */
#define MODEMTIMER_INTENSET1_COMPARE5_Disabled (0UL) /*!< Read: Disabled */
#define MODEMTIMER_INTENSET1_COMPARE5_Enabled (1UL) /*!< Read: Enabled */
#define MODEMTIMER_INTENSET1_COMPARE5_Set (1UL) /*!< Enable */

/* Bit 4 : Write '1' to enable interrupt for event COMPARE[4] */
#define MODEMTIMER_INTENSET1_COMPARE4_Pos (4UL) /*!< Position of COMPARE4 field. */
#define MODEMTIMER_INTENSET1_COMPARE4_Msk (0x1UL << MODEMTIMER_INTENSET1_COMPARE4_Pos) /*!< Bit mask of COMPARE4 field. */
#define MODEMTIMER_INTENSET1_COMPARE4_Disabled (0UL) /*!< Read: Disabled */
#define MODEMTIMER_INTENSET1_COMPARE4_Enabled (1UL) /*!< Read: Enabled */
#define MODEMTIMER_INTENSET1_COMPARE4_Set (1UL) /*!< Enable */

/* Bit 3 : Write '1' to enable interrupt for event COMPARE[3] */
#define MODEMTIMER_INTENSET1_COMPARE3_Pos (3UL) /*!< Position of COMPARE3 field. */
#define MODEMTIMER_INTENSET1_COMPARE3_Msk (0x1UL << MODEMTIMER_INTENSET1_COMPARE3_Pos) /*!< Bit mask of COMPARE3 field. */
#define MODEMTIMER_INTENSET1_COMPARE3_Disabled (0UL) /*!< Read: Disabled */
#define MODEMTIMER_INTENSET1_COMPARE3_Enabled (1UL) /*!< Read: Enabled */
#define MODEMTIMER_INTENSET1_COMPARE3_Set (1UL) /*!< Enable */

/* Bit 2 : Write '1' to enable interrupt for event COMPARE[2] */
#define MODEMTIMER_INTENSET1_COMPARE2_Pos (2UL) /*!< Position of COMPARE2 field. */
#define MODEMTIMER_INTENSET1_COMPARE2_Msk (0x1UL << MODEMTIMER_INTENSET1_COMPARE2_Pos) /*!< Bit mask of COMPARE2 field. */
#define MODEMTIMER_INTENSET1_COMPARE2_Disabled (0UL) /*!< Read: Disabled */
#define MODEMTIMER_INTENSET1_COMPARE2_Enabled (1UL) /*!< Read: Enabled */
#define MODEMTIMER_INTENSET1_COMPARE2_Set (1UL) /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event COMPARE[1] */
#define MODEMTIMER_INTENSET1_COMPARE1_Pos (1UL) /*!< Position of COMPARE1 field. */
#define MODEMTIMER_INTENSET1_COMPARE1_Msk (0x1UL << MODEMTIMER_INTENSET1_COMPARE1_Pos) /*!< Bit mask of COMPARE1 field. */
#define MODEMTIMER_INTENSET1_COMPARE1_Disabled (0UL) /*!< Read: Disabled */
#define MODEMTIMER_INTENSET1_COMPARE1_Enabled (1UL) /*!< Read: Enabled */
#define MODEMTIMER_INTENSET1_COMPARE1_Set (1UL) /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event COMPARE[0] */
#define MODEMTIMER_INTENSET1_COMPARE0_Pos (0UL) /*!< Position of COMPARE0 field. */
#define MODEMTIMER_INTENSET1_COMPARE0_Msk (0x1UL << MODEMTIMER_INTENSET1_COMPARE0_Pos) /*!< Bit mask of COMPARE0 field. */
#define MODEMTIMER_INTENSET1_COMPARE0_Disabled (0UL) /*!< Read: Disabled */
#define MODEMTIMER_INTENSET1_COMPARE0_Enabled (1UL) /*!< Read: Enabled */
#define MODEMTIMER_INTENSET1_COMPARE0_Set (1UL) /*!< Enable */

/* Register: MODEMTIMER_INTENCLR1 */
/* Description: Disable interrupt */

