adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem_bitfields.h
/* Bits 31..0 : Capture/Compare value High Word */
#define MODEMTIMER_CCHI6_CCHI_Pos (0UL) /*!< Position of CCHI field. */
#define MODEMTIMER_CCHI6_CCHI_Msk (0xFFFFFFFFUL << MODEMTIMER_CCHI6_CCHI_Pos) /*!< Bit mask of CCHI field. */

/* Register: MODEMTIMER_CCLO7 */
/* Description: Capture/Compare register 7 - Low Word */

/* Bits 31..0 : Capture/Compare value Low Word */
#define MODEMTIMER_CCLO7_CCLO_Pos (0UL) /*!< Position of CCLO field. */
#define MODEMTIMER_CCLO7_CCLO_Msk (0xFFFFFFFFUL << MODEMTIMER_CCLO7_CCLO_Pos) /*!< Bit mask of CCLO field. */

/* Register: MODEMTIMER_CCHI7 */
/* Description: Capture/Compare register 7 - High Word */

/* Bits 31..0 : Capture/Compare value High Word */
#define MODEMTIMER_CCHI7_CCHI_Pos (0UL) /*!< Position of CCHI field. */
#define MODEMTIMER_CCHI7_CCHI_Msk (0xFFFFFFFFUL << MODEMTIMER_CCHI7_CCHI_Pos) /*!< Bit mask of CCHI field. */

/* Register: MODEMTIMER_COUNTLO */
/* Description: Internal Counter Value - Low Word */

/* Bits 31..0 : Internal Counter Value - Low Word */
#define MODEMTIMER_COUNTLO_COUNTLO_Pos (0UL) /*!< Position of COUNTLO field. */
#define MODEMTIMER_COUNTLO_COUNTLO_Msk (0xFFFFFFFFUL << MODEMTIMER_COUNTLO_COUNTLO_Pos) /*!< Bit mask of COUNTLO field. */

/* Register: MODEMTIMER_COUNTHI */
/* Description: Internal Counter Value - High Word */

/* Bits 31..0 : Internal Counter Value High Word */
#define MODEMTIMER_COUNTHI_COUNTHI_Pos (0UL) /*!< Position of COUNTHI field. */
#define MODEMTIMER_COUNTHI_COUNTHI_Msk (0xFFFFFFFFUL << MODEMTIMER_COUNTHI_COUNTHI_Pos) /*!< Bit mask of COUNTHI field. */

/* Register: MODEMTIMER_POWER */
/* Description: Peripheral power control */

/* Bit 0 : Peripheral power control. The peripheral and its registers will be reset to its initial state by switching the peripheral off and then back on again. */
#define MODEMTIMER_POWER_POWER_Pos (0UL) /*!< Position of POWER field. */
#define MODEMTIMER_POWER_POWER_Msk (0x1UL << MODEMTIMER_POWER_POWER_Pos) /*!< Bit mask of POWER field. */
#define MODEMTIMER_POWER_POWER_Disabled (0UL) /*!< Peripheral is powered off */
#define MODEMTIMER_POWER_POWER_Enabled (1UL) /*!< Peripheral is powered on */


/* Peripheral: TIMEREVENTSYNC */
/* Description: Timer event synchronizer */

/* Register: TIMEREVENTSYNC_CLOCKENABLE */
/* Description: Enable synchronizer clock. */

/* Bit 0 : Enable. */
#define TIMEREVENTSYNC_CLOCKENABLE_CLOCKENABLE_Pos (0UL) /*!< Position of CLOCKENABLE field. */
#define TIMEREVENTSYNC_CLOCKENABLE_CLOCKENABLE_Msk (0x1UL << TIMEREVENTSYNC_CLOCKENABLE_CLOCKENABLE_Pos) /*!< Bit mask of CLOCKENABLE field. */
#define TIMEREVENTSYNC_CLOCKENABLE_CLOCKENABLE_Disable (0UL) /*!< Disable clock. */
#define TIMEREVENTSYNC_CLOCKENABLE_CLOCKENABLE_Enable (1UL) /*!< Enable clock. */


/* Peripheral: AES */
/* Description: AES cipher with ECB, CBC, CBC-MAC and CTR */

/* Register: AES_TASKS_START_GATHER */
/* Description: Start input DMA */

/* Bit 0 : Start input DMA */
#define AES_TASKS_START_GATHER_TASKS_START_GATHER_Pos (0UL) /*!< Position of TASKS_START_GATHER field. */
#define AES_TASKS_START_GATHER_TASKS_START_GATHER_Msk (0x1UL << AES_TASKS_START_GATHER_TASKS_START_GATHER_Pos) /*!< Bit mask of TASKS_START_GATHER field. */
#define AES_TASKS_START_GATHER_TASKS_START_GATHER_Trigger (1UL) /*!< Trigger task */

/* Register: AES_TASKS_STOP_GATHER */
/* Description: Stop  input DMA */

/* Bit 0 : Stop  input DMA */
#define AES_TASKS_STOP_GATHER_TASKS_STOP_GATHER_Pos (0UL) /*!< Position of TASKS_STOP_GATHER field. */
#define AES_TASKS_STOP_GATHER_TASKS_STOP_GATHER_Msk (0x1UL << AES_TASKS_STOP_GATHER_TASKS_STOP_GATHER_Pos) /*!< Bit mask of TASKS_STOP_GATHER field. */
#define AES_TASKS_STOP_GATHER_TASKS_STOP_GATHER_Trigger (1UL) /*!< Trigger task */

/* Register: AES_TASKS_START_SCATTER */
/* Description: Start output DMA */

/* Bit 0 : Start output DMA */
#define AES_TASKS_START_SCATTER_TASKS_START_SCATTER_Pos (0UL) /*!< Position of TASKS_START_SCATTER field. */
#define AES_TASKS_START_SCATTER_TASKS_START_SCATTER_Msk (0x1UL << AES_TASKS_START_SCATTER_TASKS_START_SCATTER_Pos) /*!< Bit mask of TASKS_START_SCATTER field. */
#define AES_TASKS_START_SCATTER_TASKS_START_SCATTER_Trigger (1UL) /*!< Trigger task */

/* Register: AES_TASKS_STOP_SCATTER */
/* Description: Stop output DMA */

/* Bit 0 : Stop output DMA */
#define AES_TASKS_STOP_SCATTER_TASKS_STOP_SCATTER_Pos (0UL) /*!< Position of TASKS_STOP_SCATTER field. */
#define AES_TASKS_STOP_SCATTER_TASKS_STOP_SCATTER_Msk (0x1UL << AES_TASKS_STOP_SCATTER_TASKS_STOP_SCATTER_Pos) /*!< Bit mask of TASKS_STOP_SCATTER field. */
#define AES_TASKS_STOP_SCATTER_TASKS_STOP_SCATTER_Trigger (1UL) /*!< Trigger task */

/* Register: AES_TASKS_INITIALIZE_AES */
/* Description: New keys (and IV) ready to be used, reset keybytes, ivbytes */

/* Bit 0 : New keys (and IV) ready to be used, reset keybytes, ivbytes */
#define AES_TASKS_INITIALIZE_AES_TASKS_INITIALIZE_AES_Pos (0UL) /*!< Position of TASKS_INITIALIZE_AES field. */
#define AES_TASKS_INITIALIZE_AES_TASKS_INITIALIZE_AES_Msk (0x1UL << AES_TASKS_INITIALIZE_AES_TASKS_INITIALIZE_AES_Pos) /*!< Bit mask of TASKS_INITIALIZE_AES field. */
#define AES_TASKS_INITIALIZE_AES_TASKS_INITIALIZE_AES_Trigger (1UL) /*!< Trigger task */

/* Register: AES_TASKS_FILL_AES_INPUT */
/* Description: Transfer 8 bytes of input from DMA to AES core */

/* Bit 0 : Transfer 8 bytes of input from DMA to AES core */
#define AES_TASKS_FILL_AES_INPUT_TASKS_FILL_AES_INPUT_Pos (0UL) /*!< Position of TASKS_FILL_AES_INPUT field. */
#define AES_TASKS_FILL_AES_INPUT_TASKS_FILL_AES_INPUT_Msk (0x1UL << AES_TASKS_FILL_AES_INPUT_TASKS_FILL_AES_INPUT_Pos) /*!< Bit mask of TASKS_FILL_AES_INPUT field. */
#define AES_TASKS_FILL_AES_INPUT_TASKS_FILL_AES_INPUT_Trigger (1UL) /*!< Trigger task */

/* Register: AES_TASKS_AES_ENCRYPT */
/* Description: Encrypt */

/* Bit 0 : Encrypt */
#define AES_TASKS_AES_ENCRYPT_TASKS_AES_ENCRYPT_Pos (0UL) /*!< Position of TASKS_AES_ENCRYPT field. */
#define AES_TASKS_AES_ENCRYPT_TASKS_AES_ENCRYPT_Msk (0x1UL << AES_TASKS_AES_ENCRYPT_TASKS_AES_ENCRYPT_Pos) /*!< Bit mask of TASKS_AES_ENCRYPT field. */
#define AES_TASKS_AES_ENCRYPT_TASKS_AES_ENCRYPT_Trigger (1UL) /*!< Trigger task */

/* Register: AES_TASKS_AES_DECRYPT */
/* Description: Decrypt */

