adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem_bitfields.h
/* Register: AES_EVENTS_AES_DONE */
/* Description: Encrypt/decrypt action ready */

/* Bit 0 : Encrypt/decrypt action ready */
#define AES_EVENTS_AES_DONE_EVENTS_AES_DONE_Pos (0UL) /*!< Position of EVENTS_AES_DONE field. */
#define AES_EVENTS_AES_DONE_EVENTS_AES_DONE_Msk (0x1UL << AES_EVENTS_AES_DONE_EVENTS_AES_DONE_Pos) /*!< Bit mask of EVENTS_AES_DONE field. */
#define AES_EVENTS_AES_DONE_EVENTS_AES_DONE_NotGenerated (0UL) /*!< Event not generated */
#define AES_EVENTS_AES_DONE_EVENTS_AES_DONE_Generated (1UL) /*!< Event generated */

/* Register: AES_EVENTS_AES_OUTPUT_EMPTY */
/* Description: 8 bytes of output read from AES core */

/* Bit 0 : 8 bytes of output read from AES core */
#define AES_EVENTS_AES_OUTPUT_EMPTY_EVENTS_AES_OUTPUT_EMPTY_Pos (0UL) /*!< Position of EVENTS_AES_OUTPUT_EMPTY field. */
#define AES_EVENTS_AES_OUTPUT_EMPTY_EVENTS_AES_OUTPUT_EMPTY_Msk (0x1UL << AES_EVENTS_AES_OUTPUT_EMPTY_EVENTS_AES_OUTPUT_EMPTY_Pos) /*!< Bit mask of EVENTS_AES_OUTPUT_EMPTY field. */
#define AES_EVENTS_AES_OUTPUT_EMPTY_EVENTS_AES_OUTPUT_EMPTY_NotGenerated (0UL) /*!< Event not generated */
#define AES_EVENTS_AES_OUTPUT_EMPTY_EVENTS_AES_OUTPUT_EMPTY_Generated (1UL) /*!< Event generated */

/* Register: AES_EVENTS_MAC_READY */
/* Description: CBC-MAC calculated */

/* Bit 0 : CBC-MAC calculated */
#define AES_EVENTS_MAC_READY_EVENTS_MAC_READY_Pos (0UL) /*!< Position of EVENTS_MAC_READY field. */
#define AES_EVENTS_MAC_READY_EVENTS_MAC_READY_Msk (0x1UL << AES_EVENTS_MAC_READY_EVENTS_MAC_READY_Pos) /*!< Bit mask of EVENTS_MAC_READY field. */
#define AES_EVENTS_MAC_READY_EVENTS_MAC_READY_NotGenerated (0UL) /*!< Event not generated */
#define AES_EVENTS_MAC_READY_EVENTS_MAC_READY_Generated (1UL) /*!< Event generated */

/* Register: AES_EVENTS_RESETTED */
/* Description: Resetted (all transfers and crypto operations stopped) */

/* Bit 0 : Resetted (all transfers and crypto operations stopped) */
#define AES_EVENTS_RESETTED_EVENTS_RESETTED_Pos (0UL) /*!< Position of EVENTS_RESETTED field. */
#define AES_EVENTS_RESETTED_EVENTS_RESETTED_Msk (0x1UL << AES_EVENTS_RESETTED_EVENTS_RESETTED_Pos) /*!< Bit mask of EVENTS_RESETTED field. */
#define AES_EVENTS_RESETTED_EVENTS_RESETTED_NotGenerated (0UL) /*!< Event not generated */
#define AES_EVENTS_RESETTED_EVENTS_RESETTED_Generated (1UL) /*!< Event generated */

/* Register: AES_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 7 : Shortcut between event AES_INITIALIZED and task FILL_AES_INPUT */
#define AES_SHORTS_AES_INITIALIZED_FILL_AES_INPUT_Pos (7UL) /*!< Position of AES_INITIALIZED_FILL_AES_INPUT field. */
#define AES_SHORTS_AES_INITIALIZED_FILL_AES_INPUT_Msk (0x1UL << AES_SHORTS_AES_INITIALIZED_FILL_AES_INPUT_Pos) /*!< Bit mask of AES_INITIALIZED_FILL_AES_INPUT field. */
#define AES_SHORTS_AES_INITIALIZED_FILL_AES_INPUT_Disabled (0UL) /*!< Disable shortcut */
#define AES_SHORTS_AES_INITIALIZED_FILL_AES_INPUT_Enabled (1UL) /*!< Enable shortcut */

/* Bit 6 : Shortcut between event KEY_READY and task INITIALIZE_AES */
#define AES_SHORTS_KEY_READY_INITIALIZE_AES_Pos (6UL) /*!< Position of KEY_READY_INITIALIZE_AES field. */
#define AES_SHORTS_KEY_READY_INITIALIZE_AES_Msk (0x1UL << AES_SHORTS_KEY_READY_INITIALIZE_AES_Pos) /*!< Bit mask of KEY_READY_INITIALIZE_AES field. */
#define AES_SHORTS_KEY_READY_INITIALIZE_AES_Disabled (0UL) /*!< Disable shortcut */
#define AES_SHORTS_KEY_READY_INITIALIZE_AES_Enabled (1UL) /*!< Enable shortcut */

/* Bit 5 : Shortcut between event IV_READY and task INITIALIZE_AES */
#define AES_SHORTS_IV_READY_INITIALIZE_AES_Pos (5UL) /*!< Position of IV_READY_INITIALIZE_AES field. */
#define AES_SHORTS_IV_READY_INITIALIZE_AES_Msk (0x1UL << AES_SHORTS_IV_READY_INITIALIZE_AES_Pos) /*!< Bit mask of IV_READY_INITIALIZE_AES field. */
#define AES_SHORTS_IV_READY_INITIALIZE_AES_Disabled (0UL) /*!< Disable shortcut */
#define AES_SHORTS_IV_READY_INITIALIZE_AES_Enabled (1UL) /*!< Enable shortcut */

/* Bit 4 : Shortcut between event GATHER_STARTED and task START_SCATTER */
#define AES_SHORTS_GATHER_STARTED_START_SCATTER_Pos (4UL) /*!< Position of GATHER_STARTED_START_SCATTER field. */
#define AES_SHORTS_GATHER_STARTED_START_SCATTER_Msk (0x1UL << AES_SHORTS_GATHER_STARTED_START_SCATTER_Pos) /*!< Bit mask of GATHER_STARTED_START_SCATTER field. */
#define AES_SHORTS_GATHER_STARTED_START_SCATTER_Disabled (0UL) /*!< Disable shortcut */
#define AES_SHORTS_GATHER_STARTED_START_SCATTER_Enabled (1UL) /*!< Enable shortcut */

/* Bit 3 : Shortcut between event AES_OUTPUT_EMPTY and task FILL_AES_INPUT */
#define AES_SHORTS_AES_OUTPUT_EMPTY_FILL_AES_INPUT_Pos (3UL) /*!< Position of AES_OUTPUT_EMPTY_FILL_AES_INPUT field. */
#define AES_SHORTS_AES_OUTPUT_EMPTY_FILL_AES_INPUT_Msk (0x1UL << AES_SHORTS_AES_OUTPUT_EMPTY_FILL_AES_INPUT_Pos) /*!< Bit mask of AES_OUTPUT_EMPTY_FILL_AES_INPUT field. */
#define AES_SHORTS_AES_OUTPUT_EMPTY_FILL_AES_INPUT_Disabled (0UL) /*!< Disable shortcut */
#define AES_SHORTS_AES_OUTPUT_EMPTY_FILL_AES_INPUT_Enabled (1UL) /*!< Enable shortcut */

/* Bit 2 : Shortcut between event AES_DONE and task DRAIN_AES_OUTPUT */
#define AES_SHORTS_AES_DONE_DRAIN_AES_OUTPUT_Pos (2UL) /*!< Position of AES_DONE_DRAIN_AES_OUTPUT field. */
#define AES_SHORTS_AES_DONE_DRAIN_AES_OUTPUT_Msk (0x1UL << AES_SHORTS_AES_DONE_DRAIN_AES_OUTPUT_Pos) /*!< Bit mask of AES_DONE_DRAIN_AES_OUTPUT field. */
#define AES_SHORTS_AES_DONE_DRAIN_AES_OUTPUT_Disabled (0UL) /*!< Disable shortcut */
#define AES_SHORTS_AES_DONE_DRAIN_AES_OUTPUT_Enabled (1UL) /*!< Enable shortcut */

/* Bit 1 : Shortcut between event AES_INPUT_FULL and task AES_DECRYPT */
#define AES_SHORTS_AES_INPUT_FULL_AES_DECRYPT_Pos (1UL) /*!< Position of AES_INPUT_FULL_AES_DECRYPT field. */
#define AES_SHORTS_AES_INPUT_FULL_AES_DECRYPT_Msk (0x1UL << AES_SHORTS_AES_INPUT_FULL_AES_DECRYPT_Pos) /*!< Bit mask of AES_INPUT_FULL_AES_DECRYPT field. */
#define AES_SHORTS_AES_INPUT_FULL_AES_DECRYPT_Disabled (0UL) /*!< Disable shortcut */
#define AES_SHORTS_AES_INPUT_FULL_AES_DECRYPT_Enabled (1UL) /*!< Enable shortcut */

/* Bit 0 : Shortcut between event AES_INPUT_FULL and task AES_ENCRYPT */
#define AES_SHORTS_AES_INPUT_FULL_AES_ENCRYPT_Pos (0UL) /*!< Position of AES_INPUT_FULL_AES_ENCRYPT field. */
#define AES_SHORTS_AES_INPUT_FULL_AES_ENCRYPT_Msk (0x1UL << AES_SHORTS_AES_INPUT_FULL_AES_ENCRYPT_Pos) /*!< Bit mask of AES_INPUT_FULL_AES_ENCRYPT field. */
#define AES_SHORTS_AES_INPUT_FULL_AES_ENCRYPT_Disabled (0UL) /*!< Disable shortcut */
#define AES_SHORTS_AES_INPUT_FULL_AES_ENCRYPT_Enabled (1UL) /*!< Enable shortcut */

/* Register: AES_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 11 : Enable or disable interrupt for event RESETTED */
#define AES_INTEN_RESETTED_Pos (11UL) /*!< Position of RESETTED field. */
#define AES_INTEN_RESETTED_Msk (0x1UL << AES_INTEN_RESETTED_Pos) /*!< Bit mask of RESETTED field. */
#define AES_INTEN_RESETTED_Disabled (0UL) /*!< Disable */
#define AES_INTEN_RESETTED_Enabled (1UL) /*!< Enable */

/* Bit 10 : Enable or disable interrupt for event MAC_READY */
#define AES_INTEN_MAC_READY_Pos (10UL) /*!< Position of MAC_READY field. */
#define AES_INTEN_MAC_READY_Msk (0x1UL << AES_INTEN_MAC_READY_Pos) /*!< Bit mask of MAC_READY field. */
#define AES_INTEN_MAC_READY_Disabled (0UL) /*!< Disable */
#define AES_INTEN_MAC_READY_Enabled (1UL) /*!< Enable */

/* Bit 9 : Enable or disable interrupt for event AES_OUTPUT_EMPTY */
#define AES_INTEN_AES_OUTPUT_EMPTY_Pos (9UL) /*!< Position of AES_OUTPUT_EMPTY field. */
#define AES_INTEN_AES_OUTPUT_EMPTY_Msk (0x1UL << AES_INTEN_AES_OUTPUT_EMPTY_Pos) /*!< Bit mask of AES_OUTPUT_EMPTY field. */
#define AES_INTEN_AES_OUTPUT_EMPTY_Disabled (0UL) /*!< Disable */
#define AES_INTEN_AES_OUTPUT_EMPTY_Enabled (1UL) /*!< Enable */

/* Bit 8 : Enable or disable interrupt for event AES_DONE */
#define AES_INTEN_AES_DONE_Pos (8UL) /*!< Position of AES_DONE field. */
#define AES_INTEN_AES_DONE_Msk (0x1UL << AES_INTEN_AES_DONE_Pos) /*!< Bit mask of AES_DONE field. */
#define AES_INTEN_AES_DONE_Disabled (0UL) /*!< Disable */
#define AES_INTEN_AES_DONE_Enabled (1UL) /*!< Enable */

/* Bit 7 : Enable or disable interrupt for event AES_INPUT_FULL */
#define AES_INTEN_AES_INPUT_FULL_Pos (7UL) /*!< Position of AES_INPUT_FULL field. */
#define AES_INTEN_AES_INPUT_FULL_Msk (0x1UL << AES_INTEN_AES_INPUT_FULL_Pos) /*!< Bit mask of AES_INPUT_FULL field. */
#define AES_INTEN_AES_INPUT_FULL_Disabled (0UL) /*!< Disable */
#define AES_INTEN_AES_INPUT_FULL_Enabled (1UL) /*!< Enable */

/* Bit 6 : Enable or disable interrupt for event AES_INITIALIZED */
#define AES_INTEN_AES_INITIALIZED_Pos (6UL) /*!< Position of AES_INITIALIZED field. */
#define AES_INTEN_AES_INITIALIZED_Msk (0x1UL << AES_INTEN_AES_INITIALIZED_Pos) /*!< Bit mask of AES_INITIALIZED field. */
#define AES_INTEN_AES_INITIALIZED_Disabled (0UL) /*!< Disable */
#define AES_INTEN_AES_INITIALIZED_Enabled (1UL) /*!< Enable */

/* Bit 5 : Enable or disable interrupt for event IV_READY */
#define AES_INTEN_IV_READY_Pos (5UL) /*!< Position of IV_READY field. */
#define AES_INTEN_IV_READY_Msk (0x1UL << AES_INTEN_IV_READY_Pos) /*!< Bit mask of IV_READY field. */
#define AES_INTEN_IV_READY_Disabled (0UL) /*!< Disable */
#define AES_INTEN_IV_READY_Enabled (1UL) /*!< Enable */

