adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem_bitfields.h
/* Register: VMC_RAM_POWERSET */
/* Description: Description cluster: RAMn power control set register */

/* Bit 17 : Unused retention set control bit */
#define VMC_RAM_POWERSET_UNUSED_RETENTION1_Pos (17UL) /*!< Position of UNUSED_RETENTION1 field. */
#define VMC_RAM_POWERSET_UNUSED_RETENTION1_Msk (0x1UL << VMC_RAM_POWERSET_UNUSED_RETENTION1_Pos) /*!< Bit mask of UNUSED_RETENTION1 field. */

/* Bit 16 : Unused power control bit */
#define VMC_RAM_POWERSET_S01RETENTION_Pos (16UL) /*!< Position of S01RETENTION field. */
#define VMC_RAM_POWERSET_S01RETENTION_Msk (0x1UL << VMC_RAM_POWERSET_S01RETENTION_Pos) /*!< Bit mask of S01RETENTION field. */

/* Bit 1 : Unused power set control bit */
#define VMC_RAM_POWERSET_UNUSED_POWER1_Pos (1UL) /*!< Position of UNUSED_POWER1 field. */
#define VMC_RAM_POWERSET_UNUSED_POWER1_Msk (0x1UL << VMC_RAM_POWERSET_UNUSED_POWER1_Pos) /*!< Bit mask of UNUSED_POWER1 field. */

/* Bit 0 : Unused power control bit */
#define VMC_RAM_POWERSET_S01POWER_Pos (0UL) /*!< Position of S01POWER field. */
#define VMC_RAM_POWERSET_S01POWER_Msk (0x1UL << VMC_RAM_POWERSET_S01POWER_Pos) /*!< Bit mask of S01POWER field. */

/* Register: VMC_RAM_POWERCLR */
/* Description: Description cluster: RAMn power control clear register */

/* Bit 17 : Unused retention clear control bit */
#define VMC_RAM_POWERCLR_UNUSED_RETENTION1_Pos (17UL) /*!< Position of UNUSED_RETENTION1 field. */
#define VMC_RAM_POWERCLR_UNUSED_RETENTION1_Msk (0x1UL << VMC_RAM_POWERCLR_UNUSED_RETENTION1_Pos) /*!< Bit mask of UNUSED_RETENTION1 field. */

/* Bit 16 : Unused power control bit */
#define VMC_RAM_POWERCLR_S01RETENTION_Pos (16UL) /*!< Position of S01RETENTION field. */
#define VMC_RAM_POWERCLR_S01RETENTION_Msk (0x1UL << VMC_RAM_POWERCLR_S01RETENTION_Pos) /*!< Bit mask of S01RETENTION field. */

/* Bit 1 : Unused power clear control bit */
#define VMC_RAM_POWERCLR_UNUSED_POWER1_Pos (1UL) /*!< Position of UNUSED_POWER1 field. */
#define VMC_RAM_POWERCLR_UNUSED_POWER1_Msk (0x1UL << VMC_RAM_POWERCLR_UNUSED_POWER1_Pos) /*!< Bit mask of UNUSED_POWER1 field. */

/* Bit 0 : Unused power control bit */
#define VMC_RAM_POWERCLR_S01POWER_Pos (0UL) /*!< Position of S01POWER field. */
#define VMC_RAM_POWERCLR_S01POWER_Msk (0x1UL << VMC_RAM_POWERCLR_S01POWER_Pos) /*!< Bit mask of S01POWER field. */

/* Register: VMC_RAMB_POWER */
/* Description: Description cluster: RAM Bn power control register */

/* Bit 31 : Unused retention bit 14 */
#define VMC_RAMB_POWER_UNUSED_RETENTION14_Pos (31UL) /*!< Position of UNUSED_RETENTION14 field. */
#define VMC_RAMB_POWER_UNUSED_RETENTION14_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_RETENTION14_Pos) /*!< Bit mask of UNUSED_RETENTION14 field. */

/* Bit 30 : Unused retention bit 13 */
#define VMC_RAMB_POWER_UNUSED_RETENTION13_Pos (30UL) /*!< Position of UNUSED_RETENTION13 field. */
#define VMC_RAMB_POWER_UNUSED_RETENTION13_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_RETENTION13_Pos) /*!< Bit mask of UNUSED_RETENTION13 field. */

/* Bit 29 : Unused retention bit 12 */
#define VMC_RAMB_POWER_UNUSED_RETENTION12_Pos (29UL) /*!< Position of UNUSED_RETENTION12 field. */
#define VMC_RAMB_POWER_UNUSED_RETENTION12_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_RETENTION12_Pos) /*!< Bit mask of UNUSED_RETENTION12 field. */

/* Bit 28 : Unused retention bit 11 */
#define VMC_RAMB_POWER_UNUSED_RETENTION11_Pos (28UL) /*!< Position of UNUSED_RETENTION11 field. */
#define VMC_RAMB_POWER_UNUSED_RETENTION11_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_RETENTION11_Pos) /*!< Bit mask of UNUSED_RETENTION11 field. */

/* Bit 27 : Unused retention bit 10 */
#define VMC_RAMB_POWER_UNUSED_RETENTION10_Pos (27UL) /*!< Position of UNUSED_RETENTION10 field. */
#define VMC_RAMB_POWER_UNUSED_RETENTION10_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_RETENTION10_Pos) /*!< Bit mask of UNUSED_RETENTION10 field. */

/* Bit 26 : Unused retention bit 9 */
#define VMC_RAMB_POWER_UNUSED_RETENTION9_Pos (26UL) /*!< Position of UNUSED_RETENTION9 field. */
#define VMC_RAMB_POWER_UNUSED_RETENTION9_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_RETENTION9_Pos) /*!< Bit mask of UNUSED_RETENTION9 field. */

/* Bit 25 : Unused retention bit 8 */
#define VMC_RAMB_POWER_UNUSED_RETENTION8_Pos (25UL) /*!< Position of UNUSED_RETENTION8 field. */
#define VMC_RAMB_POWER_UNUSED_RETENTION8_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_RETENTION8_Pos) /*!< Bit mask of UNUSED_RETENTION8 field. */

/* Bit 24 : Unused retention bit 7 */
#define VMC_RAMB_POWER_UNUSED_RETENTION7_Pos (24UL) /*!< Position of UNUSED_RETENTION7 field. */
#define VMC_RAMB_POWER_UNUSED_RETENTION7_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_RETENTION7_Pos) /*!< Bit mask of UNUSED_RETENTION7 field. */

/* Bit 23 : Unused retention bit 6 */
#define VMC_RAMB_POWER_UNUSED_RETENTION6_Pos (23UL) /*!< Position of UNUSED_RETENTION6 field. */
#define VMC_RAMB_POWER_UNUSED_RETENTION6_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_RETENTION6_Pos) /*!< Bit mask of UNUSED_RETENTION6 field. */

/* Bit 22 : Unused retention bit 5 */
#define VMC_RAMB_POWER_UNUSED_RETENTION5_Pos (22UL) /*!< Position of UNUSED_RETENTION5 field. */
#define VMC_RAMB_POWER_UNUSED_RETENTION5_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_RETENTION5_Pos) /*!< Bit mask of UNUSED_RETENTION5 field. */

/* Bit 21 : Unused retention bit 4 */
#define VMC_RAMB_POWER_UNUSED_RETENTION4_Pos (21UL) /*!< Position of UNUSED_RETENTION4 field. */
#define VMC_RAMB_POWER_UNUSED_RETENTION4_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_RETENTION4_Pos) /*!< Bit mask of UNUSED_RETENTION4 field. */

/* Bit 20 : Unused retention bit 3 */
#define VMC_RAMB_POWER_UNUSED_RETENTION3_Pos (20UL) /*!< Position of UNUSED_RETENTION3 field. */
#define VMC_RAMB_POWER_UNUSED_RETENTION3_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_RETENTION3_Pos) /*!< Bit mask of UNUSED_RETENTION3 field. */

/* Bit 19 : Unused retention bit 2 */
#define VMC_RAMB_POWER_UNUSED_RETENTION2_Pos (19UL) /*!< Position of UNUSED_RETENTION2 field. */
#define VMC_RAMB_POWER_UNUSED_RETENTION2_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_RETENTION2_Pos) /*!< Bit mask of UNUSED_RETENTION2 field. */

