adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem_bitfields.h
/* Bit 18 : Unused retention bit 1 */
#define VMC_RAMB_POWER_UNUSED_RETENTION1_Pos (18UL) /*!< Position of UNUSED_RETENTION1 field. */
#define VMC_RAMB_POWER_UNUSED_RETENTION1_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_RETENTION1_Pos) /*!< Bit mask of UNUSED_RETENTION1 field. */

/* Bit 17 : Unused retention bit 0 */
#define VMC_RAMB_POWER_UNUSED_RETENTION0_Pos (17UL) /*!< Position of UNUSED_RETENTION0 field. */
#define VMC_RAMB_POWER_UNUSED_RETENTION0_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_RETENTION0_Pos) /*!< Bit mask of UNUSED_RETENTION0 field. */

/* Bit 16 : Keep retention on RAM section S0-S15 of RAM Bn when RAM section is switched off */
#define VMC_RAMB_POWER_S015RETENTION_Pos (16UL) /*!< Position of S015RETENTION field. */
#define VMC_RAMB_POWER_S015RETENTION_Msk (0x1UL << VMC_RAMB_POWER_S015RETENTION_Pos) /*!< Bit mask of S015RETENTION field. */
#define VMC_RAMB_POWER_S015RETENTION_Off (0UL) /*!< Off */
#define VMC_RAMB_POWER_S015RETENTION_On (1UL) /*!< On */

/* Bit 15 : Unused power bit 14 */
#define VMC_RAMB_POWER_UNUSED_POWER14_Pos (15UL) /*!< Position of UNUSED_POWER14 field. */
#define VMC_RAMB_POWER_UNUSED_POWER14_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_POWER14_Pos) /*!< Bit mask of UNUSED_POWER14 field. */

/* Bit 14 : Unused power bit 13 */
#define VMC_RAMB_POWER_UNUSED_POWER13_Pos (14UL) /*!< Position of UNUSED_POWER13 field. */
#define VMC_RAMB_POWER_UNUSED_POWER13_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_POWER13_Pos) /*!< Bit mask of UNUSED_POWER13 field. */

/* Bit 13 : Unused power bit 12 */
#define VMC_RAMB_POWER_UNUSED_POWER12_Pos (13UL) /*!< Position of UNUSED_POWER12 field. */
#define VMC_RAMB_POWER_UNUSED_POWER12_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_POWER12_Pos) /*!< Bit mask of UNUSED_POWER12 field. */

/* Bit 12 : Unused power bit 11 */
#define VMC_RAMB_POWER_UNUSED_POWER11_Pos (12UL) /*!< Position of UNUSED_POWER11 field. */
#define VMC_RAMB_POWER_UNUSED_POWER11_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_POWER11_Pos) /*!< Bit mask of UNUSED_POWER11 field. */

/* Bit 11 : Unused power bit 10 */
#define VMC_RAMB_POWER_UNUSED_POWER10_Pos (11UL) /*!< Position of UNUSED_POWER10 field. */
#define VMC_RAMB_POWER_UNUSED_POWER10_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_POWER10_Pos) /*!< Bit mask of UNUSED_POWER10 field. */

/* Bit 10 : Unused power bit 9 */
#define VMC_RAMB_POWER_UNUSED_POWER9_Pos (10UL) /*!< Position of UNUSED_POWER9 field. */
#define VMC_RAMB_POWER_UNUSED_POWER9_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_POWER9_Pos) /*!< Bit mask of UNUSED_POWER9 field. */

/* Bit 9 : Unused power bit 8 */
#define VMC_RAMB_POWER_UNUSED_POWER8_Pos (9UL) /*!< Position of UNUSED_POWER8 field. */
#define VMC_RAMB_POWER_UNUSED_POWER8_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_POWER8_Pos) /*!< Bit mask of UNUSED_POWER8 field. */

/* Bit 8 : Unused power bit 7 */
#define VMC_RAMB_POWER_UNUSED_POWER7_Pos (8UL) /*!< Position of UNUSED_POWER7 field. */
#define VMC_RAMB_POWER_UNUSED_POWER7_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_POWER7_Pos) /*!< Bit mask of UNUSED_POWER7 field. */

/* Bit 7 : Unused power bit 6 */
#define VMC_RAMB_POWER_UNUSED_POWER6_Pos (7UL) /*!< Position of UNUSED_POWER6 field. */
#define VMC_RAMB_POWER_UNUSED_POWER6_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_POWER6_Pos) /*!< Bit mask of UNUSED_POWER6 field. */

/* Bit 6 : Unused power bit 5 */
#define VMC_RAMB_POWER_UNUSED_POWER5_Pos (6UL) /*!< Position of UNUSED_POWER5 field. */
#define VMC_RAMB_POWER_UNUSED_POWER5_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_POWER5_Pos) /*!< Bit mask of UNUSED_POWER5 field. */

/* Bit 5 : Unused power bit 4 */
#define VMC_RAMB_POWER_UNUSED_POWER4_Pos (5UL) /*!< Position of UNUSED_POWER4 field. */
#define VMC_RAMB_POWER_UNUSED_POWER4_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_POWER4_Pos) /*!< Bit mask of UNUSED_POWER4 field. */

/* Bit 4 : Unused power bit 3 */
#define VMC_RAMB_POWER_UNUSED_POWER3_Pos (4UL) /*!< Position of UNUSED_POWER3 field. */
#define VMC_RAMB_POWER_UNUSED_POWER3_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_POWER3_Pos) /*!< Bit mask of UNUSED_POWER3 field. */

/* Bit 3 : Unused power bit 2 */
#define VMC_RAMB_POWER_UNUSED_POWER2_Pos (3UL) /*!< Position of UNUSED_POWER2 field. */
#define VMC_RAMB_POWER_UNUSED_POWER2_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_POWER2_Pos) /*!< Bit mask of UNUSED_POWER2 field. */

/* Bit 2 : Unused power bit 1 */
#define VMC_RAMB_POWER_UNUSED_POWER1_Pos (2UL) /*!< Position of UNUSED_POWER1 field. */
#define VMC_RAMB_POWER_UNUSED_POWER1_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_POWER1_Pos) /*!< Bit mask of UNUSED_POWER1 field. */

/* Bit 1 : Unused power bit 0 */
#define VMC_RAMB_POWER_UNUSED_POWER0_Pos (1UL) /*!< Position of UNUSED_POWER0 field. */
#define VMC_RAMB_POWER_UNUSED_POWER0_Msk (0x1UL << VMC_RAMB_POWER_UNUSED_POWER0_Pos) /*!< Bit mask of UNUSED_POWER0 field. */

/* Bit 0 : Keep RAM sections S0-S15 of RAM Bn on or off in System ON mode */
#define VMC_RAMB_POWER_S015POWER_Pos (0UL) /*!< Position of S015POWER field. */
#define VMC_RAMB_POWER_S015POWER_Msk (0x1UL << VMC_RAMB_POWER_S015POWER_Pos) /*!< Bit mask of S015POWER field. */
#define VMC_RAMB_POWER_S015POWER_Off (0UL) /*!< Off */
#define VMC_RAMB_POWER_S015POWER_On (1UL) /*!< On */

/* Register: VMC_RAMB_POWERSET */
/* Description: Description cluster: RAM Bn power control set register */

/* Bit 31 : Unused retention set bit 14 */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION14_Pos (31UL) /*!< Position of UNUSED_RETENTION14 field. */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION14_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_RETENTION14_Pos) /*!< Bit mask of UNUSED_RETENTION14 field. */

/* Bit 30 : Unused retention set bit 13 */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION13_Pos (30UL) /*!< Position of UNUSED_RETENTION13 field. */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION13_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_RETENTION13_Pos) /*!< Bit mask of UNUSED_RETENTION13 field. */

/* Bit 29 : Unused retention set bit 12 */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION12_Pos (29UL) /*!< Position of UNUSED_RETENTION12 field. */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION12_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_RETENTION12_Pos) /*!< Bit mask of UNUSED_RETENTION12 field. */

