adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem_bitfields.h
/* Bit 17 : Unused retention set bit */
#define VMC_RAMC_POWERSET_UNUSED_RETENTION1_Pos (17UL) /*!< Position of UNUSED_RETENTION1 field. */
#define VMC_RAMC_POWERSET_UNUSED_RETENTION1_Msk (0x1UL << VMC_RAMC_POWERSET_UNUSED_RETENTION1_Pos) /*!< Bit mask of UNUSED_RETENTION1 field. */

/* Bit 16 : Keep retention on sections S0 and S1 of RAM of RAM Cn when RAM section is switched off */
#define VMC_RAMC_POWERSET_S01RETENTION_Pos (16UL) /*!< Position of S01RETENTION field. */
#define VMC_RAMC_POWERSET_S01RETENTION_Msk (0x1UL << VMC_RAMC_POWERSET_S01RETENTION_Pos) /*!< Bit mask of S01RETENTION field. */
#define VMC_RAMC_POWERSET_S01RETENTION_On (1UL) /*!< On */

/* Bit 1 : Unused power set bit */
#define VMC_RAMC_POWERSET_UNUSED_POWER1_Pos (1UL) /*!< Position of UNUSED_POWER1 field. */
#define VMC_RAMC_POWERSET_UNUSED_POWER1_Msk (0x1UL << VMC_RAMC_POWERSET_UNUSED_POWER1_Pos) /*!< Bit mask of UNUSED_POWER1 field. */

/* Bit 0 : Keep RAM sections S0 and S1 of RAM Cn on or off in System ON mode */
#define VMC_RAMC_POWERSET_S01POWER_Pos (0UL) /*!< Position of S01POWER field. */
#define VMC_RAMC_POWERSET_S01POWER_Msk (0x1UL << VMC_RAMC_POWERSET_S01POWER_Pos) /*!< Bit mask of S01POWER field. */
#define VMC_RAMC_POWERSET_S01POWER_On (1UL) /*!< On */

/* Register: VMC_RAMC_POWERCLR */
/* Description: Description cluster: RAM  Cn power control clear register */

/* Bit 17 : Unused retention clear bit */
#define VMC_RAMC_POWERCLR_UNUSED_RETENTION1_Pos (17UL) /*!< Position of UNUSED_RETENTION1 field. */
#define VMC_RAMC_POWERCLR_UNUSED_RETENTION1_Msk (0x1UL << VMC_RAMC_POWERCLR_UNUSED_RETENTION1_Pos) /*!< Bit mask of UNUSED_RETENTION1 field. */

/* Bit 16 : Keep retention on RAM sections S0 and S1 of RAM Cn when RAM section is switched off */
#define VMC_RAMC_POWERCLR_S01RETENTION_Pos (16UL) /*!< Position of S01RETENTION field. */
#define VMC_RAMC_POWERCLR_S01RETENTION_Msk (0x1UL << VMC_RAMC_POWERCLR_S01RETENTION_Pos) /*!< Bit mask of S01RETENTION field. */
#define VMC_RAMC_POWERCLR_S01RETENTION_Off (1UL) /*!< Off */

/* Bit 1 : Unused power clear bit */
#define VMC_RAMC_POWERCLR_UNUSED_POWER1_Pos (1UL) /*!< Position of UNUSED_POWER1 field. */
#define VMC_RAMC_POWERCLR_UNUSED_POWER1_Msk (0x1UL << VMC_RAMC_POWERCLR_UNUSED_POWER1_Pos) /*!< Bit mask of UNUSED_POWER1 field. */

/* Bit 0 : Keep RAM sections S0 and S1 of RAM Cn on or off in System ON mode */
#define VMC_RAMC_POWERCLR_S01POWER_Pos (0UL) /*!< Position of S01POWER field. */
#define VMC_RAMC_POWERCLR_S01POWER_Msk (0x1UL << VMC_RAMC_POWERCLR_S01POWER_Pos) /*!< Bit mask of S01POWER field. */
#define VMC_RAMC_POWERCLR_S01POWER_Off (1UL) /*!< Off */

/* Register: VMC_RAMD_POWER */
/* Description: Description cluster: RAM Dn power control register */

/* Bit 17 : Unused retention bit */
#define VMC_RAMD_POWER_UNUSED_RETENTION1_Pos (17UL) /*!< Position of UNUSED_RETENTION1 field. */
#define VMC_RAMD_POWER_UNUSED_RETENTION1_Msk (0x1UL << VMC_RAMD_POWER_UNUSED_RETENTION1_Pos) /*!< Bit mask of UNUSED_RETENTION1 field. */

/* Bit 16 : Keep retention on RAM sections S0 and S1 of RAM Dn when RAM section is switched off */
#define VMC_RAMD_POWER_S01RETENTION_Pos (16UL) /*!< Position of S01RETENTION field. */
#define VMC_RAMD_POWER_S01RETENTION_Msk (0x1UL << VMC_RAMD_POWER_S01RETENTION_Pos) /*!< Bit mask of S01RETENTION field. */
#define VMC_RAMD_POWER_S01RETENTION_Off (0UL) /*!< Off */
#define VMC_RAMD_POWER_S01RETENTION_On (1UL) /*!< On */

/* Bit 1 : Unused power bit */
#define VMC_RAMD_POWER_UNUSED_POWER1_Pos (1UL) /*!< Position of UNUSED_POWER1 field. */
#define VMC_RAMD_POWER_UNUSED_POWER1_Msk (0x1UL << VMC_RAMD_POWER_UNUSED_POWER1_Pos) /*!< Bit mask of UNUSED_POWER1 field. */

/* Bit 0 : Keep RAM sections S0 and S1 of RAM Dn on or off in System ON mode */
#define VMC_RAMD_POWER_S01POWER_Pos (0UL) /*!< Position of S01POWER field. */
#define VMC_RAMD_POWER_S01POWER_Msk (0x1UL << VMC_RAMD_POWER_S01POWER_Pos) /*!< Bit mask of S01POWER field. */
#define VMC_RAMD_POWER_S01POWER_Off (0UL) /*!< Off */
#define VMC_RAMD_POWER_S01POWER_On (1UL) /*!< On */

/* Register: VMC_RAMD_POWERSET */
/* Description: Description cluster: RAM Dn power control set register */

/* Bit 17 : Unused retention set bit */
#define VMC_RAMD_POWERSET_UNUSED_RETENTION1_Pos (17UL) /*!< Position of UNUSED_RETENTION1 field. */
#define VMC_RAMD_POWERSET_UNUSED_RETENTION1_Msk (0x1UL << VMC_RAMD_POWERSET_UNUSED_RETENTION1_Pos) /*!< Bit mask of UNUSED_RETENTION1 field. */

/* Bit 16 : Keep retention on sections S0 and S1 of RAM of RAM Dn when RAM section is switched off */
#define VMC_RAMD_POWERSET_S01RETENTION_Pos (16UL) /*!< Position of S01RETENTION field. */
#define VMC_RAMD_POWERSET_S01RETENTION_Msk (0x1UL << VMC_RAMD_POWERSET_S01RETENTION_Pos) /*!< Bit mask of S01RETENTION field. */
#define VMC_RAMD_POWERSET_S01RETENTION_On (1UL) /*!< On */

/* Bit 1 : Unused power set bit */
#define VMC_RAMD_POWERSET_UNUSED_POWER1_Pos (1UL) /*!< Position of UNUSED_POWER1 field. */
#define VMC_RAMD_POWERSET_UNUSED_POWER1_Msk (0x1UL << VMC_RAMD_POWERSET_UNUSED_POWER1_Pos) /*!< Bit mask of UNUSED_POWER1 field. */

/* Bit 0 : Keep RAM sections S0 and S1 of RAM Dn on or off in System ON mode */
#define VMC_RAMD_POWERSET_S01POWER_Pos (0UL) /*!< Position of S01POWER field. */
#define VMC_RAMD_POWERSET_S01POWER_Msk (0x1UL << VMC_RAMD_POWERSET_S01POWER_Pos) /*!< Bit mask of S01POWER field. */
#define VMC_RAMD_POWERSET_S01POWER_On (1UL) /*!< On */

/* Register: VMC_RAMD_POWERCLR */
/* Description: Description cluster: RAM  Dn power control clear register */

/* Bit 17 : Unused retention clear bit */
#define VMC_RAMD_POWERCLR_UNUSED_RETENTION1_Pos (17UL) /*!< Position of UNUSED_RETENTION1 field. */
#define VMC_RAMD_POWERCLR_UNUSED_RETENTION1_Msk (0x1UL << VMC_RAMD_POWERCLR_UNUSED_RETENTION1_Pos) /*!< Bit mask of UNUSED_RETENTION1 field. */

/* Bit 16 : Keep retention on RAM sections S0 and S1 of RAM Dn when RAM section is switched off */
#define VMC_RAMD_POWERCLR_S01RETENTION_Pos (16UL) /*!< Position of S01RETENTION field. */
#define VMC_RAMD_POWERCLR_S01RETENTION_Msk (0x1UL << VMC_RAMD_POWERCLR_S01RETENTION_Pos) /*!< Bit mask of S01RETENTION field. */
#define VMC_RAMD_POWERCLR_S01RETENTION_Off (1UL) /*!< Off */

/* Bit 1 : Unused power clear bit */
#define VMC_RAMD_POWERCLR_UNUSED_POWER1_Pos (1UL) /*!< Position of UNUSED_POWER1 field. */
#define VMC_RAMD_POWERCLR_UNUSED_POWER1_Msk (0x1UL << VMC_RAMD_POWERCLR_UNUSED_POWER1_Pos) /*!< Bit mask of UNUSED_POWER1 field. */

