adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem_bitfields.h
/* Bit 0 : Keep RAM sections S0 and S1 of RAM Dn on or off in System ON mode */
#define VMC_RAMD_POWERCLR_S01POWER_Pos (0UL) /*!< Position of S01POWER field. */
#define VMC_RAMD_POWERCLR_S01POWER_Msk (0x1UL << VMC_RAMD_POWERCLR_S01POWER_Pos) /*!< Bit mask of S01POWER field. */
#define VMC_RAMD_POWERCLR_S01POWER_Off (1UL) /*!< Off */

/* Register: VMC_SRAMTRIM */
/* Description: Backdoor trim values for SRAM */

/* Bit 6 : Read/Write Margin Adjustment */
#define VMC_SRAMTRIM_RWM_Pos (6UL) /*!< Position of RWM field. */
#define VMC_SRAMTRIM_RWM_Msk (0x1UL << VMC_SRAMTRIM_RWM_Pos) /*!< Bit mask of RWM field. */
#define VMC_SRAMTRIM_RWM_Disabled (0UL) /*!< Disable */
#define VMC_SRAMTRIM_RWM_Enabled (1UL) /*!< Enable */

/* Bit 5 : Read Margin Adjustment */
#define VMC_SRAMTRIM_RM_Pos (5UL) /*!< Position of RM field. */
#define VMC_SRAMTRIM_RM_Msk (0x1UL << VMC_SRAMTRIM_RM_Pos) /*!< Bit mask of RM field. */
#define VMC_SRAMTRIM_RM_Disabled (0UL) /*!< Disable */
#define VMC_SRAMTRIM_RM_Enabled (1UL) /*!< Enable */

/* Bit 4 : Write Margin Adjustment */
#define VMC_SRAMTRIM_WM_Pos (4UL) /*!< Position of WM field. */
#define VMC_SRAMTRIM_WM_Msk (0x1UL << VMC_SRAMTRIM_WM_Pos) /*!< Bit mask of WM field. */
#define VMC_SRAMTRIM_WM_Disabled (0UL) /*!< Disable */
#define VMC_SRAMTRIM_WM_Enabled (1UL) /*!< Enable */

/* Bits 3..0 : Source Bias Trim Adjustment for retention */
#define VMC_SRAMTRIM_BTRIM_Pos (0UL) /*!< Position of BTRIM field. */
#define VMC_SRAMTRIM_BTRIM_Msk (0xFUL << VMC_SRAMTRIM_BTRIM_Pos) /*!< Bit mask of BTRIM field. */

/* Register: VMC_RamSSNonRetTSel */
/* Description: Timing control values for TSMC RAMs */

/* Bits 4..2 : Write cycle timing selection */
#define VMC_RamSSNonRetTSel_WTSEL_Pos (2UL) /*!< Position of WTSEL field. */
#define VMC_RamSSNonRetTSel_WTSEL_Msk (0x7UL << VMC_RamSSNonRetTSel_WTSEL_Pos) /*!< Bit mask of WTSEL field. */

/* Bits 1..0 : Read cycle timing selection */
#define VMC_RamSSNonRetTSel_RTSEL_Pos (0UL) /*!< Position of RTSEL field. */
#define VMC_RamSSNonRetTSel_RTSEL_Msk (0x3UL << VMC_RamSSNonRetTSel_RTSEL_Pos) /*!< Bit mask of RTSEL field. */


/* Peripheral: ZUC */
/* Description: ZUC LTE L2 security IP */

/* Register: ZUC_TASKS_STARTGATHER */
/* Description: Start input DMA */

/* Bit 0 : Start input DMA */
#define ZUC_TASKS_STARTGATHER_TASKS_STARTGATHER_Pos (0UL) /*!< Position of TASKS_STARTGATHER field. */
#define ZUC_TASKS_STARTGATHER_TASKS_STARTGATHER_Msk (0x1UL << ZUC_TASKS_STARTGATHER_TASKS_STARTGATHER_Pos) /*!< Bit mask of TASKS_STARTGATHER field. */
#define ZUC_TASKS_STARTGATHER_TASKS_STARTGATHER_Trigger (1UL) /*!< Trigger task */

/* Register: ZUC_TASKS_STOPGATHER */
/* Description: Stop  input DMA */

/* Bit 0 : Stop  input DMA */
#define ZUC_TASKS_STOPGATHER_TASKS_STOPGATHER_Pos (0UL) /*!< Position of TASKS_STOPGATHER field. */
#define ZUC_TASKS_STOPGATHER_TASKS_STOPGATHER_Msk (0x1UL << ZUC_TASKS_STOPGATHER_TASKS_STOPGATHER_Pos) /*!< Bit mask of TASKS_STOPGATHER field. */
#define ZUC_TASKS_STOPGATHER_TASKS_STOPGATHER_Trigger (1UL) /*!< Trigger task */

/* Register: ZUC_TASKS_STARTSCATTER */
/* Description: Start output DMA */

/* Bit 0 : Start output DMA */
#define ZUC_TASKS_STARTSCATTER_TASKS_STARTSCATTER_Pos (0UL) /*!< Position of TASKS_STARTSCATTER field. */
#define ZUC_TASKS_STARTSCATTER_TASKS_STARTSCATTER_Msk (0x1UL << ZUC_TASKS_STARTSCATTER_TASKS_STARTSCATTER_Pos) /*!< Bit mask of TASKS_STARTSCATTER field. */
#define ZUC_TASKS_STARTSCATTER_TASKS_STARTSCATTER_Trigger (1UL) /*!< Trigger task */

/* Register: ZUC_TASKS_STOPSCATTER */
/* Description: Stop  output DMA */

/* Bit 0 : Stop  output DMA */
#define ZUC_TASKS_STOPSCATTER_TASKS_STOPSCATTER_Pos (0UL) /*!< Position of TASKS_STOPSCATTER field. */
#define ZUC_TASKS_STOPSCATTER_TASKS_STOPSCATTER_Msk (0x1UL << ZUC_TASKS_STOPSCATTER_TASKS_STOPSCATTER_Pos) /*!< Bit mask of TASKS_STOPSCATTER field. */
#define ZUC_TASKS_STOPSCATTER_TASKS_STOPSCATTER_Trigger (1UL) /*!< Trigger task */

/* Register: ZUC_TASKS_INITIALIZEZUC */
/* Description: New keys (and IV) ready to be used, reset keybytes, ivbytes */

/* Bit 0 : New keys (and IV) ready to be used, reset keybytes, ivbytes */
#define ZUC_TASKS_INITIALIZEZUC_TASKS_INITIALIZEZUC_Pos (0UL) /*!< Position of TASKS_INITIALIZEZUC field. */
#define ZUC_TASKS_INITIALIZEZUC_TASKS_INITIALIZEZUC_Msk (0x1UL << ZUC_TASKS_INITIALIZEZUC_TASKS_INITIALIZEZUC_Pos) /*!< Bit mask of TASKS_INITIALIZEZUC field. */
#define ZUC_TASKS_INITIALIZEZUC_TASKS_INITIALIZEZUC_Trigger (1UL) /*!< Trigger task */

/* Register: ZUC_TASKS_STARTOPERATION */
/* Description: Start cipher / MAC calculation depending on MODE */

/* Bit 0 : Start cipher / MAC calculation depending on MODE */
#define ZUC_TASKS_STARTOPERATION_TASKS_STARTOPERATION_Pos (0UL) /*!< Position of TASKS_STARTOPERATION field. */
#define ZUC_TASKS_STARTOPERATION_TASKS_STARTOPERATION_Msk (0x1UL << ZUC_TASKS_STARTOPERATION_TASKS_STARTOPERATION_Pos) /*!< Bit mask of TASKS_STARTOPERATION field. */
#define ZUC_TASKS_STARTOPERATION_TASKS_STARTOPERATION_Trigger (1UL) /*!< Trigger task */

/* Register: ZUC_TASKS_FINALIZEMAC */
/* Description: Finalize MAC calculation */

/* Bit 0 : Finalize MAC calculation */
#define ZUC_TASKS_FINALIZEMAC_TASKS_FINALIZEMAC_Pos (0UL) /*!< Position of TASKS_FINALIZEMAC field. */
#define ZUC_TASKS_FINALIZEMAC_TASKS_FINALIZEMAC_Msk (0x1UL << ZUC_TASKS_FINALIZEMAC_TASKS_FINALIZEMAC_Pos) /*!< Bit mask of TASKS_FINALIZEMAC field. */
#define ZUC_TASKS_FINALIZEMAC_TASKS_FINALIZEMAC_Trigger (1UL) /*!< Trigger task */

/* Register: ZUC_TASKS_RESET */
/* Description: Stop all transfers and crypto operations (initialize) */

/* Bit 0 : Stop all transfers and crypto operations (initialize) */
#define ZUC_TASKS_RESET_TASKS_RESET_Pos (0UL) /*!< Position of TASKS_RESET field. */
#define ZUC_TASKS_RESET_TASKS_RESET_Msk (0x1UL << ZUC_TASKS_RESET_TASKS_RESET_Pos) /*!< Bit mask of TASKS_RESET field. */
#define ZUC_TASKS_RESET_TASKS_RESET_Trigger (1UL) /*!< Trigger task */

/* Register: ZUC_EVENTS_GATHERSTARTED */
/* Description: Input DMA started */

/* Bit 0 : Input DMA started */
#define ZUC_EVENTS_GATHERSTARTED_EVENTS_GATHERSTARTED_Pos (0UL) /*!< Position of EVENTS_GATHERSTARTED field. */
#define ZUC_EVENTS_GATHERSTARTED_EVENTS_GATHERSTARTED_Msk (0x1UL << ZUC_EVENTS_GATHERSTARTED_EVENTS_GATHERSTARTED_Pos) /*!< Bit mask of EVENTS_GATHERSTARTED field. */
#define ZUC_EVENTS_GATHERSTARTED_EVENTS_GATHERSTARTED_NotGenerated (0UL) /*!< Event not generated */
#define ZUC_EVENTS_GATHERSTARTED_EVENTS_GATHERSTARTED_Generated (1UL) /*!< Event generated */

/* Register: ZUC_EVENTS_GATHERDONE */
/* Description: Input DMA done */

/* Bit 0 : Input DMA done */
#define ZUC_EVENTS_GATHERDONE_EVENTS_GATHERDONE_Pos (0UL) /*!< Position of EVENTS_GATHERDONE field. */
#define ZUC_EVENTS_GATHERDONE_EVENTS_GATHERDONE_Msk (0x1UL << ZUC_EVENTS_GATHERDONE_EVENTS_GATHERDONE_Pos) /*!< Bit mask of EVENTS_GATHERDONE field. */
#define ZUC_EVENTS_GATHERDONE_EVENTS_GATHERDONE_NotGenerated (0UL) /*!< Event not generated */
#define ZUC_EVENTS_GATHERDONE_EVENTS_GATHERDONE_Generated (1UL) /*!< Event generated */

