adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem_bitfields.h
/* Register: ZUC_LENGTH */
/* Description: Keystream length in bits (Cipher), message length in bits (MAC) */

/* Bits 31..0 : Stream/message length */
#define ZUC_LENGTH_LENGTH_Pos (0UL) /*!< Position of LENGTH field. */
#define ZUC_LENGTH_LENGTH_Msk (0xFFFFFFFFUL << ZUC_LENGTH_LENGTH_Pos) /*!< Bit mask of LENGTH field. */

/* Register: ZUC_MODE */
/* Description: Mode select */

/* Bit 0 : Mode select. */
#define ZUC_MODE_MODE_Pos (0UL) /*!< Position of MODE field. */
#define ZUC_MODE_MODE_Msk (0x1UL << ZUC_MODE_MODE_Pos) /*!< Bit mask of MODE field. */
#define ZUC_MODE_MODE_CIPHER (0UL) /*!< Data cipher mode */
#define ZUC_MODE_MODE_MAC (1UL) /*!< MAC mode. */

/* Register: ZUC_MAC */
/* Description: Message Authentication Code. */

/* Bits 31..0 : Calculated MAC. */
#define ZUC_MAC_MAC_Pos (0UL) /*!< Position of MAC field. */
#define ZUC_MAC_MAC_Msk (0xFFFFFFFFUL << ZUC_MAC_MAC_Pos) /*!< Bit mask of MAC field. */

/* Register: ZUC_INDCP_MEMORY_ADDR */
/* Description: Pointer to input DMA scatter and gather job list (Write) / current output job address (Read) */

/* Bits 31..0 : Scatter and gather input job pointer / current input job address. */
#define ZUC_INDCP_MEMORY_ADDR_MEMORY_ADDR_Pos (0UL) /*!< Position of MEMORY_ADDR field. */
#define ZUC_INDCP_MEMORY_ADDR_MEMORY_ADDR_Msk (0xFFFFFFFFUL << ZUC_INDCP_MEMORY_ADDR_MEMORY_ADDR_Pos) /*!< Bit mask of MEMORY_ADDR field. */

/* Register: ZUC_OUTDCP_MEMORY_ADDR */
/* Description: Pointer to output DMA scatter and gather job list (Write) / current output job address (Read) */

/* Bits 31..0 : Scatter and gather output job pointer / current output job address. */
#define ZUC_OUTDCP_MEMORY_ADDR_MEMORY_ADDR_Pos (0UL) /*!< Position of MEMORY_ADDR field. */
#define ZUC_OUTDCP_MEMORY_ADDR_MEMORY_ADDR_Msk (0xFFFFFFFFUL << ZUC_OUTDCP_MEMORY_ADDR_MEMORY_ADDR_Pos) /*!< Bit mask of MEMORY_ADDR field. */


/*lint --flb "Leave library region" */
#endif
